#![cfg_attr(feature = "no-std", no_std)]
#![allow(non_camel_case_types)]
#![allow(non_snake_case)]
#![allow(dead_code)]
#![allow(improper_ctypes)]
#[cfg(feature = "no-std")]
extern crate alloc;
#[cfg(feature = "no-std")]
extern crate no_std_compat as std;

/* automatically generated by rust-bindgen 0.72.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    fn extract_bit(byte: u8, index: usize) -> bool {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        Self::extract_bit(byte, index)
    }
    #[inline]
    pub unsafe fn raw_get_bit(this: *const Self, index: usize) -> bool {
        debug_assert!(index / 8 < core::mem::size_of::<Storage>());
        let byte_index = index / 8;
        let byte = unsafe {

pub const cudaInitDeviceFlagsAreValid: u32 = 1;
pub const cudaArraySparsePropertiesSingleMipTail: u32 = 1;
pub const cudaMemPoolCreateUsageHwDecompress: u32 = 2;
pub const CUDA_IPC_HANDLE_SIZE: u32 = 64;
pub const cudaExternalMemoryDedicated: u32 = 1;
pub const cudaExternalSemaphoreSignalSkipNvSciBufMemSync: u32 = 1;
pub const cudaExternalSemaphoreWaitSkipNvSciBufMemSync: u32 = 2;
pub const cudaNvSciSyncAttrSignal: u32 = 1;
pub const cudaNvSciSyncAttrWait: u32 = 2;
pub const cudaGraphKernelNodePortDefault: u32 = 0;
pub const cudaGraphKernelNodePortProgrammatic: u32 = 1;
pub const cudaGraphKernelNodePortLaunchCompletion: u32 = 2;
pub const cudaSurfaceType1D: u32 = 1;
pub const cudaSurfaceType2D: u32 = 2;
pub const cudaSurfaceType3D: u32 = 3;
pub const cudaSurfaceTypeCubemap: u32 = 12;
pub const cudaSurfaceType1DLayered: u32 = 241;
pub const cudaSurfaceType2DLayered: u32 = 242;
pub const cudaSurfaceTypeCubemapLayered: u32 = 252;
pub const cudaTextureType1D: u32 = 1;
pub const cudaTextureType2D: u32 = 2;
pub const cudaTextureType3D: u32 = 3;
pub const cudaTextureTypeCubemap: u32 = 12;
pub const cudaTextureType1DLayered: u32 = 241;
pub const cudaTextureType2DLayered: u32 = 242;
pub const cudaTextureTypeCubemapLayered: u32 = 252;
pub const CUDART_VERSION: u32 = 13000;
pub const __CUDART_API_VERSION: u32 = 13000;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __fsid_t"][::std::mem::size_of::<__fsid_t>() - 8usize];
    ["Alignment of __fsid_t"][::std::mem::align_of::<__fsid_t>() - 4usize];
    ["Offset of field: __fsid_t::__val"][::std::mem::offset_of!(__fsid_t, __val) - 0usize];
};
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type __gnuc_va_list = __builtin_va_list;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: ::std::os::raw::c_uint,
    pub __wchb: [::std::os::raw::c_char; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t__bindgen_ty_1"]
        [::std::mem::size_of::<__mbstate_t__bindgen_ty_1>() - 4usize];
    ["Alignment of __mbstate_t__bindgen_ty_1"]
        [::std::mem::align_of::<__mbstate_t__bindgen_ty_1>() - 4usize];
    ["Offset of field: __mbstate_t__bindgen_ty_1::__wch"]
        [::std::mem::offset_of!(__mbstate_t__bindgen_ty_1, __wch) - 0usize];
    ["Offset of field: __mbstate_t__bindgen_ty_1::__wchb"]
        [::std::mem::offset_of!(__mbstate_t__bindgen_ty_1, __wchb) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t"][::std::mem::size_of::<__mbstate_t>() - 8usize];
    ["Alignment of __mbstate_t"][::std::mem::align_of::<__mbstate_t>() - 4usize];
    ["Offset of field: __mbstate_t::__count"]
        [::std::mem::offset_of!(__mbstate_t, __count) - 0usize];
    ["Offset of field: __mbstate_t::__value"]
        [::std::mem::offset_of!(__mbstate_t, __value) - 4usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _G_fpos_t"][::std::mem::size_of::<_G_fpos_t>() - 16usize];
    ["Alignment of _G_fpos_t"][::std::mem::align_of::<_G_fpos_t>() - 8usize];
    ["Offset of field: _G_fpos_t::__pos"][::std::mem::offset_of!(_G_fpos_t, __pos) - 0usize];
    ["Offset of field: _G_fpos_t::__state"][::std::mem::offset_of!(_G_fpos_t, __state) - 8usize];
};
pub type __fpos_t = _G_fpos_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _G_fpos64_t"][::std::mem::size_of::<_G_fpos64_t>() - 16usize];
    ["Alignment of _G_fpos64_t"][::std::mem::align_of::<_G_fpos64_t>() - 8usize];
    ["Offset of field: _G_fpos64_t::__pos"][::std::mem::offset_of!(_G_fpos64_t, __pos) - 0usize];
    ["Offset of field: _G_fpos64_t::__state"]
        [::std::mem::offset_of!(_G_fpos64_t, __state) - 8usize];
};
pub type __fpos64_t = _G_fpos64_t;
pub type __FILE = _IO_FILE;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 3usize]>,
    pub _short_backupbuf: [::std::os::raw::c_char; 1usize],
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub _codecvt: *mut _IO_codecvt,
    pub _wide_data: *mut _IO_wide_data,
    pub _freeres_list: *mut _IO_FILE,
    pub _freeres_buf: *mut ::std::os::raw::c_void,
    pub _prevchain: *mut *mut _IO_FILE,
    pub _mode: ::std::os::raw::c_int,
    pub _unused3: ::std::os::raw::c_int,
    pub _total_written: __uint64_t,
    pub _unused2: [::std::os::raw::c_char; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_FILE"][::std::mem::size_of::<_IO_FILE>() - 216usize];
    ["Alignment of _IO_FILE"][::std::mem::align_of::<_IO_FILE>() - 8usize];
    ["Offset of field: _IO_FILE::_flags"][::std::mem::offset_of!(_IO_FILE, _flags) - 0usize];
    ["Offset of field: _IO_FILE::_IO_read_ptr"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_ptr) - 8usize];
    ["Offset of field: _IO_FILE::_IO_read_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_end) - 16usize];
    ["Offset of field: _IO_FILE::_IO_read_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_base) - 24usize];
    ["Offset of field: _IO_FILE::_IO_write_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_base) - 32usize];
    ["Offset of field: _IO_FILE::_IO_write_ptr"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_ptr) - 40usize];
    ["Offset of field: _IO_FILE::_IO_write_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_end) - 48usize];
    ["Offset of field: _IO_FILE::_IO_buf_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_buf_base) - 56usize];
    ["Offset of field: _IO_FILE::_IO_buf_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_buf_end) - 64usize];
    ["Offset of field: _IO_FILE::_IO_save_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_save_base) - 72usize];
    ["Offset of field: _IO_FILE::_IO_backup_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_backup_base) - 80usize];
    ["Offset of field: _IO_FILE::_IO_save_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_save_end) - 88usize];
    ["Offset of field: _IO_FILE::_markers"][::std::mem::offset_of!(_IO_FILE, _markers) - 96usize];
    ["Offset of field: _IO_FILE::_chain"][::std::mem::offset_of!(_IO_FILE, _chain) - 104usize];
    ["Offset of field: _IO_FILE::_fileno"][::std::mem::offset_of!(_IO_FILE, _fileno) - 112usize];
    ["Offset of field: _IO_FILE::_short_backupbuf"]
        [::std::mem::offset_of!(_IO_FILE, _short_backupbuf) - 119usize];
    ["Offset of field: _IO_FILE::_old_offset"]
        [::std::mem::offset_of!(_IO_FILE, _old_offset) - 120usize];
    ["Offset of field: _IO_FILE::_cur_column"]
        [::std::mem::offset_of!(_IO_FILE, _cur_column) - 128usize];
    ["Offset of field: _IO_FILE::_vtable_offset"]
        [::std::mem::offset_of!(_IO_FILE, _vtable_offset) - 130usize];
    ["Offset of field: _IO_FILE::_shortbuf"]
        [::std::mem::offset_of!(_IO_FILE, _shortbuf) - 131usize];
    ["Offset of field: _IO_FILE::_lock"][::std::mem::offset_of!(_IO_FILE, _lock) - 136usize];
    ["Offset of field: _IO_FILE::_offset"][::std::mem::offset_of!(_IO_FILE, _offset) - 144usize];
    ["Offset of field: _IO_FILE::_codecvt"][::std::mem::offset_of!(_IO_FILE, _codecvt) - 152usize];
    ["Offset of field: _IO_FILE::_wide_data"]
        [::std::mem::offset_of!(_IO_FILE, _wide_data) - 160usize];
    ["Offset of field: _IO_FILE::_freeres_list"]
        [::std::mem::offset_of!(_IO_FILE, _freeres_list) - 168usize];
    ["Offset of field: _IO_FILE::_freeres_buf"]
        [::std::mem::offset_of!(_IO_FILE, _freeres_buf) - 176usize];
    ["Offset of field: _IO_FILE::_prevchain"]
        [::std::mem::offset_of!(_IO_FILE, _prevchain) - 184usize];
    ["Offset of field: _IO_FILE::_mode"][::std::mem::offset_of!(_IO_FILE, _mode) - 192usize];
    ["Offset of field: _IO_FILE::_unused3"][::std::mem::offset_of!(_IO_FILE, _unused3) - 196usize];
    ["Offset of field: _IO_FILE::_total_written"]
        [::std::mem::offset_of!(_IO_FILE, _total_written) - 200usize];
    ["Offset of field: _IO_FILE::_unused2"][::std::mem::offset_of!(_IO_FILE, _unused2) - 208usize];
};
impl _IO_FILE {
    #[inline]
    pub fn _flags2(&self) -> ::std::os::raw::c_int {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 24u8) as u32) }
    }
    #[inline]
    pub fn set__flags2(&mut self, val: ::std::os::raw::c_int) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 24u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn _flags2_raw(this: *const Self) -> ::std::os::raw::c_int {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                24u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set__flags2_raw(this: *mut Self, val: ::std::os::raw::c_int) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                24u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(_flags2: ::std::os::raw::c_int) -> __BindgenBitfieldUnit<[u8; 3usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 3usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 24u8, {
            let _flags2: u32 = unsafe { ::std::mem::transmute(_flags2) };
            _flags2 as u64
        });
        __bindgen_bitfield_unit
    }
}
pub type cookie_read_function_t = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __buf: *mut ::std::os::raw::c_char,
        __nbytes: usize,
    ) -> __ssize_t,
>;
pub type cookie_write_function_t = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __buf: *const ::std::os::raw::c_char,
        __nbytes: usize,
    ) -> __ssize_t,
>;
pub type cookie_seek_function_t = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __pos: *mut __off64_t,
        __w: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type cookie_close_function_t = ::std::option::Option<
    unsafe extern "C" fn(__cookie: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_cookie_io_functions_t {
    pub read: cookie_read_function_t,
    pub write: cookie_write_function_t,
    pub seek: cookie_seek_function_t,
    pub close: cookie_close_function_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_cookie_io_functions_t"]
        [::std::mem::size_of::<_IO_cookie_io_functions_t>() - 32usize];
    ["Alignment of _IO_cookie_io_functions_t"]
        [::std::mem::align_of::<_IO_cookie_io_functions_t>() - 8usize];
    ["Offset of field: _IO_cookie_io_functions_t::read"]
        [::std::mem::offset_of!(_IO_cookie_io_functions_t, read) - 0usize];
    ["Offset of field: _IO_cookie_io_functions_t::write"]
        [::std::mem::offset_of!(_IO_cookie_io_functions_t, write) - 8usize];
    ["Offset of field: _IO_cookie_io_functions_t::seek"]
        [::std::mem::offset_of!(_IO_cookie_io_functions_t, seek) - 16usize];
    ["Offset of field: _IO_cookie_io_functions_t::close"]
        [::std::mem::offset_of!(_IO_cookie_io_functions_t, close) - 24usize];
};
pub type cookie_io_functions_t = _IO_cookie_io_functions_t;
pub type va_list = __gnuc_va_list;
pub type off_t = __off_t;
pub type fpos_t = __fpos_t;
unsafe extern "C" {
    pub static mut stdin: *mut FILE;
}
unsafe extern "C" {
    pub static mut stdout: *mut FILE;
}
unsafe extern "C" {
    pub static mut stderr: *mut FILE;
}
unsafe extern "C" {
    pub fn remove(__filename: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn rename(
        __old: *const ::std::os::raw::c_char,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn renameat(
        __oldfd: ::std::os::raw::c_int,
        __old: *const ::std::os::raw::c_char,
        __newfd: ::std::os::raw::c_int,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
unsafe extern "C" {
    pub fn tmpnam(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn tmpnam_r(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn tempnam(
        __dir: *const ::std::os::raw::c_char,
        __pfx: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fflush(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fflush_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn freopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
        __stream: *mut FILE,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fdopen(__fd: ::std::os::raw::c_int, __modes: *const ::std::os::raw::c_char)
        -> *mut FILE;
}
unsafe extern "C" {
    pub fn fopencookie(
        __magic_cookie: *mut ::std::os::raw::c_void,
        __modes: *const ::std::os::raw::c_char,
        __io_funcs: cookie_io_functions_t,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fmemopen(
        __s: *mut ::std::os::raw::c_void,
        __len: usize,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn open_memstream(
        __bufloc: *mut *mut ::std::os::raw::c_char,
        __sizeloc: *mut usize,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn setvbuf(
        __stream: *mut FILE,
        __buf: *mut ::std::os::raw::c_char,
        __modes: ::std::os::raw::c_int,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setbuffer(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char, __size: usize);
}
unsafe extern "C" {
    pub fn setlinebuf(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn fprintf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn printf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vfprintf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vprintf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn snprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsnprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vasprintf(
        __ptr: *mut *mut ::std::os::raw::c_char,
        __f: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __asprintf(
        __ptr: *mut *mut ::std::os::raw::c_char,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn asprintf(
        __ptr: *mut *mut ::std::os::raw::c_char,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vdprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn dprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fscanf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn scanf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
pub type __cfloat128 = __BindgenComplex<u128>;
pub type _Float128 = u128;
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = u128;
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_fscanf"]
    pub fn fscanf1(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_scanf"]
    pub fn scanf1(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_sscanf"]
    pub fn sscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vfscanf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vscanf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_vfscanf"]
    pub fn vfscanf1(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_vscanf"]
    pub fn vscanf1(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_vsscanf"]
    pub fn vsscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgetc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fputc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putchar(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fputc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE)
        -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putchar_unlocked(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getw(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putw(__w: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgets(
        __s: *mut ::std::os::raw::c_char,
        __n: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn __getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
unsafe extern "C" {
    pub fn getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
unsafe extern "C" {
    pub fn getline(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
unsafe extern "C" {
    pub fn fputs(__s: *const ::std::os::raw::c_char, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn puts(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ungetc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fread(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn fwrite(
        __ptr: *const ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __s: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn fread_unlocked(
        __ptr: *mut ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
unsafe extern "C" {
    pub fn fwrite_unlocked(
        __ptr: *const ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
unsafe extern "C" {
    pub fn fseek(
        __stream: *mut FILE,
        __off: ::std::os::raw::c_long,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ftell(__stream: *mut FILE) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn rewind(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn fseeko(
        __stream: *mut FILE,
        __off: __off_t,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ftello(__stream: *mut FILE) -> __off_t;
}
unsafe extern "C" {
    pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clearerr(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn feof(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ferror(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clearerr_unlocked(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn feof_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ferror_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn perror(__s: *const ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn fileno(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fileno_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn popen(
        __command: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn ctermid(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn flockfile(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn ftrylockfile(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn funlockfile(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn __uflow(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __overflow(arg1: *mut FILE, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
pub const cudaRoundMode_cudaRoundNearest: cudaRoundMode = 0;
pub const cudaRoundMode_cudaRoundZero: cudaRoundMode = 1;
pub const cudaRoundMode_cudaRoundPosInf: cudaRoundMode = 2;
pub const cudaRoundMode_cudaRoundMinInf: cudaRoundMode = 3;
#[doc = "                                                                              *\n                                                                              *\n                                                                              *"]
pub type cudaRoundMode = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct char1 {
    pub x: ::std::os::raw::c_schar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of char1"][::std::mem::size_of::<char1>() - 1usize];
    ["Alignment of char1"][::std::mem::align_of::<char1>() - 1usize];
    ["Offset of field: char1::x"][::std::mem::offset_of!(char1, x) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uchar1 {
    pub x: ::std::os::raw::c_uchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of uchar1"][::std::mem::size_of::<uchar1>() - 1usize];
    ["Alignment of uchar1"][::std::mem::align_of::<uchar1>() - 1usize];
    ["Offset of field: uchar1::x"][::std::mem::offset_of!(uchar1, x) - 0usize];
};
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Copy, Clone)]
pub struct char2 {
    pub x: ::std::os::raw::c_schar,
    pub y: ::std::os::raw::c_schar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of char2"][::std::mem::size_of::<char2>() - 2usize];
    ["Alignment of char2"][::std::mem::align_of::<char2>() - 2usize];
    ["Offset of field: char2::x"][::std::mem::offset_of!(char2, x) - 0usize];
    ["Offset of field: char2::y"][::std::mem::offset_of!(char2, y) - 1usize];
};
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Copy, Clone)]
pub struct uchar2 {
    pub x: ::std::os::raw::c_uchar,
    pub y: ::std::os::raw::c_uchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of uchar2"][::std::mem::size_of::<uchar2>() - 2usize];
    ["Alignment of uchar2"][::std::mem::align_of::<uchar2>() - 2usize];
    ["Offset of field: uchar2::x"][::std::mem::offset_of!(uchar2, x) - 0usize];
    ["Offset of field: uchar2::y"][::std::mem::offset_of!(uchar2, y) - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct char3 {
    pub x: ::std::os::raw::c_schar,
    pub y: ::std::os::raw::c_schar,
    pub z: ::std::os::raw::c_schar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of char3"][::std::mem::size_of::<char3>() - 3usize];
    ["Alignment of char3"][::std::mem::align_of::<char3>() - 1usize];
    ["Offset of field: char3::x"][::std::mem::offset_of!(char3, x) - 0usize];
    ["Offset of field: char3::y"][::std::mem::offset_of!(char3, y) - 1usize];
    ["Offset of field: char3::z"][::std::mem::offset_of!(char3, z) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uchar3 {
    pub x: ::std::os::raw::c_uchar,
    pub y: ::std::os::raw::c_uchar,
    pub z: ::std::os::raw::c_uchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of uchar3"][::std::mem::size_of::<uchar3>() - 3usize];
    ["Alignment of uchar3"][::std::mem::align_of::<uchar3>() - 1usize];
    ["Offset of field: uchar3::x"][::std::mem::offset_of!(uchar3, x) - 0usize];
    ["Offset of field: uchar3::y"][::std::mem::offset_of!(uchar3, y) - 1usize];
    ["Offset of field: uchar3::z"][::std::mem::offset_of!(uchar3, z) - 2usize];
};
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct char4 {
    pub x: ::std::os::raw::c_schar,
    pub y: ::std::os::raw::c_schar,
    pub z: ::std::os::raw::c_schar,
    pub w: ::std::os::raw::c_schar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of char4"][::std::mem::size_of::<char4>() - 4usize];
    ["Alignment of char4"][::std::mem::align_of::<char4>() - 4usize];
    ["Offset of field: char4::x"][::std::mem::offset_of!(char4, x) - 0usize];
    ["Offset of field: char4::y"][::std::mem::offset_of!(char4, y) - 1usize];
    ["Offset of field: char4::z"][::std::mem::offset_of!(char4, z) - 2usize];
    ["Offset of field: char4::w"][::std::mem::offset_of!(char4, w) - 3usize];
};
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct uchar4 {
    pub x: ::std::os::raw::c_uchar,
    pub y: ::std::os::raw::c_uchar,
    pub z: ::std::os::raw::c_uchar,
    pub w: ::std::os::raw::c_uchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of uchar4"][::std::mem::size_of::<uchar4>() - 4usize];
    ["Alignment of uchar4"][::std::mem::align_of::<uchar4>() - 4usize];
    ["Offset of field: uchar4::x"][::std::mem::offset_of!(uchar4, x) - 0usize];
    ["Offset of field: uchar4::y"][::std::mem::offset_of!(uchar4, y) - 1usize];
    ["Offset of field: uchar4::z"][::std::mem::offset_of!(uchar4, z) - 2usize];
    ["Offset of field: uchar4::w"][::std::mem::offset_of!(uchar4, w) - 3usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct short1 {
    pub x: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of short1"][::std::mem::size_of::<short1>() - 2usize];
    ["Alignment of short1"][::std::mem::align_of::<short1>() - 2usize];
    ["Offset of field: short1::x"][::std::mem::offset_of!(short1, x) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ushort1 {
    pub x: ::std::os::raw::c_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ushort1"][::std::mem::size_of::<ushort1>() - 2usize];
    ["Alignment of ushort1"][::std::mem::align_of::<ushort1>() - 2usize];
    ["Offset of field: ushort1::x"][::std::mem::offset_of!(ushort1, x) - 0usize];
};
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct short2 {
    pub x: ::std::os::raw::c_short,
    pub y: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of short2"][::std::mem::size_of::<short2>() - 4usize];
    ["Alignment of short2"][::std::mem::align_of::<short2>() - 4usize];
    ["Offset of field: short2::x"][::std::mem::offset_of!(short2, x) - 0usize];
    ["Offset of field: short2::y"][::std::mem::offset_of!(short2, y) - 2usize];
};
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct ushort2 {
    pub x: ::std::os::raw::c_ushort,
    pub y: ::std::os::raw::c_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ushort2"][::std::mem::size_of::<ushort2>() - 4usize];
    ["Alignment of ushort2"][::std::mem::align_of::<ushort2>() - 4usize];
    ["Offset of field: ushort2::x"][::std::mem::offset_of!(ushort2, x) - 0usize];
    ["Offset of field: ushort2::y"][::std::mem::offset_of!(ushort2, y) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct short3 {
    pub x: ::std::os::raw::c_short,
    pub y: ::std::os::raw::c_short,
    pub z: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of short3"][::std::mem::size_of::<short3>() - 6usize];
    ["Alignment of short3"][::std::mem::align_of::<short3>() - 2usize];
    ["Offset of field: short3::x"][::std::mem::offset_of!(short3, x) - 0usize];
    ["Offset of field: short3::y"][::std::mem::offset_of!(short3, y) - 2usize];
    ["Offset of field: short3::z"][::std::mem::offset_of!(short3, z) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ushort3 {
    pub x: ::std::os::raw::c_ushort,
    pub y: ::std::os::raw::c_ushort,
    pub z: ::std::os::raw::c_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ushort3"][::std::mem::size_of::<ushort3>() - 6usize];
    ["Alignment of ushort3"][::std::mem::align_of::<ushort3>() - 2usize];
    ["Offset of field: ushort3::x"][::std::mem::offset_of!(ushort3, x) - 0usize];
    ["Offset of field: ushort3::y"][::std::mem::offset_of!(ushort3, y) - 2usize];
    ["Offset of field: ushort3::z"][::std::mem::offset_of!(ushort3, z) - 4usize];
};
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct short4 {
    pub x: ::std::os::raw::c_short,
    pub y: ::std::os::raw::c_short,
    pub z: ::std::os::raw::c_short,
    pub w: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of short4"][::std::mem::size_of::<short4>() - 8usize];
    ["Alignment of short4"][::std::mem::align_of::<short4>() - 8usize];
    ["Offset of field: short4::x"][::std::mem::offset_of!(short4, x) - 0usize];
    ["Offset of field: short4::y"][::std::mem::offset_of!(short4, y) - 2usize];
    ["Offset of field: short4::z"][::std::mem::offset_of!(short4, z) - 4usize];
    ["Offset of field: short4::w"][::std::mem::offset_of!(short4, w) - 6usize];
};
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct ushort4 {
    pub x: ::std::os::raw::c_ushort,
    pub y: ::std::os::raw::c_ushort,
    pub z: ::std::os::raw::c_ushort,
    pub w: ::std::os::raw::c_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ushort4"][::std::mem::size_of::<ushort4>() - 8usize];
    ["Alignment of ushort4"][::std::mem::align_of::<ushort4>() - 8usize];
    ["Offset of field: ushort4::x"][::std::mem::offset_of!(ushort4, x) - 0usize];
    ["Offset of field: ushort4::y"][::std::mem::offset_of!(ushort4, y) - 2usize];
    ["Offset of field: ushort4::z"][::std::mem::offset_of!(ushort4, z) - 4usize];
    ["Offset of field: ushort4::w"][::std::mem::offset_of!(ushort4, w) - 6usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct int1 {
    pub x: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of int1"][::std::mem::size_of::<int1>() - 4usize];
    ["Alignment of int1"][::std::mem::align_of::<int1>() - 4usize];
    ["Offset of field: int1::x"][::std::mem::offset_of!(int1, x) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uint1 {
    pub x: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of uint1"][::std::mem::size_of::<uint1>() - 4usize];
    ["Alignment of uint1"][::std::mem::align_of::<uint1>() - 4usize];
    ["Offset of field: uint1::x"][::std::mem::offset_of!(uint1, x) - 0usize];
};
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct int2 {
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of int2"][::std::mem::size_of::<int2>() - 8usize];
    ["Alignment of int2"][::std::mem::align_of::<int2>() - 8usize];
    ["Offset of field: int2::x"][::std::mem::offset_of!(int2, x) - 0usize];
    ["Offset of field: int2::y"][::std::mem::offset_of!(int2, y) - 4usize];
};
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct uint2 {
    pub x: ::std::os::raw::c_uint,
    pub y: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of uint2"][::std::mem::size_of::<uint2>() - 8usize];
    ["Alignment of uint2"][::std::mem::align_of::<uint2>() - 8usize];
    ["Offset of field: uint2::x"][::std::mem::offset_of!(uint2, x) - 0usize];
    ["Offset of field: uint2::y"][::std::mem::offset_of!(uint2, y) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct int3 {
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
    pub z: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of int3"][::std::mem::size_of::<int3>() - 12usize];
    ["Alignment of int3"][::std::mem::align_of::<int3>() - 4usize];
    ["Offset of field: int3::x"][::std::mem::offset_of!(int3, x) - 0usize];
    ["Offset of field: int3::y"][::std::mem::offset_of!(int3, y) - 4usize];
    ["Offset of field: int3::z"][::std::mem::offset_of!(int3, z) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uint3 {
    pub x: ::std::os::raw::c_uint,
    pub y: ::std::os::raw::c_uint,
    pub z: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of uint3"][::std::mem::size_of::<uint3>() - 12usize];
    ["Alignment of uint3"][::std::mem::align_of::<uint3>() - 4usize];
    ["Offset of field: uint3::x"][::std::mem::offset_of!(uint3, x) - 0usize];
    ["Offset of field: uint3::y"][::std::mem::offset_of!(uint3, y) - 4usize];
    ["Offset of field: uint3::z"][::std::mem::offset_of!(uint3, z) - 8usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct int4 {
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
    pub z: ::std::os::raw::c_int,
    pub w: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of int4"][::std::mem::size_of::<int4>() - 16usize];
    ["Alignment of int4"][::std::mem::align_of::<int4>() - 16usize];
    ["Offset of field: int4::x"][::std::mem::offset_of!(int4, x) - 0usize];
    ["Offset of field: int4::y"][::std::mem::offset_of!(int4, y) - 4usize];
    ["Offset of field: int4::z"][::std::mem::offset_of!(int4, z) - 8usize];
    ["Offset of field: int4::w"][::std::mem::offset_of!(int4, w) - 12usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct uint4 {
    pub x: ::std::os::raw::c_uint,
    pub y: ::std::os::raw::c_uint,
    pub z: ::std::os::raw::c_uint,
    pub w: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of uint4"][::std::mem::size_of::<uint4>() - 16usize];
    ["Alignment of uint4"][::std::mem::align_of::<uint4>() - 16usize];
    ["Offset of field: uint4::x"][::std::mem::offset_of!(uint4, x) - 0usize];
    ["Offset of field: uint4::y"][::std::mem::offset_of!(uint4, y) - 4usize];
    ["Offset of field: uint4::z"][::std::mem::offset_of!(uint4, z) - 8usize];
    ["Offset of field: uint4::w"][::std::mem::offset_of!(uint4, w) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct long1 {
    pub x: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of long1"][::std::mem::size_of::<long1>() - 8usize];
    ["Alignment of long1"][::std::mem::align_of::<long1>() - 8usize];
    ["Offset of field: long1::x"][::std::mem::offset_of!(long1, x) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ulong1 {
    pub x: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ulong1"][::std::mem::size_of::<ulong1>() - 8usize];
    ["Alignment of ulong1"][::std::mem::align_of::<ulong1>() - 8usize];
    ["Offset of field: ulong1::x"][::std::mem::offset_of!(ulong1, x) - 0usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct long2 {
    pub x: ::std::os::raw::c_long,
    pub y: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of long2"][::std::mem::size_of::<long2>() - 16usize];
    ["Alignment of long2"][::std::mem::align_of::<long2>() - 16usize];
    ["Offset of field: long2::x"][::std::mem::offset_of!(long2, x) - 0usize];
    ["Offset of field: long2::y"][::std::mem::offset_of!(long2, y) - 8usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct ulong2 {
    pub x: ::std::os::raw::c_ulong,
    pub y: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ulong2"][::std::mem::size_of::<ulong2>() - 16usize];
    ["Alignment of ulong2"][::std::mem::align_of::<ulong2>() - 16usize];
    ["Offset of field: ulong2::x"][::std::mem::offset_of!(ulong2, x) - 0usize];
    ["Offset of field: ulong2::y"][::std::mem::offset_of!(ulong2, y) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct long3 {
    pub x: ::std::os::raw::c_long,
    pub y: ::std::os::raw::c_long,
    pub z: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of long3"][::std::mem::size_of::<long3>() - 24usize];
    ["Alignment of long3"][::std::mem::align_of::<long3>() - 8usize];
    ["Offset of field: long3::x"][::std::mem::offset_of!(long3, x) - 0usize];
    ["Offset of field: long3::y"][::std::mem::offset_of!(long3, y) - 8usize];
    ["Offset of field: long3::z"][::std::mem::offset_of!(long3, z) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ulong3 {
    pub x: ::std::os::raw::c_ulong,
    pub y: ::std::os::raw::c_ulong,
    pub z: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ulong3"][::std::mem::size_of::<ulong3>() - 24usize];
    ["Alignment of ulong3"][::std::mem::align_of::<ulong3>() - 8usize];
    ["Offset of field: ulong3::x"][::std::mem::offset_of!(ulong3, x) - 0usize];
    ["Offset of field: ulong3::y"][::std::mem::offset_of!(ulong3, y) - 8usize];
    ["Offset of field: ulong3::z"][::std::mem::offset_of!(ulong3, z) - 16usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct long4 {
    pub x: ::std::os::raw::c_long,
    pub y: ::std::os::raw::c_long,
    pub z: ::std::os::raw::c_long,
    pub w: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of long4"][::std::mem::size_of::<long4>() - 32usize];
    ["Alignment of long4"][::std::mem::align_of::<long4>() - 16usize];
    ["Offset of field: long4::x"][::std::mem::offset_of!(long4, x) - 0usize];
    ["Offset of field: long4::y"][::std::mem::offset_of!(long4, y) - 8usize];
    ["Offset of field: long4::z"][::std::mem::offset_of!(long4, z) - 16usize];
    ["Offset of field: long4::w"][::std::mem::offset_of!(long4, w) - 24usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct ulong4 {
    pub x: ::std::os::raw::c_ulong,
    pub y: ::std::os::raw::c_ulong,
    pub z: ::std::os::raw::c_ulong,
    pub w: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ulong4"][::std::mem::size_of::<ulong4>() - 32usize];
    ["Alignment of ulong4"][::std::mem::align_of::<ulong4>() - 16usize];
    ["Offset of field: ulong4::x"][::std::mem::offset_of!(ulong4, x) - 0usize];
    ["Offset of field: ulong4::y"][::std::mem::offset_of!(ulong4, y) - 8usize];
    ["Offset of field: ulong4::z"][::std::mem::offset_of!(ulong4, z) - 16usize];
    ["Offset of field: ulong4::w"][::std::mem::offset_of!(ulong4, w) - 24usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct long4_16a {
    pub x: ::std::os::raw::c_long,
    pub y: ::std::os::raw::c_long,
    pub z: ::std::os::raw::c_long,
    pub w: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of long4_16a"][::std::mem::size_of::<long4_16a>() - 32usize];
    ["Alignment of long4_16a"][::std::mem::align_of::<long4_16a>() - 16usize];
    ["Offset of field: long4_16a::x"][::std::mem::offset_of!(long4_16a, x) - 0usize];
    ["Offset of field: long4_16a::y"][::std::mem::offset_of!(long4_16a, y) - 8usize];
    ["Offset of field: long4_16a::z"][::std::mem::offset_of!(long4_16a, z) - 16usize];
    ["Offset of field: long4_16a::w"][::std::mem::offset_of!(long4_16a, w) - 24usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct ulong4_16a {
    pub x: ::std::os::raw::c_ulong,
    pub y: ::std::os::raw::c_ulong,
    pub z: ::std::os::raw::c_ulong,
    pub w: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ulong4_16a"][::std::mem::size_of::<ulong4_16a>() - 32usize];
    ["Alignment of ulong4_16a"][::std::mem::align_of::<ulong4_16a>() - 16usize];
    ["Offset of field: ulong4_16a::x"][::std::mem::offset_of!(ulong4_16a, x) - 0usize];
    ["Offset of field: ulong4_16a::y"][::std::mem::offset_of!(ulong4_16a, y) - 8usize];
    ["Offset of field: ulong4_16a::z"][::std::mem::offset_of!(ulong4_16a, z) - 16usize];
    ["Offset of field: ulong4_16a::w"][::std::mem::offset_of!(ulong4_16a, w) - 24usize];
};
#[repr(C)]
#[repr(align(32))]
#[derive(Debug, Copy, Clone)]
pub struct long4_32a {
    pub x: ::std::os::raw::c_long,
    pub y: ::std::os::raw::c_long,
    pub z: ::std::os::raw::c_long,
    pub w: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of long4_32a"][::std::mem::size_of::<long4_32a>() - 32usize];
    ["Alignment of long4_32a"][::std::mem::align_of::<long4_32a>() - 32usize];
    ["Offset of field: long4_32a::x"][::std::mem::offset_of!(long4_32a, x) - 0usize];
    ["Offset of field: long4_32a::y"][::std::mem::offset_of!(long4_32a, y) - 8usize];
    ["Offset of field: long4_32a::z"][::std::mem::offset_of!(long4_32a, z) - 16usize];
    ["Offset of field: long4_32a::w"][::std::mem::offset_of!(long4_32a, w) - 24usize];
};
#[repr(C)]
#[repr(align(32))]
#[derive(Debug, Copy, Clone)]
pub struct ulong4_32a {
    pub x: ::std::os::raw::c_ulong,
    pub y: ::std::os::raw::c_ulong,
    pub z: ::std::os::raw::c_ulong,
    pub w: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ulong4_32a"][::std::mem::size_of::<ulong4_32a>() - 32usize];
    ["Alignment of ulong4_32a"][::std::mem::align_of::<ulong4_32a>() - 32usize];
    ["Offset of field: ulong4_32a::x"][::std::mem::offset_of!(ulong4_32a, x) - 0usize];
    ["Offset of field: ulong4_32a::y"][::std::mem::offset_of!(ulong4_32a, y) - 8usize];
    ["Offset of field: ulong4_32a::z"][::std::mem::offset_of!(ulong4_32a, z) - 16usize];
    ["Offset of field: ulong4_32a::w"][::std::mem::offset_of!(ulong4_32a, w) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct float1 {
    pub x: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of float1"][::std::mem::size_of::<float1>() - 4usize];
    ["Alignment of float1"][::std::mem::align_of::<float1>() - 4usize];
    ["Offset of field: float1::x"][::std::mem::offset_of!(float1, x) - 0usize];
};
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct float2 {
    pub x: f32,
    pub y: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of float2"][::std::mem::size_of::<float2>() - 8usize];
    ["Alignment of float2"][::std::mem::align_of::<float2>() - 8usize];
    ["Offset of field: float2::x"][::std::mem::offset_of!(float2, x) - 0usize];
    ["Offset of field: float2::y"][::std::mem::offset_of!(float2, y) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct float3 {
    pub x: f32,
    pub y: f32,
    pub z: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of float3"][::std::mem::size_of::<float3>() - 12usize];
    ["Alignment of float3"][::std::mem::align_of::<float3>() - 4usize];
    ["Offset of field: float3::x"][::std::mem::offset_of!(float3, x) - 0usize];
    ["Offset of field: float3::y"][::std::mem::offset_of!(float3, y) - 4usize];
    ["Offset of field: float3::z"][::std::mem::offset_of!(float3, z) - 8usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct float4 {
    pub x: f32,
    pub y: f32,
    pub z: f32,
    pub w: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of float4"][::std::mem::size_of::<float4>() - 16usize];
    ["Alignment of float4"][::std::mem::align_of::<float4>() - 16usize];
    ["Offset of field: float4::x"][::std::mem::offset_of!(float4, x) - 0usize];
    ["Offset of field: float4::y"][::std::mem::offset_of!(float4, y) - 4usize];
    ["Offset of field: float4::z"][::std::mem::offset_of!(float4, z) - 8usize];
    ["Offset of field: float4::w"][::std::mem::offset_of!(float4, w) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct longlong1 {
    pub x: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of longlong1"][::std::mem::size_of::<longlong1>() - 8usize];
    ["Alignment of longlong1"][::std::mem::align_of::<longlong1>() - 8usize];
    ["Offset of field: longlong1::x"][::std::mem::offset_of!(longlong1, x) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ulonglong1 {
    pub x: ::std::os::raw::c_ulonglong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ulonglong1"][::std::mem::size_of::<ulonglong1>() - 8usize];
    ["Alignment of ulonglong1"][::std::mem::align_of::<ulonglong1>() - 8usize];
    ["Offset of field: ulonglong1::x"][::std::mem::offset_of!(ulonglong1, x) - 0usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct longlong2 {
    pub x: ::std::os::raw::c_longlong,
    pub y: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of longlong2"][::std::mem::size_of::<longlong2>() - 16usize];
    ["Alignment of longlong2"][::std::mem::align_of::<longlong2>() - 16usize];
    ["Offset of field: longlong2::x"][::std::mem::offset_of!(longlong2, x) - 0usize];
    ["Offset of field: longlong2::y"][::std::mem::offset_of!(longlong2, y) - 8usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct ulonglong2 {
    pub x: ::std::os::raw::c_ulonglong,
    pub y: ::std::os::raw::c_ulonglong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ulonglong2"][::std::mem::size_of::<ulonglong2>() - 16usize];
    ["Alignment of ulonglong2"][::std::mem::align_of::<ulonglong2>() - 16usize];
    ["Offset of field: ulonglong2::x"][::std::mem::offset_of!(ulonglong2, x) - 0usize];
    ["Offset of field: ulonglong2::y"][::std::mem::offset_of!(ulonglong2, y) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct longlong3 {
    pub x: ::std::os::raw::c_longlong,
    pub y: ::std::os::raw::c_longlong,
    pub z: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of longlong3"][::std::mem::size_of::<longlong3>() - 24usize];
    ["Alignment of longlong3"][::std::mem::align_of::<longlong3>() - 8usize];
    ["Offset of field: longlong3::x"][::std::mem::offset_of!(longlong3, x) - 0usize];
    ["Offset of field: longlong3::y"][::std::mem::offset_of!(longlong3, y) - 8usize];
    ["Offset of field: longlong3::z"][::std::mem::offset_of!(longlong3, z) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ulonglong3 {
    pub x: ::std::os::raw::c_ulonglong,
    pub y: ::std::os::raw::c_ulonglong,
    pub z: ::std::os::raw::c_ulonglong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ulonglong3"][::std::mem::size_of::<ulonglong3>() - 24usize];
    ["Alignment of ulonglong3"][::std::mem::align_of::<ulonglong3>() - 8usize];
    ["Offset of field: ulonglong3::x"][::std::mem::offset_of!(ulonglong3, x) - 0usize];
    ["Offset of field: ulonglong3::y"][::std::mem::offset_of!(ulonglong3, y) - 8usize];
    ["Offset of field: ulonglong3::z"][::std::mem::offset_of!(ulonglong3, z) - 16usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct longlong4 {
    pub x: ::std::os::raw::c_longlong,
    pub y: ::std::os::raw::c_longlong,
    pub z: ::std::os::raw::c_longlong,
    pub w: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of longlong4"][::std::mem::size_of::<longlong4>() - 32usize];
    ["Alignment of longlong4"][::std::mem::align_of::<longlong4>() - 16usize];
    ["Offset of field: longlong4::x"][::std::mem::offset_of!(longlong4, x) - 0usize];
    ["Offset of field: longlong4::y"][::std::mem::offset_of!(longlong4, y) - 8usize];
    ["Offset of field: longlong4::z"][::std::mem::offset_of!(longlong4, z) - 16usize];
    ["Offset of field: longlong4::w"][::std::mem::offset_of!(longlong4, w) - 24usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct longlong4_16a {
    pub x: ::std::os::raw::c_longlong,
    pub y: ::std::os::raw::c_longlong,
    pub z: ::std::os::raw::c_longlong,
    pub w: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of longlong4_16a"][::std::mem::size_of::<longlong4_16a>() - 32usize];
    ["Alignment of longlong4_16a"][::std::mem::align_of::<longlong4_16a>() - 16usize];
    ["Offset of field: longlong4_16a::x"][::std::mem::offset_of!(longlong4_16a, x) - 0usize];
    ["Offset of field: longlong4_16a::y"][::std::mem::offset_of!(longlong4_16a, y) - 8usize];
    ["Offset of field: longlong4_16a::z"][::std::mem::offset_of!(longlong4_16a, z) - 16usize];
    ["Offset of field: longlong4_16a::w"][::std::mem::offset_of!(longlong4_16a, w) - 24usize];
};
#[repr(C)]
#[repr(align(32))]
#[derive(Debug, Copy, Clone)]
pub struct longlong4_32a {
    pub x: ::std::os::raw::c_longlong,
    pub y: ::std::os::raw::c_longlong,
    pub z: ::std::os::raw::c_longlong,
    pub w: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of longlong4_32a"][::std::mem::size_of::<longlong4_32a>() - 32usize];
    ["Alignment of longlong4_32a"][::std::mem::align_of::<longlong4_32a>() - 32usize];
    ["Offset of field: longlong4_32a::x"][::std::mem::offset_of!(longlong4_32a, x) - 0usize];
    ["Offset of field: longlong4_32a::y"][::std::mem::offset_of!(longlong4_32a, y) - 8usize];
    ["Offset of field: longlong4_32a::z"][::std::mem::offset_of!(longlong4_32a, z) - 16usize];
    ["Offset of field: longlong4_32a::w"][::std::mem::offset_of!(longlong4_32a, w) - 24usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct ulonglong4 {
    pub x: ::std::os::raw::c_ulonglong,
    pub y: ::std::os::raw::c_ulonglong,
    pub z: ::std::os::raw::c_ulonglong,
    pub w: ::std::os::raw::c_ulonglong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ulonglong4"][::std::mem::size_of::<ulonglong4>() - 32usize];
    ["Alignment of ulonglong4"][::std::mem::align_of::<ulonglong4>() - 16usize];
    ["Offset of field: ulonglong4::x"][::std::mem::offset_of!(ulonglong4, x) - 0usize];
    ["Offset of field: ulonglong4::y"][::std::mem::offset_of!(ulonglong4, y) - 8usize];
    ["Offset of field: ulonglong4::z"][::std::mem::offset_of!(ulonglong4, z) - 16usize];
    ["Offset of field: ulonglong4::w"][::std::mem::offset_of!(ulonglong4, w) - 24usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct ulonglong4_16a {
    pub x: ::std::os::raw::c_ulonglong,
    pub y: ::std::os::raw::c_ulonglong,
    pub z: ::std::os::raw::c_ulonglong,
    pub w: ::std::os::raw::c_ulonglong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ulonglong4_16a"][::std::mem::size_of::<ulonglong4_16a>() - 32usize];
    ["Alignment of ulonglong4_16a"][::std::mem::align_of::<ulonglong4_16a>() - 16usize];
    ["Offset of field: ulonglong4_16a::x"][::std::mem::offset_of!(ulonglong4_16a, x) - 0usize];
    ["Offset of field: ulonglong4_16a::y"][::std::mem::offset_of!(ulonglong4_16a, y) - 8usize];
    ["Offset of field: ulonglong4_16a::z"][::std::mem::offset_of!(ulonglong4_16a, z) - 16usize];
    ["Offset of field: ulonglong4_16a::w"][::std::mem::offset_of!(ulonglong4_16a, w) - 24usize];
};
#[repr(C)]
#[repr(align(32))]
#[derive(Debug, Copy, Clone)]
pub struct ulonglong4_32a {
    pub x: ::std::os::raw::c_ulonglong,
    pub y: ::std::os::raw::c_ulonglong,
    pub z: ::std::os::raw::c_ulonglong,
    pub w: ::std::os::raw::c_ulonglong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ulonglong4_32a"][::std::mem::size_of::<ulonglong4_32a>() - 32usize];
    ["Alignment of ulonglong4_32a"][::std::mem::align_of::<ulonglong4_32a>() - 32usize];
    ["Offset of field: ulonglong4_32a::x"][::std::mem::offset_of!(ulonglong4_32a, x) - 0usize];
    ["Offset of field: ulonglong4_32a::y"][::std::mem::offset_of!(ulonglong4_32a, y) - 8usize];
    ["Offset of field: ulonglong4_32a::z"][::std::mem::offset_of!(ulonglong4_32a, z) - 16usize];
    ["Offset of field: ulonglong4_32a::w"][::std::mem::offset_of!(ulonglong4_32a, w) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct double1 {
    pub x: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of double1"][::std::mem::size_of::<double1>() - 8usize];
    ["Alignment of double1"][::std::mem::align_of::<double1>() - 8usize];
    ["Offset of field: double1::x"][::std::mem::offset_of!(double1, x) - 0usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct double2 {
    pub x: f64,
    pub y: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of double2"][::std::mem::size_of::<double2>() - 16usize];
    ["Alignment of double2"][::std::mem::align_of::<double2>() - 16usize];
    ["Offset of field: double2::x"][::std::mem::offset_of!(double2, x) - 0usize];
    ["Offset of field: double2::y"][::std::mem::offset_of!(double2, y) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct double3 {
    pub x: f64,
    pub y: f64,
    pub z: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of double3"][::std::mem::size_of::<double3>() - 24usize];
    ["Alignment of double3"][::std::mem::align_of::<double3>() - 8usize];
    ["Offset of field: double3::x"][::std::mem::offset_of!(double3, x) - 0usize];
    ["Offset of field: double3::y"][::std::mem::offset_of!(double3, y) - 8usize];
    ["Offset of field: double3::z"][::std::mem::offset_of!(double3, z) - 16usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct double4 {
    pub x: f64,
    pub y: f64,
    pub z: f64,
    pub w: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of double4"][::std::mem::size_of::<double4>() - 32usize];
    ["Alignment of double4"][::std::mem::align_of::<double4>() - 16usize];
    ["Offset of field: double4::x"][::std::mem::offset_of!(double4, x) - 0usize];
    ["Offset of field: double4::y"][::std::mem::offset_of!(double4, y) - 8usize];
    ["Offset of field: double4::z"][::std::mem::offset_of!(double4, z) - 16usize];
    ["Offset of field: double4::w"][::std::mem::offset_of!(double4, w) - 24usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct double4_16a {
    pub x: f64,
    pub y: f64,
    pub z: f64,
    pub w: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of double4_16a"][::std::mem::size_of::<double4_16a>() - 32usize];
    ["Alignment of double4_16a"][::std::mem::align_of::<double4_16a>() - 16usize];
    ["Offset of field: double4_16a::x"][::std::mem::offset_of!(double4_16a, x) - 0usize];
    ["Offset of field: double4_16a::y"][::std::mem::offset_of!(double4_16a, y) - 8usize];
    ["Offset of field: double4_16a::z"][::std::mem::offset_of!(double4_16a, z) - 16usize];
    ["Offset of field: double4_16a::w"][::std::mem::offset_of!(double4_16a, w) - 24usize];
};
#[repr(C)]
#[repr(align(32))]
#[derive(Debug, Copy, Clone)]
pub struct double4_32a {
    pub x: f64,
    pub y: f64,
    pub z: f64,
    pub w: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of double4_32a"][::std::mem::size_of::<double4_32a>() - 32usize];
    ["Alignment of double4_32a"][::std::mem::align_of::<double4_32a>() - 32usize];
    ["Offset of field: double4_32a::x"][::std::mem::offset_of!(double4_32a, x) - 0usize];
    ["Offset of field: double4_32a::y"][::std::mem::offset_of!(double4_32a, y) - 8usize];
    ["Offset of field: double4_32a::z"][::std::mem::offset_of!(double4_32a, z) - 16usize];
    ["Offset of field: double4_32a::w"][::std::mem::offset_of!(double4_32a, w) - 24usize];
};
#[doc = "                                                                              *\n                                                                              *\n                                                                              *"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dim3 {
    pub x: ::std::os::raw::c_uint,
    pub y: ::std::os::raw::c_uint,
    pub z: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dim3"][::std::mem::size_of::<dim3>() - 12usize];
    ["Alignment of dim3"][::std::mem::align_of::<dim3>() - 4usize];
    ["Offset of field: dim3::x"][::std::mem::offset_of!(dim3, x) - 0usize];
    ["Offset of field: dim3::y"][::std::mem::offset_of!(dim3, y) - 4usize];
    ["Offset of field: dim3::z"][::std::mem::offset_of!(dim3, z) - 8usize];
};
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of max_align_t"][::std::mem::size_of::<max_align_t>() - 32usize];
    ["Alignment of max_align_t"][::std::mem::align_of::<max_align_t>() - 16usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce1"]
        [::std::mem::offset_of!(max_align_t, __clang_max_align_nonce1) - 0usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce2"]
        [::std::mem::offset_of!(max_align_t, __clang_max_align_nonce2) - 16usize];
};
#[doc = " The API call returned with no errors. In the case of query calls, this\n also means that the operation being queried is complete (see\n ::cudaEventQuery() and ::cudaStreamQuery())."]
pub const cudaError_cudaSuccess: cudaError = 0;
#[doc = " This indicates that one or more of the parameters passed to the API call\n is not within an acceptable range of values."]
pub const cudaError_cudaErrorInvalidValue: cudaError = 1;
#[doc = " The API call failed because it was unable to allocate enough memory or\n other resources to perform the requested operation."]
pub const cudaError_cudaErrorMemoryAllocation: cudaError = 2;
#[doc = " The API call failed because the CUDA driver and runtime could not be\n initialized."]
pub const cudaError_cudaErrorInitializationError: cudaError = 3;
#[doc = " This indicates that a CUDA Runtime API call cannot be executed because\n it is being called during process shut down, at a point in time after\n CUDA driver has been unloaded."]
pub const cudaError_cudaErrorCudartUnloading: cudaError = 4;
#[doc = " This indicates profiler is not initialized for this run. This can\n happen when the application is running with external profiling tools\n like visual profiler."]
pub const cudaError_cudaErrorProfilerDisabled: cudaError = 5;
#[doc = " \\deprecated\n This error return is deprecated as of CUDA 5.0. It is no longer an error\n to attempt to enable/disable the profiling via ::cudaProfilerStart or\n ::cudaProfilerStop without initialization."]
pub const cudaError_cudaErrorProfilerNotInitialized: cudaError = 6;
#[doc = " \\deprecated\n This error return is deprecated as of CUDA 5.0. It is no longer an error\n to call cudaProfilerStart() when profiling is already enabled."]
pub const cudaError_cudaErrorProfilerAlreadyStarted: cudaError = 7;
#[doc = " \\deprecated\n This error return is deprecated as of CUDA 5.0. It is no longer an error\n to call cudaProfilerStop() when profiling is already disabled."]
pub const cudaError_cudaErrorProfilerAlreadyStopped: cudaError = 8;
#[doc = " This indicates that a kernel launch is requesting resources that can\n never be satisfied by the current device. Requesting more shared memory\n per block than the device supports will trigger this error, as will\n requesting too many threads or blocks. See ::cudaDeviceProp for more\n device limitations."]
pub const cudaError_cudaErrorInvalidConfiguration: cudaError = 9;
#[doc = " This indicates that one or more of the pitch-related parameters passed\n to the API call is not within the acceptable range for pitch."]
pub const cudaError_cudaErrorInvalidPitchValue: cudaError = 12;
#[doc = " This indicates that the symbol name/identifier passed to the API call\n is not a valid name or identifier."]
pub const cudaError_cudaErrorInvalidSymbol: cudaError = 13;
#[doc = " This indicates that at least one host pointer passed to the API call is\n not a valid host pointer.\n \\deprecated\n This error return is deprecated as of CUDA 10.1."]
pub const cudaError_cudaErrorInvalidHostPointer: cudaError = 16;
#[doc = " This indicates that at least one device pointer passed to the API call is\n not a valid device pointer.\n \\deprecated\n This error return is deprecated as of CUDA 10.1."]
pub const cudaError_cudaErrorInvalidDevicePointer: cudaError = 17;
#[doc = " This indicates that the texture passed to the API call is not a valid\n texture."]
pub const cudaError_cudaErrorInvalidTexture: cudaError = 18;
#[doc = " This indicates that the texture binding is not valid. This occurs if you\n call ::cudaGetTextureAlignmentOffset() with an unbound texture."]
pub const cudaError_cudaErrorInvalidTextureBinding: cudaError = 19;
#[doc = " This indicates that the channel descriptor passed to the API call is not\n valid. This occurs if the format is not one of the formats specified by\n ::cudaChannelFormatKind, or if one of the dimensions is invalid."]
pub const cudaError_cudaErrorInvalidChannelDescriptor: cudaError = 20;
#[doc = " This indicates that the direction of the memcpy passed to the API call is\n not one of the types specified by ::cudaMemcpyKind."]
pub const cudaError_cudaErrorInvalidMemcpyDirection: cudaError = 21;
#[doc = " This indicated that the user has taken the address of a constant variable,\n which was forbidden up until the CUDA 3.1 release.\n \\deprecated\n This error return is deprecated as of CUDA 3.1. Variables in constant\n memory may now have their address taken by the runtime via\n ::cudaGetSymbolAddress()."]
pub const cudaError_cudaErrorAddressOfConstant: cudaError = 22;
#[doc = " This indicated that a texture fetch was not able to be performed.\n This was previously used for device emulation of texture operations.\n \\deprecated\n This error return is deprecated as of CUDA 3.1. Device emulation mode was\n removed with the CUDA 3.1 release."]
pub const cudaError_cudaErrorTextureFetchFailed: cudaError = 23;
#[doc = " This indicated that a texture was not bound for access.\n This was previously used for device emulation of texture operations.\n \\deprecated\n This error return is deprecated as of CUDA 3.1. Device emulation mode was\n removed with the CUDA 3.1 release."]
pub const cudaError_cudaErrorTextureNotBound: cudaError = 24;
#[doc = " This indicated that a synchronization operation had failed.\n This was previously used for some device emulation functions.\n \\deprecated\n This error return is deprecated as of CUDA 3.1. Device emulation mode was\n removed with the CUDA 3.1 release."]
pub const cudaError_cudaErrorSynchronizationError: cudaError = 25;
#[doc = " This indicates that a non-float texture was being accessed with linear\n filtering. This is not supported by CUDA."]
pub const cudaError_cudaErrorInvalidFilterSetting: cudaError = 26;
#[doc = " This indicates that an attempt was made to read an unsupported data type as a\n normalized float. This is not supported by CUDA."]
pub const cudaError_cudaErrorInvalidNormSetting: cudaError = 27;
#[doc = " Mixing of device and device emulation code was not allowed.\n \\deprecated\n This error return is deprecated as of CUDA 3.1. Device emulation mode was\n removed with the CUDA 3.1 release."]
pub const cudaError_cudaErrorMixedDeviceExecution: cudaError = 28;
#[doc = " This indicates that the API call is not yet implemented. Production\n releases of CUDA will never return this error.\n \\deprecated\n This error return is deprecated as of CUDA 4.1."]
pub const cudaError_cudaErrorNotYetImplemented: cudaError = 31;
#[doc = " This indicated that an emulated device pointer exceeded the 32-bit address\n range.\n \\deprecated\n This error return is deprecated as of CUDA 3.1. Device emulation mode was\n removed with the CUDA 3.1 release."]
pub const cudaError_cudaErrorMemoryValueTooLarge: cudaError = 32;
#[doc = " This indicates that the CUDA driver that the application has loaded is a\n stub library. Applications that run with the stub rather than a real\n driver loaded will result in CUDA API returning this error."]
pub const cudaError_cudaErrorStubLibrary: cudaError = 34;
#[doc = " This indicates that the installed NVIDIA CUDA driver is older than the\n CUDA runtime library. This is not a supported configuration. Users should\n install an updated NVIDIA display driver to allow the application to run."]
pub const cudaError_cudaErrorInsufficientDriver: cudaError = 35;
#[doc = " This indicates that the API call requires a newer CUDA driver than the one\n currently installed. Users should install an updated NVIDIA CUDA driver\n to allow the API call to succeed."]
pub const cudaError_cudaErrorCallRequiresNewerDriver: cudaError = 36;
#[doc = " This indicates that the surface passed to the API call is not a valid\n surface."]
pub const cudaError_cudaErrorInvalidSurface: cudaError = 37;
#[doc = " This indicates that multiple global or constant variables (across separate\n CUDA source files in the application) share the same string name."]
pub const cudaError_cudaErrorDuplicateVariableName: cudaError = 43;
#[doc = " This indicates that multiple textures (across separate CUDA source\n files in the application) share the same string name."]
pub const cudaError_cudaErrorDuplicateTextureName: cudaError = 44;
#[doc = " This indicates that multiple surfaces (across separate CUDA source\n files in the application) share the same string name."]
pub const cudaError_cudaErrorDuplicateSurfaceName: cudaError = 45;
#[doc = " This indicates that all CUDA devices are busy or unavailable at the current\n time. Devices are often busy/unavailable due to use of\n ::cudaComputeModeProhibited, ::cudaComputeModeExclusiveProcess, or when long\n running CUDA kernels have filled up the GPU and are blocking new work\n from starting. They can also be unavailable due to memory constraints\n on a device that already has active CUDA work being performed."]
pub const cudaError_cudaErrorDevicesUnavailable: cudaError = 46;
#[doc = " This indicates that the current context is not compatible with this\n the CUDA Runtime. This can only occur if you are using CUDA\n Runtime/Driver interoperability and have created an existing Driver\n context using the driver API. The Driver context may be incompatible\n either because the Driver context was created using an older version\n of the API, because the Runtime API call expects a primary driver\n context and the Driver context is not primary, or because the Driver\n context has been destroyed. Please see \\ref CUDART_DRIVER \"Interactions\n with the CUDA Driver API\" for more information."]
pub const cudaError_cudaErrorIncompatibleDriverContext: cudaError = 49;
#[doc = " The device function being invoked (usually via ::cudaLaunchKernel()) was not\n previously configured via the ::cudaConfigureCall() function."]
pub const cudaError_cudaErrorMissingConfiguration: cudaError = 52;
#[doc = " This indicated that a previous kernel launch failed. This was previously\n used for device emulation of kernel launches.\n \\deprecated\n This error return is deprecated as of CUDA 3.1. Device emulation mode was\n removed with the CUDA 3.1 release."]
pub const cudaError_cudaErrorPriorLaunchFailure: cudaError = 53;
#[doc = " This error indicates that a device runtime grid launch did not occur\n because the depth of the child grid would exceed the maximum supported\n number of nested grid launches."]
pub const cudaError_cudaErrorLaunchMaxDepthExceeded: cudaError = 65;
#[doc = " This error indicates that a grid launch did not occur because the kernel\n uses file-scoped textures which are unsupported by the device runtime.\n Kernels launched via the device runtime only support textures created with\n the Texture Object API's."]
pub const cudaError_cudaErrorLaunchFileScopedTex: cudaError = 66;
#[doc = " This error indicates that a grid launch did not occur because the kernel\n uses file-scoped surfaces which are unsupported by the device runtime.\n Kernels launched via the device runtime only support surfaces created with\n the Surface Object API's."]
pub const cudaError_cudaErrorLaunchFileScopedSurf: cudaError = 67;
#[doc = " This error indicates that a call to ::cudaDeviceSynchronize made from\n the device runtime failed because the call was made at grid depth greater\n than than either the default (2 levels of grids) or user specified device\n limit ::cudaLimitDevRuntimeSyncDepth. To be able to synchronize on\n launched grids at a greater depth successfully, the maximum nested\n depth at which ::cudaDeviceSynchronize will be called must be specified\n with the ::cudaLimitDevRuntimeSyncDepth limit to the ::cudaDeviceSetLimit\n api before the host-side launch of a kernel using the device runtime.\n Keep in mind that additional levels of sync depth require the runtime\n to reserve large amounts of device memory that cannot be used for\n user allocations. Note that ::cudaDeviceSynchronize made from device\n runtime is only supported on devices of compute capability < 9.0."]
pub const cudaError_cudaErrorSyncDepthExceeded: cudaError = 68;
#[doc = " This error indicates that a device runtime grid launch failed because\n the launch would exceed the limit ::cudaLimitDevRuntimePendingLaunchCount.\n For this launch to proceed successfully, ::cudaDeviceSetLimit must be\n called to set the ::cudaLimitDevRuntimePendingLaunchCount to be higher\n than the upper bound of outstanding launches that can be issued to the\n device runtime. Keep in mind that raising the limit of pending device\n runtime launches will require the runtime to reserve device memory that\n cannot be used for user allocations."]
pub const cudaError_cudaErrorLaunchPendingCountExceeded: cudaError = 69;
#[doc = " The requested device function does not exist or is not compiled for the\n proper device architecture."]
pub const cudaError_cudaErrorInvalidDeviceFunction: cudaError = 98;
#[doc = " This indicates that no CUDA-capable devices were detected by the installed\n CUDA driver."]
pub const cudaError_cudaErrorNoDevice: cudaError = 100;
#[doc = " This indicates that the device ordinal supplied by the user does not\n correspond to a valid CUDA device or that the action requested is\n invalid for the specified device."]
pub const cudaError_cudaErrorInvalidDevice: cudaError = 101;
#[doc = " This indicates that the device doesn't have a valid Grid License."]
pub const cudaError_cudaErrorDeviceNotLicensed: cudaError = 102;
#[doc = " By default, the CUDA runtime may perform a minimal set of self-tests,\n as well as CUDA driver tests, to establish the validity of both.\n Introduced in CUDA 11.2, this error return indicates that at least one\n of these tests has failed and the validity of either the runtime\n or the driver could not be established."]
pub const cudaError_cudaErrorSoftwareValidityNotEstablished: cudaError = 103;
#[doc = " This indicates an internal startup failure in the CUDA runtime."]
pub const cudaError_cudaErrorStartupFailure: cudaError = 127;
#[doc = " This indicates that the device kernel image is invalid."]
pub const cudaError_cudaErrorInvalidKernelImage: cudaError = 200;
#[doc = " This most frequently indicates that there is no context bound to the\n current thread. This can also be returned if the context passed to an\n API call is not a valid handle (such as a context that has had\n ::cuCtxDestroy() invoked on it). This can also be returned if a user\n mixes different API versions (i.e. 3010 context with 3020 API calls).\n See ::cuCtxGetApiVersion() for more details."]
pub const cudaError_cudaErrorDeviceUninitialized: cudaError = 201;
#[doc = " This indicates that the buffer object could not be mapped."]
pub const cudaError_cudaErrorMapBufferObjectFailed: cudaError = 205;
#[doc = " This indicates that the buffer object could not be unmapped."]
pub const cudaError_cudaErrorUnmapBufferObjectFailed: cudaError = 206;
#[doc = " This indicates that the specified array is currently mapped and thus\n cannot be destroyed."]
pub const cudaError_cudaErrorArrayIsMapped: cudaError = 207;
#[doc = " This indicates that the resource is already mapped."]
pub const cudaError_cudaErrorAlreadyMapped: cudaError = 208;
#[doc = " This indicates that there is no kernel image available that is suitable\n for the device. This can occur when a user specifies code generation\n options for a particular CUDA source file that do not include the\n corresponding device configuration."]
pub const cudaError_cudaErrorNoKernelImageForDevice: cudaError = 209;
#[doc = " This indicates that a resource has already been acquired."]
pub const cudaError_cudaErrorAlreadyAcquired: cudaError = 210;
#[doc = " This indicates that a resource is not mapped."]
pub const cudaError_cudaErrorNotMapped: cudaError = 211;
#[doc = " This indicates that a mapped resource is not available for access as an\n array."]
pub const cudaError_cudaErrorNotMappedAsArray: cudaError = 212;
#[doc = " This indicates that a mapped resource is not available for access as a\n pointer."]
pub const cudaError_cudaErrorNotMappedAsPointer: cudaError = 213;
#[doc = " This indicates that an uncorrectable ECC error was detected during\n execution."]
pub const cudaError_cudaErrorECCUncorrectable: cudaError = 214;
#[doc = " This indicates that the ::cudaLimit passed to the API call is not\n supported by the active device."]
pub const cudaError_cudaErrorUnsupportedLimit: cudaError = 215;
#[doc = " This indicates that a call tried to access an exclusive-thread device that\n is already in use by a different thread."]
pub const cudaError_cudaErrorDeviceAlreadyInUse: cudaError = 216;
#[doc = " This error indicates that P2P access is not supported across the given\n devices."]
pub const cudaError_cudaErrorPeerAccessUnsupported: cudaError = 217;
#[doc = " A PTX compilation failed. The runtime may fall back to compiling PTX if\n an application does not contain a suitable binary for the current device."]
pub const cudaError_cudaErrorInvalidPtx: cudaError = 218;
#[doc = " This indicates an error with the OpenGL or DirectX context."]
pub const cudaError_cudaErrorInvalidGraphicsContext: cudaError = 219;
#[doc = " This indicates that an uncorrectable NVLink error was detected during the\n execution."]
pub const cudaError_cudaErrorNvlinkUncorrectable: cudaError = 220;
#[doc = " This indicates that the PTX JIT compiler library was not found. The JIT Compiler\n library is used for PTX compilation. The runtime may fall back to compiling PTX\n if an application does not contain a suitable binary for the current device."]
pub const cudaError_cudaErrorJitCompilerNotFound: cudaError = 221;
#[doc = " This indicates that the provided PTX was compiled with an unsupported toolchain.\n The most common reason for this, is the PTX was generated by a compiler newer\n than what is supported by the CUDA driver and PTX JIT compiler."]
pub const cudaError_cudaErrorUnsupportedPtxVersion: cudaError = 222;
#[doc = " This indicates that the JIT compilation was disabled. The JIT compilation compiles\n PTX. The runtime may fall back to compiling PTX if an application does not contain\n a suitable binary for the current device."]
pub const cudaError_cudaErrorJitCompilationDisabled: cudaError = 223;
#[doc = " This indicates that the provided execution affinity is not supported by the device."]
pub const cudaError_cudaErrorUnsupportedExecAffinity: cudaError = 224;
#[doc = " This indicates that the code to be compiled by the PTX JIT contains\n unsupported call to cudaDeviceSynchronize."]
pub const cudaError_cudaErrorUnsupportedDevSideSync: cudaError = 225;
#[doc = " This indicates that an exception occurred on the device that is now\n contained by the GPU's error containment capability. Common causes are -\n a. Certain types of invalid accesses of peer GPU memory over nvlink\n b. Certain classes of hardware errors\n This leaves the process in an inconsistent state and any further CUDA\n work will return the same error. To continue using CUDA, the process must\n be terminated and relaunched."]
pub const cudaError_cudaErrorContained: cudaError = 226;
#[doc = " This indicates that the device kernel source is invalid."]
pub const cudaError_cudaErrorInvalidSource: cudaError = 300;
#[doc = " This indicates that the file specified was not found."]
pub const cudaError_cudaErrorFileNotFound: cudaError = 301;
#[doc = " This indicates that a link to a shared object failed to resolve."]
pub const cudaError_cudaErrorSharedObjectSymbolNotFound: cudaError = 302;
#[doc = " This indicates that initialization of a shared object failed."]
pub const cudaError_cudaErrorSharedObjectInitFailed: cudaError = 303;
#[doc = " This error indicates that an OS call failed."]
pub const cudaError_cudaErrorOperatingSystem: cudaError = 304;
#[doc = " This indicates that a resource handle passed to the API call was not\n valid. Resource handles are opaque types like ::cudaStream_t and\n ::cudaEvent_t."]
pub const cudaError_cudaErrorInvalidResourceHandle: cudaError = 400;
#[doc = " This indicates that a resource required by the API call is not in a\n valid state to perform the requested operation."]
pub const cudaError_cudaErrorIllegalState: cudaError = 401;
#[doc = " This indicates an attempt was made to introspect an object in a way that\n would discard semantically important information. This is either due to\n the object using funtionality newer than the API version used to\n introspect it or omission of optional return arguments."]
pub const cudaError_cudaErrorLossyQuery: cudaError = 402;
#[doc = " This indicates that a named symbol was not found. Examples of symbols\n are global/constant variable names, driver function names, texture names,\n and surface names."]
pub const cudaError_cudaErrorSymbolNotFound: cudaError = 500;
#[doc = " This indicates that asynchronous operations issued previously have not\n completed yet. This result is not actually an error, but must be indicated\n differently than ::cudaSuccess (which indicates completion). Calls that\n may return this value include ::cudaEventQuery() and ::cudaStreamQuery()."]
pub const cudaError_cudaErrorNotReady: cudaError = 600;
#[doc = " The device encountered a load or store instruction on an invalid memory address.\n This leaves the process in an inconsistent state and any further CUDA work\n will return the same error. To continue using CUDA, the process must be terminated\n and relaunched."]
pub const cudaError_cudaErrorIllegalAddress: cudaError = 700;
#[doc = " This indicates that a launch did not occur because it did not have\n appropriate resources. Although this error is similar to\n ::cudaErrorInvalidConfiguration, this error usually indicates that the\n user has attempted to pass too many arguments to the device kernel, or the\n kernel launch specifies too many threads for the kernel's register count."]
pub const cudaError_cudaErrorLaunchOutOfResources: cudaError = 701;
#[doc = " This indicates that the device kernel took too long to execute. This can\n only occur if timeouts are enabled - see the device attribute\n \\ref ::cudaDeviceAttr::cudaDevAttrKernelExecTimeout \"cudaDevAttrKernelExecTimeout\"\n for more information.\n This leaves the process in an inconsistent state and any further CUDA work\n will return the same error. To continue using CUDA, the process must be terminated\n and relaunched."]
pub const cudaError_cudaErrorLaunchTimeout: cudaError = 702;
#[doc = " This error indicates a kernel launch that uses an incompatible texturing\n mode."]
pub const cudaError_cudaErrorLaunchIncompatibleTexturing: cudaError = 703;
#[doc = " This error indicates that a call to ::cudaDeviceEnablePeerAccess() is\n trying to re-enable peer addressing on from a context which has already\n had peer addressing enabled."]
pub const cudaError_cudaErrorPeerAccessAlreadyEnabled: cudaError = 704;
#[doc = " This error indicates that ::cudaDeviceDisablePeerAccess() is trying to\n disable peer addressing which has not been enabled yet via\n ::cudaDeviceEnablePeerAccess()."]
pub const cudaError_cudaErrorPeerAccessNotEnabled: cudaError = 705;
#[doc = " This indicates that the user has called ::cudaSetValidDevices(),\n ::cudaSetDeviceFlags(), ::cudaD3D9SetDirect3DDevice(),\n ::cudaD3D10SetDirect3DDevice, ::cudaD3D11SetDirect3DDevice(), or\n ::cudaVDPAUSetVDPAUDevice() after initializing the CUDA runtime by\n calling non-device management operations (allocating memory and\n launching kernels are examples of non-device management operations).\n This error can also be returned if using runtime/driver\n interoperability and there is an existing ::CUcontext active on the\n host thread."]
pub const cudaError_cudaErrorSetOnActiveProcess: cudaError = 708;
#[doc = " This error indicates that the context current to the calling thread\n has been destroyed using ::cuCtxDestroy, or is a primary context which\n has not yet been initialized."]
pub const cudaError_cudaErrorContextIsDestroyed: cudaError = 709;
#[doc = " An assert triggered in device code during kernel execution. The device\n cannot be used again. All existing allocations are invalid. To continue\n using CUDA, the process must be terminated and relaunched."]
pub const cudaError_cudaErrorAssert: cudaError = 710;
#[doc = " This error indicates that the hardware resources required to enable\n peer access have been exhausted for one or more of the devices\n passed to ::cudaEnablePeerAccess()."]
pub const cudaError_cudaErrorTooManyPeers: cudaError = 711;
#[doc = " This error indicates that the memory range passed to ::cudaHostRegister()\n has already been registered."]
pub const cudaError_cudaErrorHostMemoryAlreadyRegistered: cudaError = 712;
#[doc = " This error indicates that the pointer passed to ::cudaHostUnregister()\n does not correspond to any currently registered memory region."]
pub const cudaError_cudaErrorHostMemoryNotRegistered: cudaError = 713;
#[doc = " Device encountered an error in the call stack during kernel execution,\n possibly due to stack corruption or exceeding the stack size limit.\n This leaves the process in an inconsistent state and any further CUDA work\n will return the same error. To continue using CUDA, the process must be terminated\n and relaunched."]
pub const cudaError_cudaErrorHardwareStackError: cudaError = 714;
#[doc = " The device encountered an illegal instruction during kernel execution\n This leaves the process in an inconsistent state and any further CUDA work\n will return the same error. To continue using CUDA, the process must be terminated\n and relaunched."]
pub const cudaError_cudaErrorIllegalInstruction: cudaError = 715;
#[doc = " The device encountered a load or store instruction\n on a memory address which is not aligned.\n This leaves the process in an inconsistent state and any further CUDA work\n will return the same error. To continue using CUDA, the process must be terminated\n and relaunched."]
pub const cudaError_cudaErrorMisalignedAddress: cudaError = 716;
#[doc = " While executing a kernel, the device encountered an instruction\n which can only operate on memory locations in certain address spaces\n (global, shared, or local), but was supplied a memory address not\n belonging to an allowed address space.\n This leaves the process in an inconsistent state and any further CUDA work\n will return the same error. To continue using CUDA, the process must be terminated\n and relaunched."]
pub const cudaError_cudaErrorInvalidAddressSpace: cudaError = 717;
#[doc = " The device encountered an invalid program counter.\n This leaves the process in an inconsistent state and any further CUDA work\n will return the same error. To continue using CUDA, the process must be terminated\n and relaunched."]
pub const cudaError_cudaErrorInvalidPc: cudaError = 718;
#[doc = " An exception occurred on the device while executing a kernel. Common\n causes include dereferencing an invalid device pointer and accessing\n out of bounds shared memory. Less common cases can be system specific - more\n information about these cases can be found in the system specific user guide.\n This leaves the process in an inconsistent state and any further CUDA work\n will return the same error. To continue using CUDA, the process must be terminated\n and relaunched."]
pub const cudaError_cudaErrorLaunchFailure: cudaError = 719;
#[doc = " This error indicates that the number of blocks launched per grid for a kernel that was\n launched via either ::cudaLaunchCooperativeKernel\n exceeds the maximum number of blocks as allowed by ::cudaOccupancyMaxActiveBlocksPerMultiprocessor\n or ::cudaOccupancyMaxActiveBlocksPerMultiprocessorWithFlags times the number of multiprocessors\n as specified by the device attribute ::cudaDevAttrMultiProcessorCount."]
pub const cudaError_cudaErrorCooperativeLaunchTooLarge: cudaError = 720;
#[doc = " An exception occurred on the device while exiting a kernel using tensor memory: the\n tensor memory was not completely deallocated. This leaves the process in an inconsistent\n state and any further CUDA work will return the same error. To continue using CUDA, the\n process must be terminated and relaunched."]
pub const cudaError_cudaErrorTensorMemoryLeak: cudaError = 721;
#[doc = " This error indicates the attempted operation is not permitted."]
pub const cudaError_cudaErrorNotPermitted: cudaError = 800;
#[doc = " This error indicates the attempted operation is not supported\n on the current system or device."]
pub const cudaError_cudaErrorNotSupported: cudaError = 801;
#[doc = " This error indicates that the system is not yet ready to start any CUDA\n work.  To continue using CUDA, verify the system configuration is in a\n valid state and all required driver daemons are actively running.\n More information about this error can be found in the system specific\n user guide."]
pub const cudaError_cudaErrorSystemNotReady: cudaError = 802;
#[doc = " This error indicates that there is a mismatch between the versions of\n the display driver and the CUDA driver. Refer to the compatibility documentation\n for supported versions."]
pub const cudaError_cudaErrorSystemDriverMismatch: cudaError = 803;
#[doc = " This error indicates that the system was upgraded to run with forward compatibility\n but the visible hardware detected by CUDA does not support this configuration.\n Refer to the compatibility documentation for the supported hardware matrix or ensure\n that only supported hardware is visible during initialization via the CUDA_VISIBLE_DEVICES\n environment variable."]
pub const cudaError_cudaErrorCompatNotSupportedOnDevice: cudaError = 804;
#[doc = " This error indicates that the MPS client failed to connect to the MPS control daemon or the MPS server."]
pub const cudaError_cudaErrorMpsConnectionFailed: cudaError = 805;
#[doc = " This error indicates that the remote procedural call between the MPS server and the MPS client failed."]
pub const cudaError_cudaErrorMpsRpcFailure: cudaError = 806;
#[doc = " This error indicates that the MPS server is not ready to accept new MPS client requests.\n This error can be returned when the MPS server is in the process of recovering from a fatal failure."]
pub const cudaError_cudaErrorMpsServerNotReady: cudaError = 807;
#[doc = " This error indicates that the hardware resources required to create MPS client have been exhausted."]
pub const cudaError_cudaErrorMpsMaxClientsReached: cudaError = 808;
#[doc = " This error indicates the the hardware resources required to device connections have been exhausted."]
pub const cudaError_cudaErrorMpsMaxConnectionsReached: cudaError = 809;
#[doc = " This error indicates that the MPS client has been terminated by the server. To continue using CUDA, the process must be terminated and relaunched."]
pub const cudaError_cudaErrorMpsClientTerminated: cudaError = 810;
#[doc = " This error indicates, that the program is using CUDA Dynamic Parallelism, but the current configuration, like MPS, does not support it."]
pub const cudaError_cudaErrorCdpNotSupported: cudaError = 811;
#[doc = " This error indicates, that the program contains an unsupported interaction between different versions of CUDA Dynamic Parallelism."]
pub const cudaError_cudaErrorCdpVersionMismatch: cudaError = 812;
#[doc = " The operation is not permitted when the stream is capturing."]
pub const cudaError_cudaErrorStreamCaptureUnsupported: cudaError = 900;
#[doc = " The current capture sequence on the stream has been invalidated due to\n a previous error."]
pub const cudaError_cudaErrorStreamCaptureInvalidated: cudaError = 901;
#[doc = " The operation would have resulted in a merge of two independent capture\n sequences."]
pub const cudaError_cudaErrorStreamCaptureMerge: cudaError = 902;
#[doc = " The capture was not initiated in this stream."]
pub const cudaError_cudaErrorStreamCaptureUnmatched: cudaError = 903;
#[doc = " The capture sequence contains a fork that was not joined to the primary\n stream."]
pub const cudaError_cudaErrorStreamCaptureUnjoined: cudaError = 904;
#[doc = " A dependency would have been created which crosses the capture sequence\n boundary. Only implicit in-stream ordering dependencies are allowed to\n cross the boundary."]
pub const cudaError_cudaErrorStreamCaptureIsolation: cudaError = 905;
#[doc = " The operation would have resulted in a disallowed implicit dependency on\n a current capture sequence from cudaStreamLegacy."]
pub const cudaError_cudaErrorStreamCaptureImplicit: cudaError = 906;
#[doc = " The operation is not permitted on an event which was last recorded in a\n capturing stream."]
pub const cudaError_cudaErrorCapturedEvent: cudaError = 907;
#[doc = " A stream capture sequence not initiated with the ::cudaStreamCaptureModeRelaxed\n argument to ::cudaStreamBeginCapture was passed to ::cudaStreamEndCapture in a\n different thread."]
pub const cudaError_cudaErrorStreamCaptureWrongThread: cudaError = 908;
#[doc = " This indicates that the wait operation has timed out."]
pub const cudaError_cudaErrorTimeout: cudaError = 909;
#[doc = " This error indicates that the graph update was not performed because it included\n changes which violated constraints specific to instantiated graph update."]
pub const cudaError_cudaErrorGraphExecUpdateFailure: cudaError = 910;
#[doc = " This indicates that an async error has occurred in a device outside of CUDA.\n If CUDA was waiting for an external device's signal before consuming shared data,\n the external device signaled an error indicating that the data is not valid for\n consumption. This leaves the process in an inconsistent state and any further CUDA\n work will return the same error. To continue using CUDA, the process must be\n terminated and relaunched."]
pub const cudaError_cudaErrorExternalDevice: cudaError = 911;
#[doc = " This indicates that a kernel launch error has occurred due to cluster\n misconfiguration."]
pub const cudaError_cudaErrorInvalidClusterSize: cudaError = 912;
#[doc = " Indiciates a function handle is not loaded when calling an API that requires\n a loaded function."]
pub const cudaError_cudaErrorFunctionNotLoaded: cudaError = 913;
#[doc = " This error indicates one or more resources passed in are not valid resource\n types for the operation."]
pub const cudaError_cudaErrorInvalidResourceType: cudaError = 914;
#[doc = " This error indicates one or more resources are insufficient or non-applicable for\n the operation."]
pub const cudaError_cudaErrorInvalidResourceConfiguration: cudaError = 915;
#[doc = " This indicates that an unknown internal error has occurred."]
pub const cudaError_cudaErrorUnknown: cudaError = 999;
#[doc = " Any unhandled CUDA driver error is added to this value and returned via\n the runtime. Production releases of CUDA should not return such errors.\n \\deprecated\n This error return is deprecated as of CUDA 4.1."]
pub const cudaError_cudaErrorApiFailureBase: cudaError = 10000;
#[doc = " CUDA error types"]
pub type cudaError = ::std::os::raw::c_uint;
#[doc = "< Signed channel format"]
pub const cudaChannelFormatKind_cudaChannelFormatKindSigned: cudaChannelFormatKind = 0;
#[doc = "< Unsigned channel format"]
pub const cudaChannelFormatKind_cudaChannelFormatKindUnsigned: cudaChannelFormatKind = 1;
#[doc = "< Float channel format"]
pub const cudaChannelFormatKind_cudaChannelFormatKindFloat: cudaChannelFormatKind = 2;
#[doc = "< No channel format"]
pub const cudaChannelFormatKind_cudaChannelFormatKindNone: cudaChannelFormatKind = 3;
#[doc = "< Unsigned 8-bit integers, planar 4:2:0 YUV format"]
pub const cudaChannelFormatKind_cudaChannelFormatKindNV12: cudaChannelFormatKind = 4;
#[doc = "< 1 channel unsigned 8-bit normalized integer"]
pub const cudaChannelFormatKind_cudaChannelFormatKindUnsignedNormalized8X1: cudaChannelFormatKind =
    5;
#[doc = "< 2 channel unsigned 8-bit normalized integer"]
pub const cudaChannelFormatKind_cudaChannelFormatKindUnsignedNormalized8X2: cudaChannelFormatKind =
    6;
#[doc = "< 4 channel unsigned 8-bit normalized integer"]
pub const cudaChannelFormatKind_cudaChannelFormatKindUnsignedNormalized8X4: cudaChannelFormatKind =
    7;
#[doc = "< 1 channel unsigned 16-bit normalized integer"]
pub const cudaChannelFormatKind_cudaChannelFormatKindUnsignedNormalized16X1: cudaChannelFormatKind =
    8;
#[doc = "< 2 channel unsigned 16-bit normalized integer"]
pub const cudaChannelFormatKind_cudaChannelFormatKindUnsignedNormalized16X2: cudaChannelFormatKind =
    9;
#[doc = "< 4 channel unsigned 16-bit normalized integer"]
pub const cudaChannelFormatKind_cudaChannelFormatKindUnsignedNormalized16X4: cudaChannelFormatKind =
    10;
#[doc = "< 1 channel signed 8-bit normalized integer"]
pub const cudaChannelFormatKind_cudaChannelFormatKindSignedNormalized8X1: cudaChannelFormatKind =
    11;
#[doc = "< 2 channel signed 8-bit normalized integer"]
pub const cudaChannelFormatKind_cudaChannelFormatKindSignedNormalized8X2: cudaChannelFormatKind =
    12;
#[doc = "< 4 channel signed 8-bit normalized integer"]
pub const cudaChannelFormatKind_cudaChannelFormatKindSignedNormalized8X4: cudaChannelFormatKind =
    13;
#[doc = "< 1 channel signed 16-bit normalized integer"]
pub const cudaChannelFormatKind_cudaChannelFormatKindSignedNormalized16X1: cudaChannelFormatKind =
    14;
#[doc = "< 2 channel signed 16-bit normalized integer"]
pub const cudaChannelFormatKind_cudaChannelFormatKindSignedNormalized16X2: cudaChannelFormatKind =
    15;
#[doc = "< 4 channel signed 16-bit normalized integer"]
pub const cudaChannelFormatKind_cudaChannelFormatKindSignedNormalized16X4: cudaChannelFormatKind =
    16;
#[doc = "< 4 channel unsigned normalized block-compressed (BC1 compression) format"]
pub const cudaChannelFormatKind_cudaChannelFormatKindUnsignedBlockCompressed1:
    cudaChannelFormatKind = 17;
#[doc = "< 4 channel unsigned normalized block-compressed (BC1 compression) format with sRGB encoding"]
pub const cudaChannelFormatKind_cudaChannelFormatKindUnsignedBlockCompressed1SRGB:
    cudaChannelFormatKind = 18;
#[doc = "< 4 channel unsigned normalized block-compressed (BC2 compression) format"]
pub const cudaChannelFormatKind_cudaChannelFormatKindUnsignedBlockCompressed2:
    cudaChannelFormatKind = 19;
#[doc = "< 4 channel unsigned normalized block-compressed (BC2 compression) format with sRGB encoding"]
pub const cudaChannelFormatKind_cudaChannelFormatKindUnsignedBlockCompressed2SRGB:
    cudaChannelFormatKind = 20;
#[doc = "< 4 channel unsigned normalized block-compressed (BC3 compression) format"]
pub const cudaChannelFormatKind_cudaChannelFormatKindUnsignedBlockCompressed3:
    cudaChannelFormatKind = 21;
#[doc = "< 4 channel unsigned normalized block-compressed (BC3 compression) format with sRGB encoding"]
pub const cudaChannelFormatKind_cudaChannelFormatKindUnsignedBlockCompressed3SRGB:
    cudaChannelFormatKind = 22;
#[doc = "< 1 channel unsigned normalized block-compressed (BC4 compression) format"]
pub const cudaChannelFormatKind_cudaChannelFormatKindUnsignedBlockCompressed4:
    cudaChannelFormatKind = 23;
#[doc = "< 1 channel signed normalized block-compressed (BC4 compression) format"]
pub const cudaChannelFormatKind_cudaChannelFormatKindSignedBlockCompressed4: cudaChannelFormatKind =
    24;
#[doc = "< 2 channel unsigned normalized block-compressed (BC5 compression) format"]
pub const cudaChannelFormatKind_cudaChannelFormatKindUnsignedBlockCompressed5:
    cudaChannelFormatKind = 25;
#[doc = "< 2 channel signed normalized block-compressed (BC5 compression) format"]
pub const cudaChannelFormatKind_cudaChannelFormatKindSignedBlockCompressed5: cudaChannelFormatKind =
    26;
#[doc = "< 3 channel unsigned half-float block-compressed (BC6H compression) format"]
pub const cudaChannelFormatKind_cudaChannelFormatKindUnsignedBlockCompressed6H:
    cudaChannelFormatKind = 27;
#[doc = "< 3 channel signed half-float block-compressed (BC6H compression) format"]
pub const cudaChannelFormatKind_cudaChannelFormatKindSignedBlockCompressed6H:
    cudaChannelFormatKind = 28;
#[doc = "< 4 channel unsigned normalized block-compressed (BC7 compression) format"]
pub const cudaChannelFormatKind_cudaChannelFormatKindUnsignedBlockCompressed7:
    cudaChannelFormatKind = 29;
#[doc = "< 4 channel unsigned normalized block-compressed (BC7 compression) format with sRGB encoding"]
pub const cudaChannelFormatKind_cudaChannelFormatKindUnsignedBlockCompressed7SRGB:
    cudaChannelFormatKind = 30;
#[doc = "< 4 channel unsigned normalized (10-bit, 10-bit, 10-bit, 2-bit) format"]
pub const cudaChannelFormatKind_cudaChannelFormatKindUnsignedNormalized1010102:
    cudaChannelFormatKind = 31;
#[doc = " Channel format kind"]
pub type cudaChannelFormatKind = ::std::os::raw::c_uint;
#[doc = " CUDA Channel format descriptor"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaChannelFormatDesc {
    #[doc = "< x"]
    pub x: ::std::os::raw::c_int,
    #[doc = "< y"]
    pub y: ::std::os::raw::c_int,
    #[doc = "< z"]
    pub z: ::std::os::raw::c_int,
    #[doc = "< w"]
    pub w: ::std::os::raw::c_int,
    #[doc = "< Channel format kind"]
    pub f: cudaChannelFormatKind,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaChannelFormatDesc"][::std::mem::size_of::<cudaChannelFormatDesc>() - 20usize];
    ["Alignment of cudaChannelFormatDesc"]
        [::std::mem::align_of::<cudaChannelFormatDesc>() - 4usize];
    ["Offset of field: cudaChannelFormatDesc::x"]
        [::std::mem::offset_of!(cudaChannelFormatDesc, x) - 0usize];
    ["Offset of field: cudaChannelFormatDesc::y"]
        [::std::mem::offset_of!(cudaChannelFormatDesc, y) - 4usize];
    ["Offset of field: cudaChannelFormatDesc::z"]
        [::std::mem::offset_of!(cudaChannelFormatDesc, z) - 8usize];
    ["Offset of field: cudaChannelFormatDesc::w"]
        [::std::mem::offset_of!(cudaChannelFormatDesc, w) - 12usize];
    ["Offset of field: cudaChannelFormatDesc::f"]
        [::std::mem::offset_of!(cudaChannelFormatDesc, f) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaArray {
    _unused: [u8; 0],
}
#[doc = " CUDA array"]
pub type cudaArray_t = *mut cudaArray;
#[doc = " CUDA array (as source copy argument)"]
pub type cudaArray_const_t = *const cudaArray;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaMipmappedArray {
    _unused: [u8; 0],
}
#[doc = " CUDA mipmapped array"]
pub type cudaMipmappedArray_t = *mut cudaMipmappedArray;
#[doc = " CUDA mipmapped array (as source argument)"]
pub type cudaMipmappedArray_const_t = *const cudaMipmappedArray;
#[doc = " Sparse CUDA array and CUDA mipmapped array properties"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaArraySparseProperties {
    pub tileExtent: cudaArraySparseProperties__bindgen_ty_1,
    #[doc = "< First mip level at which the mip tail begins"]
    pub miptailFirstLevel: ::std::os::raw::c_uint,
    #[doc = "< Total size of the mip tail."]
    pub miptailSize: ::std::os::raw::c_ulonglong,
    #[doc = "< Flags will either be zero or ::cudaArraySparsePropertiesSingleMipTail"]
    pub flags: ::std::os::raw::c_uint,
    pub reserved: [::std::os::raw::c_uint; 4usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaArraySparseProperties__bindgen_ty_1 {
    #[doc = "< Tile width in elements"]
    pub width: ::std::os::raw::c_uint,
    #[doc = "< Tile height in elements"]
    pub height: ::std::os::raw::c_uint,
    #[doc = "< Tile depth in elements"]
    pub depth: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaArraySparseProperties__bindgen_ty_1"]
        [::std::mem::size_of::<cudaArraySparseProperties__bindgen_ty_1>() - 12usize];
    ["Alignment of cudaArraySparseProperties__bindgen_ty_1"]
        [::std::mem::align_of::<cudaArraySparseProperties__bindgen_ty_1>() - 4usize];
    ["Offset of field: cudaArraySparseProperties__bindgen_ty_1::width"]
        [::std::mem::offset_of!(cudaArraySparseProperties__bindgen_ty_1, width) - 0usize];
    ["Offset of field: cudaArraySparseProperties__bindgen_ty_1::height"]
        [::std::mem::offset_of!(cudaArraySparseProperties__bindgen_ty_1, height) - 4usize];
    ["Offset of field: cudaArraySparseProperties__bindgen_ty_1::depth"]
        [::std::mem::offset_of!(cudaArraySparseProperties__bindgen_ty_1, depth) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaArraySparseProperties"]
        [::std::mem::size_of::<cudaArraySparseProperties>() - 48usize];
    ["Alignment of cudaArraySparseProperties"]
        [::std::mem::align_of::<cudaArraySparseProperties>() - 8usize];
    ["Offset of field: cudaArraySparseProperties::tileExtent"]
        [::std::mem::offset_of!(cudaArraySparseProperties, tileExtent) - 0usize];
    ["Offset of field: cudaArraySparseProperties::miptailFirstLevel"]
        [::std::mem::offset_of!(cudaArraySparseProperties, miptailFirstLevel) - 12usize];
    ["Offset of field: cudaArraySparseProperties::miptailSize"]
        [::std::mem::offset_of!(cudaArraySparseProperties, miptailSize) - 16usize];
    ["Offset of field: cudaArraySparseProperties::flags"]
        [::std::mem::offset_of!(cudaArraySparseProperties, flags) - 24usize];
    ["Offset of field: cudaArraySparseProperties::reserved"]
        [::std::mem::offset_of!(cudaArraySparseProperties, reserved) - 28usize];
};
#[doc = " CUDA array and CUDA mipmapped array memory requirements"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaArrayMemoryRequirements {
    #[doc = "< Total size of the array."]
    pub size: usize,
    #[doc = "< Alignment necessary for mapping the array."]
    pub alignment: usize,
    pub reserved: [::std::os::raw::c_uint; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaArrayMemoryRequirements"]
        [::std::mem::size_of::<cudaArrayMemoryRequirements>() - 32usize];
    ["Alignment of cudaArrayMemoryRequirements"]
        [::std::mem::align_of::<cudaArrayMemoryRequirements>() - 8usize];
    ["Offset of field: cudaArrayMemoryRequirements::size"]
        [::std::mem::offset_of!(cudaArrayMemoryRequirements, size) - 0usize];
    ["Offset of field: cudaArrayMemoryRequirements::alignment"]
        [::std::mem::offset_of!(cudaArrayMemoryRequirements, alignment) - 8usize];
    ["Offset of field: cudaArrayMemoryRequirements::reserved"]
        [::std::mem::offset_of!(cudaArrayMemoryRequirements, reserved) - 16usize];
};
#[doc = "< Unregistered memory"]
pub const cudaMemoryType_cudaMemoryTypeUnregistered: cudaMemoryType = 0;
#[doc = "< Host memory"]
pub const cudaMemoryType_cudaMemoryTypeHost: cudaMemoryType = 1;
#[doc = "< Device memory"]
pub const cudaMemoryType_cudaMemoryTypeDevice: cudaMemoryType = 2;
#[doc = "< Managed memory"]
pub const cudaMemoryType_cudaMemoryTypeManaged: cudaMemoryType = 3;
#[doc = " CUDA memory types"]
pub type cudaMemoryType = ::std::os::raw::c_uint;
#[doc = "< Host   -> Host"]
pub const cudaMemcpyKind_cudaMemcpyHostToHost: cudaMemcpyKind = 0;
#[doc = "< Host   -> Device"]
pub const cudaMemcpyKind_cudaMemcpyHostToDevice: cudaMemcpyKind = 1;
#[doc = "< Device -> Host"]
pub const cudaMemcpyKind_cudaMemcpyDeviceToHost: cudaMemcpyKind = 2;
#[doc = "< Device -> Device"]
pub const cudaMemcpyKind_cudaMemcpyDeviceToDevice: cudaMemcpyKind = 3;
#[doc = "< Direction of the transfer is inferred from the pointer values. Requires unified virtual addressing"]
pub const cudaMemcpyKind_cudaMemcpyDefault: cudaMemcpyKind = 4;
#[doc = " CUDA memory copy types"]
pub type cudaMemcpyKind = ::std::os::raw::c_uint;
#[doc = " CUDA Pitched memory pointer\n\n \\sa ::make_cudaPitchedPtr"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaPitchedPtr {
    #[doc = "< Pointer to allocated memory"]
    pub ptr: *mut ::std::os::raw::c_void,
    #[doc = "< Pitch of allocated memory in bytes"]
    pub pitch: usize,
    #[doc = "< Logical width of allocation in elements"]
    pub xsize: usize,
    #[doc = "< Logical height of allocation in elements"]
    pub ysize: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaPitchedPtr"][::std::mem::size_of::<cudaPitchedPtr>() - 32usize];
    ["Alignment of cudaPitchedPtr"][::std::mem::align_of::<cudaPitchedPtr>() - 8usize];
    ["Offset of field: cudaPitchedPtr::ptr"][::std::mem::offset_of!(cudaPitchedPtr, ptr) - 0usize];
    ["Offset of field: cudaPitchedPtr::pitch"]
        [::std::mem::offset_of!(cudaPitchedPtr, pitch) - 8usize];
    ["Offset of field: cudaPitchedPtr::xsize"]
        [::std::mem::offset_of!(cudaPitchedPtr, xsize) - 16usize];
    ["Offset of field: cudaPitchedPtr::ysize"]
        [::std::mem::offset_of!(cudaPitchedPtr, ysize) - 24usize];
};
#[doc = " CUDA extent\n\n \\sa ::make_cudaExtent"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaExtent {
    #[doc = "< Width in elements when referring to array memory, in bytes when referring to linear memory"]
    pub width: usize,
    #[doc = "< Height in elements"]
    pub height: usize,
    #[doc = "< Depth in elements"]
    pub depth: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaExtent"][::std::mem::size_of::<cudaExtent>() - 24usize];
    ["Alignment of cudaExtent"][::std::mem::align_of::<cudaExtent>() - 8usize];
    ["Offset of field: cudaExtent::width"][::std::mem::offset_of!(cudaExtent, width) - 0usize];
    ["Offset of field: cudaExtent::height"][::std::mem::offset_of!(cudaExtent, height) - 8usize];
    ["Offset of field: cudaExtent::depth"][::std::mem::offset_of!(cudaExtent, depth) - 16usize];
};
#[doc = " CUDA 3D position\n\n \\sa ::make_cudaPos"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaPos {
    #[doc = "< x"]
    pub x: usize,
    #[doc = "< y"]
    pub y: usize,
    #[doc = "< z"]
    pub z: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaPos"][::std::mem::size_of::<cudaPos>() - 24usize];
    ["Alignment of cudaPos"][::std::mem::align_of::<cudaPos>() - 8usize];
    ["Offset of field: cudaPos::x"][::std::mem::offset_of!(cudaPos, x) - 0usize];
    ["Offset of field: cudaPos::y"][::std::mem::offset_of!(cudaPos, y) - 8usize];
    ["Offset of field: cudaPos::z"][::std::mem::offset_of!(cudaPos, z) - 16usize];
};
#[doc = " CUDA 3D memory copying parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaMemcpy3DParms {
    #[doc = "< Source memory address"]
    pub srcArray: cudaArray_t,
    #[doc = "< Source position offset"]
    pub srcPos: cudaPos,
    #[doc = "< Pitched source memory address"]
    pub srcPtr: cudaPitchedPtr,
    #[doc = "< Destination memory address"]
    pub dstArray: cudaArray_t,
    #[doc = "< Destination position offset"]
    pub dstPos: cudaPos,
    #[doc = "< Pitched destination memory address"]
    pub dstPtr: cudaPitchedPtr,
    #[doc = "< Requested memory copy size"]
    pub extent: cudaExtent,
    #[doc = "< Type of transfer"]
    pub kind: cudaMemcpyKind,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaMemcpy3DParms"][::std::mem::size_of::<cudaMemcpy3DParms>() - 160usize];
    ["Alignment of cudaMemcpy3DParms"][::std::mem::align_of::<cudaMemcpy3DParms>() - 8usize];
    ["Offset of field: cudaMemcpy3DParms::srcArray"]
        [::std::mem::offset_of!(cudaMemcpy3DParms, srcArray) - 0usize];
    ["Offset of field: cudaMemcpy3DParms::srcPos"]
        [::std::mem::offset_of!(cudaMemcpy3DParms, srcPos) - 8usize];
    ["Offset of field: cudaMemcpy3DParms::srcPtr"]
        [::std::mem::offset_of!(cudaMemcpy3DParms, srcPtr) - 32usize];
    ["Offset of field: cudaMemcpy3DParms::dstArray"]
        [::std::mem::offset_of!(cudaMemcpy3DParms, dstArray) - 64usize];
    ["Offset of field: cudaMemcpy3DParms::dstPos"]
        [::std::mem::offset_of!(cudaMemcpy3DParms, dstPos) - 72usize];
    ["Offset of field: cudaMemcpy3DParms::dstPtr"]
        [::std::mem::offset_of!(cudaMemcpy3DParms, dstPtr) - 96usize];
    ["Offset of field: cudaMemcpy3DParms::extent"]
        [::std::mem::offset_of!(cudaMemcpy3DParms, extent) - 128usize];
    ["Offset of field: cudaMemcpy3DParms::kind"]
        [::std::mem::offset_of!(cudaMemcpy3DParms, kind) - 152usize];
};
#[doc = " Memcpy node parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaMemcpyNodeParams {
    #[doc = "< Must be zero"]
    pub flags: ::std::os::raw::c_int,
    #[doc = "< Must be zero"]
    pub reserved: [::std::os::raw::c_int; 3usize],
    #[doc = "< Parameters for the memory copy"]
    pub copyParams: cudaMemcpy3DParms,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaMemcpyNodeParams"][::std::mem::size_of::<cudaMemcpyNodeParams>() - 176usize];
    ["Alignment of cudaMemcpyNodeParams"][::std::mem::align_of::<cudaMemcpyNodeParams>() - 8usize];
    ["Offset of field: cudaMemcpyNodeParams::flags"]
        [::std::mem::offset_of!(cudaMemcpyNodeParams, flags) - 0usize];
    ["Offset of field: cudaMemcpyNodeParams::reserved"]
        [::std::mem::offset_of!(cudaMemcpyNodeParams, reserved) - 4usize];
    ["Offset of field: cudaMemcpyNodeParams::copyParams"]
        [::std::mem::offset_of!(cudaMemcpyNodeParams, copyParams) - 16usize];
};
#[doc = " CUDA 3D cross-device memory copying parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaMemcpy3DPeerParms {
    #[doc = "< Source memory address"]
    pub srcArray: cudaArray_t,
    #[doc = "< Source position offset"]
    pub srcPos: cudaPos,
    #[doc = "< Pitched source memory address"]
    pub srcPtr: cudaPitchedPtr,
    #[doc = "< Source device"]
    pub srcDevice: ::std::os::raw::c_int,
    #[doc = "< Destination memory address"]
    pub dstArray: cudaArray_t,
    #[doc = "< Destination position offset"]
    pub dstPos: cudaPos,
    #[doc = "< Pitched destination memory address"]
    pub dstPtr: cudaPitchedPtr,
    #[doc = "< Destination device"]
    pub dstDevice: ::std::os::raw::c_int,
    #[doc = "< Requested memory copy size"]
    pub extent: cudaExtent,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaMemcpy3DPeerParms"][::std::mem::size_of::<cudaMemcpy3DPeerParms>() - 168usize];
    ["Alignment of cudaMemcpy3DPeerParms"]
        [::std::mem::align_of::<cudaMemcpy3DPeerParms>() - 8usize];
    ["Offset of field: cudaMemcpy3DPeerParms::srcArray"]
        [::std::mem::offset_of!(cudaMemcpy3DPeerParms, srcArray) - 0usize];
    ["Offset of field: cudaMemcpy3DPeerParms::srcPos"]
        [::std::mem::offset_of!(cudaMemcpy3DPeerParms, srcPos) - 8usize];
    ["Offset of field: cudaMemcpy3DPeerParms::srcPtr"]
        [::std::mem::offset_of!(cudaMemcpy3DPeerParms, srcPtr) - 32usize];
    ["Offset of field: cudaMemcpy3DPeerParms::srcDevice"]
        [::std::mem::offset_of!(cudaMemcpy3DPeerParms, srcDevice) - 64usize];
    ["Offset of field: cudaMemcpy3DPeerParms::dstArray"]
        [::std::mem::offset_of!(cudaMemcpy3DPeerParms, dstArray) - 72usize];
    ["Offset of field: cudaMemcpy3DPeerParms::dstPos"]
        [::std::mem::offset_of!(cudaMemcpy3DPeerParms, dstPos) - 80usize];
    ["Offset of field: cudaMemcpy3DPeerParms::dstPtr"]
        [::std::mem::offset_of!(cudaMemcpy3DPeerParms, dstPtr) - 104usize];
    ["Offset of field: cudaMemcpy3DPeerParms::dstDevice"]
        [::std::mem::offset_of!(cudaMemcpy3DPeerParms, dstDevice) - 136usize];
    ["Offset of field: cudaMemcpy3DPeerParms::extent"]
        [::std::mem::offset_of!(cudaMemcpy3DPeerParms, extent) - 144usize];
};
#[doc = " CUDA Memset node parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaMemsetParams {
    #[doc = "< Destination device pointer"]
    pub dst: *mut ::std::os::raw::c_void,
    #[doc = "< Pitch of destination device pointer. Unused if height is 1"]
    pub pitch: usize,
    #[doc = "< Value to be set"]
    pub value: ::std::os::raw::c_uint,
    #[doc = "< Size of each element in bytes. Must be 1, 2, or 4."]
    pub elementSize: ::std::os::raw::c_uint,
    #[doc = "< Width of the row in elements"]
    pub width: usize,
    #[doc = "< Number of rows"]
    pub height: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaMemsetParams"][::std::mem::size_of::<cudaMemsetParams>() - 40usize];
    ["Alignment of cudaMemsetParams"][::std::mem::align_of::<cudaMemsetParams>() - 8usize];
    ["Offset of field: cudaMemsetParams::dst"]
        [::std::mem::offset_of!(cudaMemsetParams, dst) - 0usize];
    ["Offset of field: cudaMemsetParams::pitch"]
        [::std::mem::offset_of!(cudaMemsetParams, pitch) - 8usize];
    ["Offset of field: cudaMemsetParams::value"]
        [::std::mem::offset_of!(cudaMemsetParams, value) - 16usize];
    ["Offset of field: cudaMemsetParams::elementSize"]
        [::std::mem::offset_of!(cudaMemsetParams, elementSize) - 20usize];
    ["Offset of field: cudaMemsetParams::width"]
        [::std::mem::offset_of!(cudaMemsetParams, width) - 24usize];
    ["Offset of field: cudaMemsetParams::height"]
        [::std::mem::offset_of!(cudaMemsetParams, height) - 32usize];
};
#[doc = " CUDA Memset node parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaMemsetParamsV2 {
    #[doc = "< Destination device pointer"]
    pub dst: *mut ::std::os::raw::c_void,
    #[doc = "< Pitch of destination device pointer. Unused if height is 1"]
    pub pitch: usize,
    #[doc = "< Value to be set"]
    pub value: ::std::os::raw::c_uint,
    #[doc = "< Size of each element in bytes. Must be 1, 2, or 4."]
    pub elementSize: ::std::os::raw::c_uint,
    #[doc = "< Width of the row in elements"]
    pub width: usize,
    #[doc = "< Number of rows"]
    pub height: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaMemsetParamsV2"][::std::mem::size_of::<cudaMemsetParamsV2>() - 40usize];
    ["Alignment of cudaMemsetParamsV2"][::std::mem::align_of::<cudaMemsetParamsV2>() - 8usize];
    ["Offset of field: cudaMemsetParamsV2::dst"]
        [::std::mem::offset_of!(cudaMemsetParamsV2, dst) - 0usize];
    ["Offset of field: cudaMemsetParamsV2::pitch"]
        [::std::mem::offset_of!(cudaMemsetParamsV2, pitch) - 8usize];
    ["Offset of field: cudaMemsetParamsV2::value"]
        [::std::mem::offset_of!(cudaMemsetParamsV2, value) - 16usize];
    ["Offset of field: cudaMemsetParamsV2::elementSize"]
        [::std::mem::offset_of!(cudaMemsetParamsV2, elementSize) - 20usize];
    ["Offset of field: cudaMemsetParamsV2::width"]
        [::std::mem::offset_of!(cudaMemsetParamsV2, width) - 24usize];
    ["Offset of field: cudaMemsetParamsV2::height"]
        [::std::mem::offset_of!(cudaMemsetParamsV2, height) - 32usize];
};
#[doc = "< Normal cache persistence."]
pub const cudaAccessProperty_cudaAccessPropertyNormal: cudaAccessProperty = 0;
#[doc = "< Streaming access is less likely to persit from cache."]
pub const cudaAccessProperty_cudaAccessPropertyStreaming: cudaAccessProperty = 1;
#[doc = "< Persisting access is more likely to persist in cache."]
pub const cudaAccessProperty_cudaAccessPropertyPersisting: cudaAccessProperty = 2;
#[doc = " Specifies performance hint with ::cudaAccessPolicyWindow for hitProp and missProp members."]
pub type cudaAccessProperty = ::std::os::raw::c_uint;
#[doc = " Specifies an access policy for a window, a contiguous extent of memory\n beginning at base_ptr and ending at base_ptr + num_bytes.\n Partition into many segments and assign segments such that.\n sum of \"hit segments\" / window == approx. ratio.\n sum of \"miss segments\" / window == approx 1-ratio.\n Segments and ratio specifications are fitted to the capabilities of\n the architecture.\n Accesses in a hit segment apply the hitProp access policy.\n Accesses in a miss segment apply the missProp access policy."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaAccessPolicyWindow {
    #[doc = "< Starting address of the access policy window. CUDA driver may align it."]
    pub base_ptr: *mut ::std::os::raw::c_void,
    #[doc = "< Size in bytes of the window policy. CUDA driver may restrict the maximum size and alignment."]
    pub num_bytes: usize,
    #[doc = "< hitRatio specifies percentage of lines assigned hitProp, rest are assigned missProp."]
    pub hitRatio: f32,
    #[doc = "< ::CUaccessProperty set for hit."]
    pub hitProp: cudaAccessProperty,
    #[doc = "< ::CUaccessProperty set for miss. Must be either NORMAL or STREAMING."]
    pub missProp: cudaAccessProperty,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaAccessPolicyWindow"][::std::mem::size_of::<cudaAccessPolicyWindow>() - 32usize];
    ["Alignment of cudaAccessPolicyWindow"]
        [::std::mem::align_of::<cudaAccessPolicyWindow>() - 8usize];
    ["Offset of field: cudaAccessPolicyWindow::base_ptr"]
        [::std::mem::offset_of!(cudaAccessPolicyWindow, base_ptr) - 0usize];
    ["Offset of field: cudaAccessPolicyWindow::num_bytes"]
        [::std::mem::offset_of!(cudaAccessPolicyWindow, num_bytes) - 8usize];
    ["Offset of field: cudaAccessPolicyWindow::hitRatio"]
        [::std::mem::offset_of!(cudaAccessPolicyWindow, hitRatio) - 16usize];
    ["Offset of field: cudaAccessPolicyWindow::hitProp"]
        [::std::mem::offset_of!(cudaAccessPolicyWindow, hitProp) - 20usize];
    ["Offset of field: cudaAccessPolicyWindow::missProp"]
        [::std::mem::offset_of!(cudaAccessPolicyWindow, missProp) - 24usize];
};
#[doc = " CUDA host function\n \\param userData Argument value passed to the function"]
pub type cudaHostFn_t =
    ::std::option::Option<unsafe extern "C" fn(userData: *mut ::std::os::raw::c_void)>;
#[doc = " CUDA host node parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaHostNodeParams {
    #[doc = "< The function to call when the node executes"]
    pub fn_: cudaHostFn_t,
    #[doc = "< Argument to pass to the function"]
    pub userData: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaHostNodeParams"][::std::mem::size_of::<cudaHostNodeParams>() - 16usize];
    ["Alignment of cudaHostNodeParams"][::std::mem::align_of::<cudaHostNodeParams>() - 8usize];
    ["Offset of field: cudaHostNodeParams::fn_"]
        [::std::mem::offset_of!(cudaHostNodeParams, fn_) - 0usize];
    ["Offset of field: cudaHostNodeParams::userData"]
        [::std::mem::offset_of!(cudaHostNodeParams, userData) - 8usize];
};
#[doc = " CUDA host node parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaHostNodeParamsV2 {
    #[doc = "< The function to call when the node executes"]
    pub fn_: cudaHostFn_t,
    #[doc = "< Argument to pass to the function"]
    pub userData: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaHostNodeParamsV2"][::std::mem::size_of::<cudaHostNodeParamsV2>() - 16usize];
    ["Alignment of cudaHostNodeParamsV2"][::std::mem::align_of::<cudaHostNodeParamsV2>() - 8usize];
    ["Offset of field: cudaHostNodeParamsV2::fn_"]
        [::std::mem::offset_of!(cudaHostNodeParamsV2, fn_) - 0usize];
    ["Offset of field: cudaHostNodeParamsV2::userData"]
        [::std::mem::offset_of!(cudaHostNodeParamsV2, userData) - 8usize];
};
#[doc = "< Stream is not capturing"]
pub const cudaStreamCaptureStatus_cudaStreamCaptureStatusNone: cudaStreamCaptureStatus = 0;
#[doc = "< Stream is actively capturing"]
pub const cudaStreamCaptureStatus_cudaStreamCaptureStatusActive: cudaStreamCaptureStatus = 1;
#[doc = "< Stream is part of a capture sequence that\nhas been invalidated, but not terminated"]
pub const cudaStreamCaptureStatus_cudaStreamCaptureStatusInvalidated: cudaStreamCaptureStatus = 2;
#[doc = " Possible stream capture statuses returned by ::cudaStreamIsCapturing"]
pub type cudaStreamCaptureStatus = ::std::os::raw::c_uint;
pub const cudaStreamCaptureMode_cudaStreamCaptureModeGlobal: cudaStreamCaptureMode = 0;
pub const cudaStreamCaptureMode_cudaStreamCaptureModeThreadLocal: cudaStreamCaptureMode = 1;
pub const cudaStreamCaptureMode_cudaStreamCaptureModeRelaxed: cudaStreamCaptureMode = 2;
#[doc = " Possible modes for stream capture thread interactions. For more details see\n ::cudaStreamBeginCapture and ::cudaThreadExchangeStreamCaptureMode"]
pub type cudaStreamCaptureMode = ::std::os::raw::c_uint;
pub const cudaSynchronizationPolicy_cudaSyncPolicyAuto: cudaSynchronizationPolicy = 1;
pub const cudaSynchronizationPolicy_cudaSyncPolicySpin: cudaSynchronizationPolicy = 2;
pub const cudaSynchronizationPolicy_cudaSyncPolicyYield: cudaSynchronizationPolicy = 3;
pub const cudaSynchronizationPolicy_cudaSyncPolicyBlockingSync: cudaSynchronizationPolicy = 4;
pub type cudaSynchronizationPolicy = ::std::os::raw::c_uint;
#[doc = "< the default policy"]
pub const cudaClusterSchedulingPolicy_cudaClusterSchedulingPolicyDefault:
    cudaClusterSchedulingPolicy = 0;
#[doc = "< spread the blocks within a cluster to the SMs"]
pub const cudaClusterSchedulingPolicy_cudaClusterSchedulingPolicySpread:
    cudaClusterSchedulingPolicy = 1;
#[doc = "< allow the hardware to load-balance the blocks in a cluster to the SMs"]
pub const cudaClusterSchedulingPolicy_cudaClusterSchedulingPolicyLoadBalancing:
    cudaClusterSchedulingPolicy = 2;
#[doc = " Cluster scheduling policies. These may be passed to ::cudaFuncSetAttribute"]
pub type cudaClusterSchedulingPolicy = ::std::os::raw::c_uint;
#[doc = "< Add new nodes to the dependency set"]
pub const cudaStreamUpdateCaptureDependenciesFlags_cudaStreamAddCaptureDependencies:
    cudaStreamUpdateCaptureDependenciesFlags = 0;
#[doc = "< Replace the dependency set with the new nodes"]
pub const cudaStreamUpdateCaptureDependenciesFlags_cudaStreamSetCaptureDependencies:
    cudaStreamUpdateCaptureDependenciesFlags = 1;
#[doc = " Flags for ::cudaStreamUpdateCaptureDependencies"]
pub type cudaStreamUpdateCaptureDependenciesFlags = ::std::os::raw::c_uint;
#[doc = "< Indicates the destructor execution is not synchronized by any CUDA handle."]
pub const cudaUserObjectFlags_cudaUserObjectNoDestructorSync: cudaUserObjectFlags = 1;
#[doc = " Flags for user objects for graphs"]
pub type cudaUserObjectFlags = ::std::os::raw::c_uint;
#[doc = "< Transfer references from the caller rather than creating new references."]
pub const cudaUserObjectRetainFlags_cudaGraphUserObjectMove: cudaUserObjectRetainFlags = 1;
#[doc = " Flags for retaining user object references for graphs"]
pub type cudaUserObjectRetainFlags = ::std::os::raw::c_uint;
#[doc = " CUDA graphics interop resource"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaGraphicsResource {
    _unused: [u8; 0],
}
#[doc = "< Default"]
pub const cudaGraphicsRegisterFlags_cudaGraphicsRegisterFlagsNone: cudaGraphicsRegisterFlags = 0;
#[doc = "< CUDA will not write to this resource"]
pub const cudaGraphicsRegisterFlags_cudaGraphicsRegisterFlagsReadOnly: cudaGraphicsRegisterFlags =
    1;
#[doc = "< CUDA will only write to and will not read from this resource"]
pub const cudaGraphicsRegisterFlags_cudaGraphicsRegisterFlagsWriteDiscard:
    cudaGraphicsRegisterFlags = 2;
#[doc = "< CUDA will bind this resource to a surface reference"]
pub const cudaGraphicsRegisterFlags_cudaGraphicsRegisterFlagsSurfaceLoadStore:
    cudaGraphicsRegisterFlags = 4;
#[doc = "< CUDA will perform texture gather operations on this resource"]
pub const cudaGraphicsRegisterFlags_cudaGraphicsRegisterFlagsTextureGather:
    cudaGraphicsRegisterFlags = 8;
#[doc = " CUDA graphics interop register flags"]
pub type cudaGraphicsRegisterFlags = ::std::os::raw::c_uint;
#[doc = "< Default; Assume resource can be read/written"]
pub const cudaGraphicsMapFlags_cudaGraphicsMapFlagsNone: cudaGraphicsMapFlags = 0;
#[doc = "< CUDA will not write to this resource"]
pub const cudaGraphicsMapFlags_cudaGraphicsMapFlagsReadOnly: cudaGraphicsMapFlags = 1;
#[doc = "< CUDA will only write to and will not read from this resource"]
pub const cudaGraphicsMapFlags_cudaGraphicsMapFlagsWriteDiscard: cudaGraphicsMapFlags = 2;
#[doc = " CUDA graphics interop map flags"]
pub type cudaGraphicsMapFlags = ::std::os::raw::c_uint;
#[doc = "< Positive X face of cubemap"]
pub const cudaGraphicsCubeFace_cudaGraphicsCubeFacePositiveX: cudaGraphicsCubeFace = 0;
#[doc = "< Negative X face of cubemap"]
pub const cudaGraphicsCubeFace_cudaGraphicsCubeFaceNegativeX: cudaGraphicsCubeFace = 1;
#[doc = "< Positive Y face of cubemap"]
pub const cudaGraphicsCubeFace_cudaGraphicsCubeFacePositiveY: cudaGraphicsCubeFace = 2;
#[doc = "< Negative Y face of cubemap"]
pub const cudaGraphicsCubeFace_cudaGraphicsCubeFaceNegativeY: cudaGraphicsCubeFace = 3;
#[doc = "< Positive Z face of cubemap"]
pub const cudaGraphicsCubeFace_cudaGraphicsCubeFacePositiveZ: cudaGraphicsCubeFace = 4;
#[doc = "< Negative Z face of cubemap"]
pub const cudaGraphicsCubeFace_cudaGraphicsCubeFaceNegativeZ: cudaGraphicsCubeFace = 5;
#[doc = " CUDA graphics interop array indices for cube maps"]
pub type cudaGraphicsCubeFace = ::std::os::raw::c_uint;
#[doc = "< Array resource"]
pub const cudaResourceType_cudaResourceTypeArray: cudaResourceType = 0;
#[doc = "< Mipmapped array resource"]
pub const cudaResourceType_cudaResourceTypeMipmappedArray: cudaResourceType = 1;
#[doc = "< Linear resource"]
pub const cudaResourceType_cudaResourceTypeLinear: cudaResourceType = 2;
#[doc = "< Pitch 2D resource"]
pub const cudaResourceType_cudaResourceTypePitch2D: cudaResourceType = 3;
#[doc = " CUDA resource types"]
pub type cudaResourceType = ::std::os::raw::c_uint;
#[doc = "< No resource view format (use underlying resource format)"]
pub const cudaResourceViewFormat_cudaResViewFormatNone: cudaResourceViewFormat = 0;
#[doc = "< 1 channel unsigned 8-bit integers"]
pub const cudaResourceViewFormat_cudaResViewFormatUnsignedChar1: cudaResourceViewFormat = 1;
#[doc = "< 2 channel unsigned 8-bit integers"]
pub const cudaResourceViewFormat_cudaResViewFormatUnsignedChar2: cudaResourceViewFormat = 2;
#[doc = "< 4 channel unsigned 8-bit integers"]
pub const cudaResourceViewFormat_cudaResViewFormatUnsignedChar4: cudaResourceViewFormat = 3;
#[doc = "< 1 channel signed 8-bit integers"]
pub const cudaResourceViewFormat_cudaResViewFormatSignedChar1: cudaResourceViewFormat = 4;
#[doc = "< 2 channel signed 8-bit integers"]
pub const cudaResourceViewFormat_cudaResViewFormatSignedChar2: cudaResourceViewFormat = 5;
#[doc = "< 4 channel signed 8-bit integers"]
pub const cudaResourceViewFormat_cudaResViewFormatSignedChar4: cudaResourceViewFormat = 6;
#[doc = "< 1 channel unsigned 16-bit integers"]
pub const cudaResourceViewFormat_cudaResViewFormatUnsignedShort1: cudaResourceViewFormat = 7;
#[doc = "< 2 channel unsigned 16-bit integers"]
pub const cudaResourceViewFormat_cudaResViewFormatUnsignedShort2: cudaResourceViewFormat = 8;
#[doc = "< 4 channel unsigned 16-bit integers"]
pub const cudaResourceViewFormat_cudaResViewFormatUnsignedShort4: cudaResourceViewFormat = 9;
#[doc = "< 1 channel signed 16-bit integers"]
pub const cudaResourceViewFormat_cudaResViewFormatSignedShort1: cudaResourceViewFormat = 10;
#[doc = "< 2 channel signed 16-bit integers"]
pub const cudaResourceViewFormat_cudaResViewFormatSignedShort2: cudaResourceViewFormat = 11;
#[doc = "< 4 channel signed 16-bit integers"]
pub const cudaResourceViewFormat_cudaResViewFormatSignedShort4: cudaResourceViewFormat = 12;
#[doc = "< 1 channel unsigned 32-bit integers"]
pub const cudaResourceViewFormat_cudaResViewFormatUnsignedInt1: cudaResourceViewFormat = 13;
#[doc = "< 2 channel unsigned 32-bit integers"]
pub const cudaResourceViewFormat_cudaResViewFormatUnsignedInt2: cudaResourceViewFormat = 14;
#[doc = "< 4 channel unsigned 32-bit integers"]
pub const cudaResourceViewFormat_cudaResViewFormatUnsignedInt4: cudaResourceViewFormat = 15;
#[doc = "< 1 channel signed 32-bit integers"]
pub const cudaResourceViewFormat_cudaResViewFormatSignedInt1: cudaResourceViewFormat = 16;
#[doc = "< 2 channel signed 32-bit integers"]
pub const cudaResourceViewFormat_cudaResViewFormatSignedInt2: cudaResourceViewFormat = 17;
#[doc = "< 4 channel signed 32-bit integers"]
pub const cudaResourceViewFormat_cudaResViewFormatSignedInt4: cudaResourceViewFormat = 18;
#[doc = "< 1 channel 16-bit floating point"]
pub const cudaResourceViewFormat_cudaResViewFormatHalf1: cudaResourceViewFormat = 19;
#[doc = "< 2 channel 16-bit floating point"]
pub const cudaResourceViewFormat_cudaResViewFormatHalf2: cudaResourceViewFormat = 20;
#[doc = "< 4 channel 16-bit floating point"]
pub const cudaResourceViewFormat_cudaResViewFormatHalf4: cudaResourceViewFormat = 21;
#[doc = "< 1 channel 32-bit floating point"]
pub const cudaResourceViewFormat_cudaResViewFormatFloat1: cudaResourceViewFormat = 22;
#[doc = "< 2 channel 32-bit floating point"]
pub const cudaResourceViewFormat_cudaResViewFormatFloat2: cudaResourceViewFormat = 23;
#[doc = "< 4 channel 32-bit floating point"]
pub const cudaResourceViewFormat_cudaResViewFormatFloat4: cudaResourceViewFormat = 24;
#[doc = "< Block compressed 1"]
pub const cudaResourceViewFormat_cudaResViewFormatUnsignedBlockCompressed1: cudaResourceViewFormat =
    25;
#[doc = "< Block compressed 2"]
pub const cudaResourceViewFormat_cudaResViewFormatUnsignedBlockCompressed2: cudaResourceViewFormat =
    26;
#[doc = "< Block compressed 3"]
pub const cudaResourceViewFormat_cudaResViewFormatUnsignedBlockCompressed3: cudaResourceViewFormat =
    27;
#[doc = "< Block compressed 4 unsigned"]
pub const cudaResourceViewFormat_cudaResViewFormatUnsignedBlockCompressed4: cudaResourceViewFormat =
    28;
#[doc = "< Block compressed 4 signed"]
pub const cudaResourceViewFormat_cudaResViewFormatSignedBlockCompressed4: cudaResourceViewFormat =
    29;
#[doc = "< Block compressed 5 unsigned"]
pub const cudaResourceViewFormat_cudaResViewFormatUnsignedBlockCompressed5: cudaResourceViewFormat =
    30;
#[doc = "< Block compressed 5 signed"]
pub const cudaResourceViewFormat_cudaResViewFormatSignedBlockCompressed5: cudaResourceViewFormat =
    31;
#[doc = "< Block compressed 6 unsigned half-float"]
pub const cudaResourceViewFormat_cudaResViewFormatUnsignedBlockCompressed6H:
    cudaResourceViewFormat = 32;
#[doc = "< Block compressed 6 signed half-float"]
pub const cudaResourceViewFormat_cudaResViewFormatSignedBlockCompressed6H: cudaResourceViewFormat =
    33;
#[doc = "< Block compressed 7"]
pub const cudaResourceViewFormat_cudaResViewFormatUnsignedBlockCompressed7: cudaResourceViewFormat =
    34;
#[doc = " CUDA texture resource view formats"]
pub type cudaResourceViewFormat = ::std::os::raw::c_uint;
#[doc = " CUDA resource descriptor"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct cudaResourceDesc {
    #[doc = "< Resource type"]
    pub resType: cudaResourceType,
    pub res: cudaResourceDesc__bindgen_ty_1,
    #[doc = "< Flags (must be zero)"]
    pub flags: ::std::os::raw::c_uint,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union cudaResourceDesc__bindgen_ty_1 {
    pub array: cudaResourceDesc__bindgen_ty_1__bindgen_ty_1,
    pub mipmap: cudaResourceDesc__bindgen_ty_1__bindgen_ty_2,
    pub linear: cudaResourceDesc__bindgen_ty_1__bindgen_ty_3,
    pub pitch2D: cudaResourceDesc__bindgen_ty_1__bindgen_ty_4,
    pub reserved: cudaResourceDesc__bindgen_ty_1__bindgen_ty_5,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaResourceDesc__bindgen_ty_1__bindgen_ty_1 {
    #[doc = "< CUDA array"]
    pub array: cudaArray_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaResourceDesc__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<cudaResourceDesc__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Alignment of cudaResourceDesc__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<cudaResourceDesc__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: cudaResourceDesc__bindgen_ty_1__bindgen_ty_1::array"]
        [::std::mem::offset_of!(cudaResourceDesc__bindgen_ty_1__bindgen_ty_1, array) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaResourceDesc__bindgen_ty_1__bindgen_ty_2 {
    #[doc = "< CUDA mipmapped array"]
    pub mipmap: cudaMipmappedArray_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaResourceDesc__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<cudaResourceDesc__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Alignment of cudaResourceDesc__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<cudaResourceDesc__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Offset of field: cudaResourceDesc__bindgen_ty_1__bindgen_ty_2::mipmap"]
        [::std::mem::offset_of!(cudaResourceDesc__bindgen_ty_1__bindgen_ty_2, mipmap) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaResourceDesc__bindgen_ty_1__bindgen_ty_3 {
    #[doc = "< Device pointer"]
    pub devPtr: *mut ::std::os::raw::c_void,
    #[doc = "< Channel descriptor"]
    pub desc: cudaChannelFormatDesc,
    #[doc = "< Size in bytes"]
    pub sizeInBytes: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaResourceDesc__bindgen_ty_1__bindgen_ty_3"]
        [::std::mem::size_of::<cudaResourceDesc__bindgen_ty_1__bindgen_ty_3>() - 40usize];
    ["Alignment of cudaResourceDesc__bindgen_ty_1__bindgen_ty_3"]
        [::std::mem::align_of::<cudaResourceDesc__bindgen_ty_1__bindgen_ty_3>() - 8usize];
    ["Offset of field: cudaResourceDesc__bindgen_ty_1__bindgen_ty_3::devPtr"]
        [::std::mem::offset_of!(cudaResourceDesc__bindgen_ty_1__bindgen_ty_3, devPtr) - 0usize];
    ["Offset of field: cudaResourceDesc__bindgen_ty_1__bindgen_ty_3::desc"]
        [::std::mem::offset_of!(cudaResourceDesc__bindgen_ty_1__bindgen_ty_3, desc) - 8usize];
    ["Offset of field: cudaResourceDesc__bindgen_ty_1__bindgen_ty_3::sizeInBytes"][::std::mem::offset_of!(
        cudaResourceDesc__bindgen_ty_1__bindgen_ty_3,
        sizeInBytes
    ) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaResourceDesc__bindgen_ty_1__bindgen_ty_4 {
    #[doc = "< Device pointer"]
    pub devPtr: *mut ::std::os::raw::c_void,
    #[doc = "< Channel descriptor"]
    pub desc: cudaChannelFormatDesc,
    #[doc = "< Width of the array in elements"]
    pub width: usize,
    #[doc = "< Height of the array in elements"]
    pub height: usize,
    #[doc = "< Pitch between two rows in bytes"]
    pub pitchInBytes: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaResourceDesc__bindgen_ty_1__bindgen_ty_4"]
        [::std::mem::size_of::<cudaResourceDesc__bindgen_ty_1__bindgen_ty_4>() - 56usize];
    ["Alignment of cudaResourceDesc__bindgen_ty_1__bindgen_ty_4"]
        [::std::mem::align_of::<cudaResourceDesc__bindgen_ty_1__bindgen_ty_4>() - 8usize];
    ["Offset of field: cudaResourceDesc__bindgen_ty_1__bindgen_ty_4::devPtr"]
        [::std::mem::offset_of!(cudaResourceDesc__bindgen_ty_1__bindgen_ty_4, devPtr) - 0usize];
    ["Offset of field: cudaResourceDesc__bindgen_ty_1__bindgen_ty_4::desc"]
        [::std::mem::offset_of!(cudaResourceDesc__bindgen_ty_1__bindgen_ty_4, desc) - 8usize];
    ["Offset of field: cudaResourceDesc__bindgen_ty_1__bindgen_ty_4::width"]
        [::std::mem::offset_of!(cudaResourceDesc__bindgen_ty_1__bindgen_ty_4, width) - 32usize];
    ["Offset of field: cudaResourceDesc__bindgen_ty_1__bindgen_ty_4::height"]
        [::std::mem::offset_of!(cudaResourceDesc__bindgen_ty_1__bindgen_ty_4, height) - 40usize];
    ["Offset of field: cudaResourceDesc__bindgen_ty_1__bindgen_ty_4::pitchInBytes"][::std::mem::offset_of!(
        cudaResourceDesc__bindgen_ty_1__bindgen_ty_4,
        pitchInBytes
    ) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaResourceDesc__bindgen_ty_1__bindgen_ty_5 {
    pub reserved: [::std::os::raw::c_int; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaResourceDesc__bindgen_ty_1__bindgen_ty_5"]
        [::std::mem::size_of::<cudaResourceDesc__bindgen_ty_1__bindgen_ty_5>() - 128usize];
    ["Alignment of cudaResourceDesc__bindgen_ty_1__bindgen_ty_5"]
        [::std::mem::align_of::<cudaResourceDesc__bindgen_ty_1__bindgen_ty_5>() - 4usize];
    ["Offset of field: cudaResourceDesc__bindgen_ty_1__bindgen_ty_5::reserved"]
        [::std::mem::offset_of!(cudaResourceDesc__bindgen_ty_1__bindgen_ty_5, reserved) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaResourceDesc__bindgen_ty_1"]
        [::std::mem::size_of::<cudaResourceDesc__bindgen_ty_1>() - 128usize];
    ["Alignment of cudaResourceDesc__bindgen_ty_1"]
        [::std::mem::align_of::<cudaResourceDesc__bindgen_ty_1>() - 8usize];
    ["Offset of field: cudaResourceDesc__bindgen_ty_1::array"]
        [::std::mem::offset_of!(cudaResourceDesc__bindgen_ty_1, array) - 0usize];
    ["Offset of field: cudaResourceDesc__bindgen_ty_1::mipmap"]
        [::std::mem::offset_of!(cudaResourceDesc__bindgen_ty_1, mipmap) - 0usize];
    ["Offset of field: cudaResourceDesc__bindgen_ty_1::linear"]
        [::std::mem::offset_of!(cudaResourceDesc__bindgen_ty_1, linear) - 0usize];
    ["Offset of field: cudaResourceDesc__bindgen_ty_1::pitch2D"]
        [::std::mem::offset_of!(cudaResourceDesc__bindgen_ty_1, pitch2D) - 0usize];
    ["Offset of field: cudaResourceDesc__bindgen_ty_1::reserved"]
        [::std::mem::offset_of!(cudaResourceDesc__bindgen_ty_1, reserved) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaResourceDesc"][::std::mem::size_of::<cudaResourceDesc>() - 144usize];
    ["Alignment of cudaResourceDesc"][::std::mem::align_of::<cudaResourceDesc>() - 8usize];
    ["Offset of field: cudaResourceDesc::resType"]
        [::std::mem::offset_of!(cudaResourceDesc, resType) - 0usize];
    ["Offset of field: cudaResourceDesc::res"]
        [::std::mem::offset_of!(cudaResourceDesc, res) - 8usize];
    ["Offset of field: cudaResourceDesc::flags"]
        [::std::mem::offset_of!(cudaResourceDesc, flags) - 136usize];
};
#[doc = " CUDA resource view descriptor"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaResourceViewDesc {
    #[doc = "< Resource view format"]
    pub format: cudaResourceViewFormat,
    #[doc = "< Width of the resource view"]
    pub width: usize,
    #[doc = "< Height of the resource view"]
    pub height: usize,
    #[doc = "< Depth of the resource view"]
    pub depth: usize,
    #[doc = "< First defined mipmap level"]
    pub firstMipmapLevel: ::std::os::raw::c_uint,
    #[doc = "< Last defined mipmap level"]
    pub lastMipmapLevel: ::std::os::raw::c_uint,
    #[doc = "< First layer index"]
    pub firstLayer: ::std::os::raw::c_uint,
    #[doc = "< Last layer index"]
    pub lastLayer: ::std::os::raw::c_uint,
    #[doc = "< Must be zero"]
    pub reserved: [::std::os::raw::c_uint; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaResourceViewDesc"][::std::mem::size_of::<cudaResourceViewDesc>() - 112usize];
    ["Alignment of cudaResourceViewDesc"][::std::mem::align_of::<cudaResourceViewDesc>() - 8usize];
    ["Offset of field: cudaResourceViewDesc::format"]
        [::std::mem::offset_of!(cudaResourceViewDesc, format) - 0usize];
    ["Offset of field: cudaResourceViewDesc::width"]
        [::std::mem::offset_of!(cudaResourceViewDesc, width) - 8usize];
    ["Offset of field: cudaResourceViewDesc::height"]
        [::std::mem::offset_of!(cudaResourceViewDesc, height) - 16usize];
    ["Offset of field: cudaResourceViewDesc::depth"]
        [::std::mem::offset_of!(cudaResourceViewDesc, depth) - 24usize];
    ["Offset of field: cudaResourceViewDesc::firstMipmapLevel"]
        [::std::mem::offset_of!(cudaResourceViewDesc, firstMipmapLevel) - 32usize];
    ["Offset of field: cudaResourceViewDesc::lastMipmapLevel"]
        [::std::mem::offset_of!(cudaResourceViewDesc, lastMipmapLevel) - 36usize];
    ["Offset of field: cudaResourceViewDesc::firstLayer"]
        [::std::mem::offset_of!(cudaResourceViewDesc, firstLayer) - 40usize];
    ["Offset of field: cudaResourceViewDesc::lastLayer"]
        [::std::mem::offset_of!(cudaResourceViewDesc, lastLayer) - 44usize];
    ["Offset of field: cudaResourceViewDesc::reserved"]
        [::std::mem::offset_of!(cudaResourceViewDesc, reserved) - 48usize];
};
#[doc = " CUDA pointer attributes"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaPointerAttributes {
    #[doc = " The type of memory - ::cudaMemoryTypeUnregistered, ::cudaMemoryTypeHost,\n ::cudaMemoryTypeDevice or ::cudaMemoryTypeManaged."]
    pub type_: cudaMemoryType,
    #[doc = " The device against which the memory was allocated or registered.\n If the memory type is ::cudaMemoryTypeDevice then this identifies\n the device on which the memory referred physically resides.  If\n the memory type is ::cudaMemoryTypeHost or::cudaMemoryTypeManaged then\n this identifies the device which was current when the memory was allocated\n or registered (and if that device is deinitialized then this allocation\n will vanish with that device's state)."]
    pub device: ::std::os::raw::c_int,
    #[doc = " The address which may be dereferenced on the current device to access\n the memory or NULL if no such address exists."]
    pub devicePointer: *mut ::std::os::raw::c_void,
    #[doc = " The address which may be dereferenced on the host to access the\n memory or NULL if no such address exists.\n\n \\note CUDA doesn't check if unregistered memory is allocated so this field\n may contain invalid pointer if an invalid pointer has been passed to CUDA."]
    pub hostPointer: *mut ::std::os::raw::c_void,
    #[doc = " Must be zero"]
    pub reserved: [::std::os::raw::c_long; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaPointerAttributes"][::std::mem::size_of::<cudaPointerAttributes>() - 88usize];
    ["Alignment of cudaPointerAttributes"]
        [::std::mem::align_of::<cudaPointerAttributes>() - 8usize];
    ["Offset of field: cudaPointerAttributes::type_"]
        [::std::mem::offset_of!(cudaPointerAttributes, type_) - 0usize];
    ["Offset of field: cudaPointerAttributes::device"]
        [::std::mem::offset_of!(cudaPointerAttributes, device) - 4usize];
    ["Offset of field: cudaPointerAttributes::devicePointer"]
        [::std::mem::offset_of!(cudaPointerAttributes, devicePointer) - 8usize];
    ["Offset of field: cudaPointerAttributes::hostPointer"]
        [::std::mem::offset_of!(cudaPointerAttributes, hostPointer) - 16usize];
    ["Offset of field: cudaPointerAttributes::reserved"]
        [::std::mem::offset_of!(cudaPointerAttributes, reserved) - 24usize];
};
#[doc = " CUDA function attributes"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaFuncAttributes {
    #[doc = " The size in bytes of statically-allocated shared memory per block\n required by this function. This does not include dynamically-allocated\n shared memory requested by the user at runtime."]
    pub sharedSizeBytes: usize,
    #[doc = " The size in bytes of user-allocated constant memory required by this\n function."]
    pub constSizeBytes: usize,
    #[doc = " The size in bytes of local memory used by each thread of this function."]
    pub localSizeBytes: usize,
    #[doc = " The maximum number of threads per block, beyond which a launch of the\n function would fail. This number depends on both the function and the\n device on which the function is currently loaded."]
    pub maxThreadsPerBlock: ::std::os::raw::c_int,
    #[doc = " The number of registers used by each thread of this function."]
    pub numRegs: ::std::os::raw::c_int,
    #[doc = " The PTX virtual architecture version for which the function was\n compiled. This value is the major PTX version * 10 + the minor PTX\n version, so a PTX version 1.3 function would return the value 13."]
    pub ptxVersion: ::std::os::raw::c_int,
    #[doc = " The binary architecture version for which the function was compiled.\n This value is the major binary version * 10 + the minor binary version,\n so a binary version 1.3 function would return the value 13."]
    pub binaryVersion: ::std::os::raw::c_int,
    #[doc = " The attribute to indicate whether the function has been compiled with\n user specified option \"-Xptxas --dlcm=ca\" set."]
    pub cacheModeCA: ::std::os::raw::c_int,
    #[doc = " The maximum size in bytes of dynamic shared memory per block for\n this function. Any launch must have a dynamic shared memory size\n smaller than this value."]
    pub maxDynamicSharedSizeBytes: ::std::os::raw::c_int,
    #[doc = " On devices where the L1 cache and shared memory use the same hardware resources,\n this sets the shared memory carveout preference, in percent of the maximum shared memory.\n Refer to ::cudaDevAttrMaxSharedMemoryPerMultiprocessor.\n This is only a hint, and the driver can choose a different ratio if required to execute the function.\n See ::cudaFuncSetAttribute"]
    pub preferredShmemCarveout: ::std::os::raw::c_int,
    #[doc = " If this attribute is set, the kernel must launch with a valid cluster dimension\n specified."]
    pub clusterDimMustBeSet: ::std::os::raw::c_int,
    #[doc = " The required cluster width/height/depth in blocks. The values must either\n all be 0 or all be positive. The validity of the cluster dimensions is\n otherwise checked at launch time.\n\n If the value is set during compile time, it cannot be set at runtime.\n Setting it at runtime should return cudaErrorNotPermitted.\n See ::cudaFuncSetAttribute"]
    pub requiredClusterWidth: ::std::os::raw::c_int,
    pub requiredClusterHeight: ::std::os::raw::c_int,
    pub requiredClusterDepth: ::std::os::raw::c_int,
    #[doc = " The block scheduling policy of a function.\n See ::cudaFuncSetAttribute"]
    pub clusterSchedulingPolicyPreference: ::std::os::raw::c_int,
    #[doc = " Whether the function can be launched with non-portable cluster size. 1 is\n allowed, 0 is disallowed. A non-portable cluster size may only function\n on the specific SKUs the program is tested on. The launch might fail if\n the program is run on a different hardware platform.\n\n CUDA API provides ::cudaOccupancyMaxActiveClusters to assist with checking\n whether the desired size can be launched on the current device.\n\n Portable Cluster Size\n\n A portable cluster size is guaranteed to be functional on all compute\n capabilities higher than the target compute capability. The portable\n cluster size for sm_90 is 8 blocks per cluster. This value may increase\n for future compute capabilities.\n\n The specific hardware unit may support higher cluster sizes thats not\n guaranteed to be portable.\n See ::cudaFuncSetAttribute"]
    pub nonPortableClusterSizeAllowed: ::std::os::raw::c_int,
    #[doc = " Reserved for future use."]
    pub reserved: [::std::os::raw::c_int; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaFuncAttributes"][::std::mem::size_of::<cudaFuncAttributes>() - 144usize];
    ["Alignment of cudaFuncAttributes"][::std::mem::align_of::<cudaFuncAttributes>() - 8usize];
    ["Offset of field: cudaFuncAttributes::sharedSizeBytes"]
        [::std::mem::offset_of!(cudaFuncAttributes, sharedSizeBytes) - 0usize];
    ["Offset of field: cudaFuncAttributes::constSizeBytes"]
        [::std::mem::offset_of!(cudaFuncAttributes, constSizeBytes) - 8usize];
    ["Offset of field: cudaFuncAttributes::localSizeBytes"]
        [::std::mem::offset_of!(cudaFuncAttributes, localSizeBytes) - 16usize];
    ["Offset of field: cudaFuncAttributes::maxThreadsPerBlock"]
        [::std::mem::offset_of!(cudaFuncAttributes, maxThreadsPerBlock) - 24usize];
    ["Offset of field: cudaFuncAttributes::numRegs"]
        [::std::mem::offset_of!(cudaFuncAttributes, numRegs) - 28usize];
    ["Offset of field: cudaFuncAttributes::ptxVersion"]
        [::std::mem::offset_of!(cudaFuncAttributes, ptxVersion) - 32usize];
    ["Offset of field: cudaFuncAttributes::binaryVersion"]
        [::std::mem::offset_of!(cudaFuncAttributes, binaryVersion) - 36usize];
    ["Offset of field: cudaFuncAttributes::cacheModeCA"]
        [::std::mem::offset_of!(cudaFuncAttributes, cacheModeCA) - 40usize];
    ["Offset of field: cudaFuncAttributes::maxDynamicSharedSizeBytes"]
        [::std::mem::offset_of!(cudaFuncAttributes, maxDynamicSharedSizeBytes) - 44usize];
    ["Offset of field: cudaFuncAttributes::preferredShmemCarveout"]
        [::std::mem::offset_of!(cudaFuncAttributes, preferredShmemCarveout) - 48usize];
    ["Offset of field: cudaFuncAttributes::clusterDimMustBeSet"]
        [::std::mem::offset_of!(cudaFuncAttributes, clusterDimMustBeSet) - 52usize];
    ["Offset of field: cudaFuncAttributes::requiredClusterWidth"]
        [::std::mem::offset_of!(cudaFuncAttributes, requiredClusterWidth) - 56usize];
    ["Offset of field: cudaFuncAttributes::requiredClusterHeight"]
        [::std::mem::offset_of!(cudaFuncAttributes, requiredClusterHeight) - 60usize];
    ["Offset of field: cudaFuncAttributes::requiredClusterDepth"]
        [::std::mem::offset_of!(cudaFuncAttributes, requiredClusterDepth) - 64usize];
    ["Offset of field: cudaFuncAttributes::clusterSchedulingPolicyPreference"]
        [::std::mem::offset_of!(cudaFuncAttributes, clusterSchedulingPolicyPreference) - 68usize];
    ["Offset of field: cudaFuncAttributes::nonPortableClusterSizeAllowed"]
        [::std::mem::offset_of!(cudaFuncAttributes, nonPortableClusterSizeAllowed) - 72usize];
    ["Offset of field: cudaFuncAttributes::reserved"]
        [::std::mem::offset_of!(cudaFuncAttributes, reserved) - 76usize];
};
#[doc = "< Maximum dynamic shared memory size"]
pub const cudaFuncAttribute_cudaFuncAttributeMaxDynamicSharedMemorySize: cudaFuncAttribute = 8;
#[doc = "< Preferred shared memory-L1 cache split"]
pub const cudaFuncAttribute_cudaFuncAttributePreferredSharedMemoryCarveout: cudaFuncAttribute = 9;
#[doc = "< Indicator to enforce valid cluster dimension specification on kernel launch"]
pub const cudaFuncAttribute_cudaFuncAttributeClusterDimMustBeSet: cudaFuncAttribute = 10;
#[doc = "< Required cluster width"]
pub const cudaFuncAttribute_cudaFuncAttributeRequiredClusterWidth: cudaFuncAttribute = 11;
#[doc = "< Required cluster height"]
pub const cudaFuncAttribute_cudaFuncAttributeRequiredClusterHeight: cudaFuncAttribute = 12;
#[doc = "< Required cluster depth"]
pub const cudaFuncAttribute_cudaFuncAttributeRequiredClusterDepth: cudaFuncAttribute = 13;
#[doc = "< Whether non-portable cluster scheduling policy is supported"]
pub const cudaFuncAttribute_cudaFuncAttributeNonPortableClusterSizeAllowed: cudaFuncAttribute = 14;
#[doc = "< Required cluster scheduling policy preference"]
pub const cudaFuncAttribute_cudaFuncAttributeClusterSchedulingPolicyPreference: cudaFuncAttribute =
    15;
pub const cudaFuncAttribute_cudaFuncAttributeMax: cudaFuncAttribute = 16;
#[doc = " CUDA function attributes that can be set using ::cudaFuncSetAttribute"]
pub type cudaFuncAttribute = ::std::os::raw::c_uint;
#[doc = "< Default function cache configuration, no preference"]
pub const cudaFuncCache_cudaFuncCachePreferNone: cudaFuncCache = 0;
#[doc = "< Prefer larger shared memory and smaller L1 cache"]
pub const cudaFuncCache_cudaFuncCachePreferShared: cudaFuncCache = 1;
#[doc = "< Prefer larger L1 cache and smaller shared memory"]
pub const cudaFuncCache_cudaFuncCachePreferL1: cudaFuncCache = 2;
#[doc = "< Prefer equal size L1 cache and shared memory"]
pub const cudaFuncCache_cudaFuncCachePreferEqual: cudaFuncCache = 3;
#[doc = " CUDA function cache configurations"]
pub type cudaFuncCache = ::std::os::raw::c_uint;
pub const cudaSharedMemConfig_cudaSharedMemBankSizeDefault: cudaSharedMemConfig = 0;
pub const cudaSharedMemConfig_cudaSharedMemBankSizeFourByte: cudaSharedMemConfig = 1;
pub const cudaSharedMemConfig_cudaSharedMemBankSizeEightByte: cudaSharedMemConfig = 2;
#[doc = " CUDA shared memory configuration\n \\deprecated"]
pub type cudaSharedMemConfig = ::std::os::raw::c_uint;
#[doc = "< No preference for shared memory or L1 (default)"]
pub const cudaSharedCarveout_cudaSharedmemCarveoutDefault: cudaSharedCarveout = -1;
#[doc = "< Prefer maximum available shared memory, minimum L1 cache"]
pub const cudaSharedCarveout_cudaSharedmemCarveoutMaxShared: cudaSharedCarveout = 100;
#[doc = "< Prefer maximum available L1 cache, minimum shared memory"]
pub const cudaSharedCarveout_cudaSharedmemCarveoutMaxL1: cudaSharedCarveout = 0;
#[doc = " Shared memory carveout configurations. These may be passed to cudaFuncSetAttribute"]
pub type cudaSharedCarveout = ::std::os::raw::c_int;
#[doc = "< Default compute mode (Multiple threads can use ::cudaSetDevice() with this device)"]
pub const cudaComputeMode_cudaComputeModeDefault: cudaComputeMode = 0;
#[doc = "< Compute-exclusive-thread mode (Only one thread in one process will be able to use ::cudaSetDevice() with this device)"]
pub const cudaComputeMode_cudaComputeModeExclusive: cudaComputeMode = 1;
#[doc = "< Compute-prohibited mode (No threads can use ::cudaSetDevice() with this device)"]
pub const cudaComputeMode_cudaComputeModeProhibited: cudaComputeMode = 2;
#[doc = "< Compute-exclusive-process mode (Many threads in one process will be able to use ::cudaSetDevice() with this device)"]
pub const cudaComputeMode_cudaComputeModeExclusiveProcess: cudaComputeMode = 3;
#[doc = " CUDA device compute modes"]
pub type cudaComputeMode = ::std::os::raw::c_uint;
#[doc = "< GPU thread stack size"]
pub const cudaLimit_cudaLimitStackSize: cudaLimit = 0;
#[doc = "< GPU printf FIFO size"]
pub const cudaLimit_cudaLimitPrintfFifoSize: cudaLimit = 1;
#[doc = "< GPU malloc heap size"]
pub const cudaLimit_cudaLimitMallocHeapSize: cudaLimit = 2;
#[doc = "< GPU device runtime synchronize depth"]
pub const cudaLimit_cudaLimitDevRuntimeSyncDepth: cudaLimit = 3;
#[doc = "< GPU device runtime pending launch count"]
pub const cudaLimit_cudaLimitDevRuntimePendingLaunchCount: cudaLimit = 4;
#[doc = "< A value between 0 and 128 that indicates the maximum fetch granularity of L2 (in Bytes). This is a hint"]
pub const cudaLimit_cudaLimitMaxL2FetchGranularity: cudaLimit = 5;
#[doc = "< A size in bytes for L2 persisting lines cache size"]
pub const cudaLimit_cudaLimitPersistingL2CacheSize: cudaLimit = 6;
#[doc = " CUDA Limits"]
pub type cudaLimit = ::std::os::raw::c_uint;
#[doc = "< Data will mostly be read and only occassionally be written to"]
pub const cudaMemoryAdvise_cudaMemAdviseSetReadMostly: cudaMemoryAdvise = 1;
#[doc = "< Undo the effect of ::cudaMemAdviseSetReadMostly"]
pub const cudaMemoryAdvise_cudaMemAdviseUnsetReadMostly: cudaMemoryAdvise = 2;
#[doc = "< Set the preferred location for the data as the specified device"]
pub const cudaMemoryAdvise_cudaMemAdviseSetPreferredLocation: cudaMemoryAdvise = 3;
#[doc = "< Clear the preferred location for the data"]
pub const cudaMemoryAdvise_cudaMemAdviseUnsetPreferredLocation: cudaMemoryAdvise = 4;
#[doc = "< Data will be accessed by the specified device, so prevent page faults as much as possible"]
pub const cudaMemoryAdvise_cudaMemAdviseSetAccessedBy: cudaMemoryAdvise = 5;
#[doc = "< Let the Unified Memory subsystem decide on the page faulting policy for the specified device"]
pub const cudaMemoryAdvise_cudaMemAdviseUnsetAccessedBy: cudaMemoryAdvise = 6;
#[doc = " CUDA Memory Advise values"]
pub type cudaMemoryAdvise = ::std::os::raw::c_uint;
#[doc = "< Whether the range will mostly be read and only occassionally be written to"]
pub const cudaMemRangeAttribute_cudaMemRangeAttributeReadMostly: cudaMemRangeAttribute = 1;
#[doc = "< The preferred location of the range"]
pub const cudaMemRangeAttribute_cudaMemRangeAttributePreferredLocation: cudaMemRangeAttribute = 2;
#[doc = "< Memory range has ::cudaMemAdviseSetAccessedBy set for specified device"]
pub const cudaMemRangeAttribute_cudaMemRangeAttributeAccessedBy: cudaMemRangeAttribute = 3;
#[doc = "< The last location to which the range was prefetched"]
pub const cudaMemRangeAttribute_cudaMemRangeAttributeLastPrefetchLocation: cudaMemRangeAttribute =
    4;
#[doc = "< The preferred location type of the range"]
pub const cudaMemRangeAttribute_cudaMemRangeAttributePreferredLocationType: cudaMemRangeAttribute =
    5;
#[doc = "< The preferred location id of the range"]
pub const cudaMemRangeAttribute_cudaMemRangeAttributePreferredLocationId: cudaMemRangeAttribute = 6;
#[doc = "< The last location type to which the range was prefetched"]
pub const cudaMemRangeAttribute_cudaMemRangeAttributeLastPrefetchLocationType:
    cudaMemRangeAttribute = 7;
#[doc = "< The last location id to which the range was prefetched"]
pub const cudaMemRangeAttribute_cudaMemRangeAttributeLastPrefetchLocationId: cudaMemRangeAttribute =
    8;
#[doc = " CUDA range attributes"]
pub type cudaMemRangeAttribute = ::std::os::raw::c_uint;
#[doc = "< ::cudaDeviceFlushGPUDirectRDMAWrites() and its CUDA Driver API counterpart are supported on the device."]
pub const cudaFlushGPUDirectRDMAWritesOptions_cudaFlushGPUDirectRDMAWritesOptionHost:
    cudaFlushGPUDirectRDMAWritesOptions = 1;
#[doc = "< The ::CU_STREAM_WAIT_VALUE_FLUSH flag and the ::CU_STREAM_MEM_OP_FLUSH_REMOTE_WRITES MemOp are supported on the CUDA device."]
pub const cudaFlushGPUDirectRDMAWritesOptions_cudaFlushGPUDirectRDMAWritesOptionMemOps:
    cudaFlushGPUDirectRDMAWritesOptions = 2;
#[doc = " CUDA GPUDirect RDMA flush writes APIs supported on the device"]
pub type cudaFlushGPUDirectRDMAWritesOptions = ::std::os::raw::c_uint;
#[doc = "< The device does not natively support ordering of GPUDirect RDMA writes. ::cudaFlushGPUDirectRDMAWrites() can be leveraged if supported."]
pub const cudaGPUDirectRDMAWritesOrdering_cudaGPUDirectRDMAWritesOrderingNone:
    cudaGPUDirectRDMAWritesOrdering = 0;
#[doc = "< Natively, the device can consistently consume GPUDirect RDMA writes, although other CUDA devices may not."]
pub const cudaGPUDirectRDMAWritesOrdering_cudaGPUDirectRDMAWritesOrderingOwner:
    cudaGPUDirectRDMAWritesOrdering = 100;
#[doc = "< Any CUDA device in the system can consistently consume GPUDirect RDMA writes to this device."]
pub const cudaGPUDirectRDMAWritesOrdering_cudaGPUDirectRDMAWritesOrderingAllDevices:
    cudaGPUDirectRDMAWritesOrdering = 200;
#[doc = " CUDA GPUDirect RDMA flush writes ordering features of the device"]
pub type cudaGPUDirectRDMAWritesOrdering = ::std::os::raw::c_uint;
#[doc = "< Blocks until remote writes are visible to the CUDA device context owning the data."]
pub const cudaFlushGPUDirectRDMAWritesScope_cudaFlushGPUDirectRDMAWritesToOwner:
    cudaFlushGPUDirectRDMAWritesScope = 100;
#[doc = "< Blocks until remote writes are visible to all CUDA device contexts."]
pub const cudaFlushGPUDirectRDMAWritesScope_cudaFlushGPUDirectRDMAWritesToAllDevices:
    cudaFlushGPUDirectRDMAWritesScope = 200;
#[doc = " CUDA GPUDirect RDMA flush writes scopes"]
pub type cudaFlushGPUDirectRDMAWritesScope = ::std::os::raw::c_uint;
#[doc = "< Sets the target for ::cudaDeviceFlushGPUDirectRDMAWrites() to the currently active CUDA device context."]
pub const cudaFlushGPUDirectRDMAWritesTarget_cudaFlushGPUDirectRDMAWritesTargetCurrentDevice:
    cudaFlushGPUDirectRDMAWritesTarget = 0;
#[doc = " CUDA GPUDirect RDMA flush writes targets"]
pub type cudaFlushGPUDirectRDMAWritesTarget = ::std::os::raw::c_uint;
#[doc = "< Maximum number of threads per block"]
pub const cudaDeviceAttr_cudaDevAttrMaxThreadsPerBlock: cudaDeviceAttr = 1;
#[doc = "< Maximum block dimension X"]
pub const cudaDeviceAttr_cudaDevAttrMaxBlockDimX: cudaDeviceAttr = 2;
#[doc = "< Maximum block dimension Y"]
pub const cudaDeviceAttr_cudaDevAttrMaxBlockDimY: cudaDeviceAttr = 3;
#[doc = "< Maximum block dimension Z"]
pub const cudaDeviceAttr_cudaDevAttrMaxBlockDimZ: cudaDeviceAttr = 4;
#[doc = "< Maximum grid dimension X"]
pub const cudaDeviceAttr_cudaDevAttrMaxGridDimX: cudaDeviceAttr = 5;
#[doc = "< Maximum grid dimension Y"]
pub const cudaDeviceAttr_cudaDevAttrMaxGridDimY: cudaDeviceAttr = 6;
#[doc = "< Maximum grid dimension Z"]
pub const cudaDeviceAttr_cudaDevAttrMaxGridDimZ: cudaDeviceAttr = 7;
#[doc = "< Maximum shared memory available per block in bytes"]
pub const cudaDeviceAttr_cudaDevAttrMaxSharedMemoryPerBlock: cudaDeviceAttr = 8;
#[doc = "< Memory available on device for __constant__ variables in a CUDA C kernel in bytes"]
pub const cudaDeviceAttr_cudaDevAttrTotalConstantMemory: cudaDeviceAttr = 9;
#[doc = "< Warp size in threads"]
pub const cudaDeviceAttr_cudaDevAttrWarpSize: cudaDeviceAttr = 10;
#[doc = "< Maximum pitch in bytes allowed by memory copies"]
pub const cudaDeviceAttr_cudaDevAttrMaxPitch: cudaDeviceAttr = 11;
#[doc = "< Maximum number of 32-bit registers available per block"]
pub const cudaDeviceAttr_cudaDevAttrMaxRegistersPerBlock: cudaDeviceAttr = 12;
#[doc = "< Peak clock frequency in kilohertz"]
pub const cudaDeviceAttr_cudaDevAttrClockRate: cudaDeviceAttr = 13;
#[doc = "< Alignment requirement for textures"]
pub const cudaDeviceAttr_cudaDevAttrTextureAlignment: cudaDeviceAttr = 14;
#[doc = "< Device can possibly copy memory and execute a kernel concurrently"]
pub const cudaDeviceAttr_cudaDevAttrGpuOverlap: cudaDeviceAttr = 15;
#[doc = "< Number of multiprocessors on device"]
pub const cudaDeviceAttr_cudaDevAttrMultiProcessorCount: cudaDeviceAttr = 16;
#[doc = "< Specifies whether there is a run time limit on kernels"]
pub const cudaDeviceAttr_cudaDevAttrKernelExecTimeout: cudaDeviceAttr = 17;
#[doc = "< Device is integrated with host memory"]
pub const cudaDeviceAttr_cudaDevAttrIntegrated: cudaDeviceAttr = 18;
#[doc = "< Device can map host memory into CUDA address space"]
pub const cudaDeviceAttr_cudaDevAttrCanMapHostMemory: cudaDeviceAttr = 19;
#[doc = "< Compute mode (See ::cudaComputeMode for details)"]
pub const cudaDeviceAttr_cudaDevAttrComputeMode: cudaDeviceAttr = 20;
#[doc = "< Maximum 1D texture width"]
pub const cudaDeviceAttr_cudaDevAttrMaxTexture1DWidth: cudaDeviceAttr = 21;
#[doc = "< Maximum 2D texture width"]
pub const cudaDeviceAttr_cudaDevAttrMaxTexture2DWidth: cudaDeviceAttr = 22;
#[doc = "< Maximum 2D texture height"]
pub const cudaDeviceAttr_cudaDevAttrMaxTexture2DHeight: cudaDeviceAttr = 23;
#[doc = "< Maximum 3D texture width"]
pub const cudaDeviceAttr_cudaDevAttrMaxTexture3DWidth: cudaDeviceAttr = 24;
#[doc = "< Maximum 3D texture height"]
pub const cudaDeviceAttr_cudaDevAttrMaxTexture3DHeight: cudaDeviceAttr = 25;
#[doc = "< Maximum 3D texture depth"]
pub const cudaDeviceAttr_cudaDevAttrMaxTexture3DDepth: cudaDeviceAttr = 26;
#[doc = "< Maximum 2D layered texture width"]
pub const cudaDeviceAttr_cudaDevAttrMaxTexture2DLayeredWidth: cudaDeviceAttr = 27;
#[doc = "< Maximum 2D layered texture height"]
pub const cudaDeviceAttr_cudaDevAttrMaxTexture2DLayeredHeight: cudaDeviceAttr = 28;
#[doc = "< Maximum layers in a 2D layered texture"]
pub const cudaDeviceAttr_cudaDevAttrMaxTexture2DLayeredLayers: cudaDeviceAttr = 29;
#[doc = "< Alignment requirement for surfaces"]
pub const cudaDeviceAttr_cudaDevAttrSurfaceAlignment: cudaDeviceAttr = 30;
#[doc = "< Device can possibly execute multiple kernels concurrently"]
pub const cudaDeviceAttr_cudaDevAttrConcurrentKernels: cudaDeviceAttr = 31;
#[doc = "< Device has ECC support enabled"]
pub const cudaDeviceAttr_cudaDevAttrEccEnabled: cudaDeviceAttr = 32;
#[doc = "< PCI bus ID of the device"]
pub const cudaDeviceAttr_cudaDevAttrPciBusId: cudaDeviceAttr = 33;
#[doc = "< PCI device ID of the device"]
pub const cudaDeviceAttr_cudaDevAttrPciDeviceId: cudaDeviceAttr = 34;
#[doc = "< Device is using TCC driver model"]
pub const cudaDeviceAttr_cudaDevAttrTccDriver: cudaDeviceAttr = 35;
#[doc = "< Peak memory clock frequency in kilohertz"]
pub const cudaDeviceAttr_cudaDevAttrMemoryClockRate: cudaDeviceAttr = 36;
#[doc = "< Global memory bus width in bits"]
pub const cudaDeviceAttr_cudaDevAttrGlobalMemoryBusWidth: cudaDeviceAttr = 37;
#[doc = "< Size of L2 cache in bytes"]
pub const cudaDeviceAttr_cudaDevAttrL2CacheSize: cudaDeviceAttr = 38;
#[doc = "< Maximum resident threads per multiprocessor"]
pub const cudaDeviceAttr_cudaDevAttrMaxThreadsPerMultiProcessor: cudaDeviceAttr = 39;
#[doc = "< Number of asynchronous engines"]
pub const cudaDeviceAttr_cudaDevAttrAsyncEngineCount: cudaDeviceAttr = 40;
#[doc = "< Device shares a unified address space with the host"]
pub const cudaDeviceAttr_cudaDevAttrUnifiedAddressing: cudaDeviceAttr = 41;
#[doc = "< Maximum 1D layered texture width"]
pub const cudaDeviceAttr_cudaDevAttrMaxTexture1DLayeredWidth: cudaDeviceAttr = 42;
#[doc = "< Maximum layers in a 1D layered texture"]
pub const cudaDeviceAttr_cudaDevAttrMaxTexture1DLayeredLayers: cudaDeviceAttr = 43;
#[doc = "< Maximum 2D texture width if cudaArrayTextureGather is set"]
pub const cudaDeviceAttr_cudaDevAttrMaxTexture2DGatherWidth: cudaDeviceAttr = 45;
#[doc = "< Maximum 2D texture height if cudaArrayTextureGather is set"]
pub const cudaDeviceAttr_cudaDevAttrMaxTexture2DGatherHeight: cudaDeviceAttr = 46;
#[doc = "< Alternate maximum 3D texture width"]
pub const cudaDeviceAttr_cudaDevAttrMaxTexture3DWidthAlt: cudaDeviceAttr = 47;
#[doc = "< Alternate maximum 3D texture height"]
pub const cudaDeviceAttr_cudaDevAttrMaxTexture3DHeightAlt: cudaDeviceAttr = 48;
#[doc = "< Alternate maximum 3D texture depth"]
pub const cudaDeviceAttr_cudaDevAttrMaxTexture3DDepthAlt: cudaDeviceAttr = 49;
#[doc = "< PCI domain ID of the device"]
pub const cudaDeviceAttr_cudaDevAttrPciDomainId: cudaDeviceAttr = 50;
#[doc = "< Pitch alignment requirement for textures"]
pub const cudaDeviceAttr_cudaDevAttrTexturePitchAlignment: cudaDeviceAttr = 51;
#[doc = "< Maximum cubemap texture width/height"]
pub const cudaDeviceAttr_cudaDevAttrMaxTextureCubemapWidth: cudaDeviceAttr = 52;
#[doc = "< Maximum cubemap layered texture width/height"]
pub const cudaDeviceAttr_cudaDevAttrMaxTextureCubemapLayeredWidth: cudaDeviceAttr = 53;
#[doc = "< Maximum layers in a cubemap layered texture"]
pub const cudaDeviceAttr_cudaDevAttrMaxTextureCubemapLayeredLayers: cudaDeviceAttr = 54;
#[doc = "< Maximum 1D surface width"]
pub const cudaDeviceAttr_cudaDevAttrMaxSurface1DWidth: cudaDeviceAttr = 55;
#[doc = "< Maximum 2D surface width"]
pub const cudaDeviceAttr_cudaDevAttrMaxSurface2DWidth: cudaDeviceAttr = 56;
#[doc = "< Maximum 2D surface height"]
pub const cudaDeviceAttr_cudaDevAttrMaxSurface2DHeight: cudaDeviceAttr = 57;
#[doc = "< Maximum 3D surface width"]
pub const cudaDeviceAttr_cudaDevAttrMaxSurface3DWidth: cudaDeviceAttr = 58;
#[doc = "< Maximum 3D surface height"]
pub const cudaDeviceAttr_cudaDevAttrMaxSurface3DHeight: cudaDeviceAttr = 59;
#[doc = "< Maximum 3D surface depth"]
pub const cudaDeviceAttr_cudaDevAttrMaxSurface3DDepth: cudaDeviceAttr = 60;
#[doc = "< Maximum 1D layered surface width"]
pub const cudaDeviceAttr_cudaDevAttrMaxSurface1DLayeredWidth: cudaDeviceAttr = 61;
#[doc = "< Maximum layers in a 1D layered surface"]
pub const cudaDeviceAttr_cudaDevAttrMaxSurface1DLayeredLayers: cudaDeviceAttr = 62;
#[doc = "< Maximum 2D layered surface width"]
pub const cudaDeviceAttr_cudaDevAttrMaxSurface2DLayeredWidth: cudaDeviceAttr = 63;
#[doc = "< Maximum 2D layered surface height"]
pub const cudaDeviceAttr_cudaDevAttrMaxSurface2DLayeredHeight: cudaDeviceAttr = 64;
#[doc = "< Maximum layers in a 2D layered surface"]
pub const cudaDeviceAttr_cudaDevAttrMaxSurface2DLayeredLayers: cudaDeviceAttr = 65;
#[doc = "< Maximum cubemap surface width"]
pub const cudaDeviceAttr_cudaDevAttrMaxSurfaceCubemapWidth: cudaDeviceAttr = 66;
#[doc = "< Maximum cubemap layered surface width"]
pub const cudaDeviceAttr_cudaDevAttrMaxSurfaceCubemapLayeredWidth: cudaDeviceAttr = 67;
#[doc = "< Maximum layers in a cubemap layered surface"]
pub const cudaDeviceAttr_cudaDevAttrMaxSurfaceCubemapLayeredLayers: cudaDeviceAttr = 68;
#[doc = "< Maximum 1D linear texture width"]
pub const cudaDeviceAttr_cudaDevAttrMaxTexture1DLinearWidth: cudaDeviceAttr = 69;
#[doc = "< Maximum 2D linear texture width"]
pub const cudaDeviceAttr_cudaDevAttrMaxTexture2DLinearWidth: cudaDeviceAttr = 70;
#[doc = "< Maximum 2D linear texture height"]
pub const cudaDeviceAttr_cudaDevAttrMaxTexture2DLinearHeight: cudaDeviceAttr = 71;
#[doc = "< Maximum 2D linear texture pitch in bytes"]
pub const cudaDeviceAttr_cudaDevAttrMaxTexture2DLinearPitch: cudaDeviceAttr = 72;
#[doc = "< Maximum mipmapped 2D texture width"]
pub const cudaDeviceAttr_cudaDevAttrMaxTexture2DMipmappedWidth: cudaDeviceAttr = 73;
#[doc = "< Maximum mipmapped 2D texture height"]
pub const cudaDeviceAttr_cudaDevAttrMaxTexture2DMipmappedHeight: cudaDeviceAttr = 74;
#[doc = "< Major compute capability version number"]
pub const cudaDeviceAttr_cudaDevAttrComputeCapabilityMajor: cudaDeviceAttr = 75;
#[doc = "< Minor compute capability version number"]
pub const cudaDeviceAttr_cudaDevAttrComputeCapabilityMinor: cudaDeviceAttr = 76;
#[doc = "< Maximum mipmapped 1D texture width"]
pub const cudaDeviceAttr_cudaDevAttrMaxTexture1DMipmappedWidth: cudaDeviceAttr = 77;
#[doc = "< Device supports stream priorities"]
pub const cudaDeviceAttr_cudaDevAttrStreamPrioritiesSupported: cudaDeviceAttr = 78;
#[doc = "< Device supports caching globals in L1"]
pub const cudaDeviceAttr_cudaDevAttrGlobalL1CacheSupported: cudaDeviceAttr = 79;
#[doc = "< Device supports caching locals in L1"]
pub const cudaDeviceAttr_cudaDevAttrLocalL1CacheSupported: cudaDeviceAttr = 80;
#[doc = "< Maximum shared memory available per multiprocessor in bytes"]
pub const cudaDeviceAttr_cudaDevAttrMaxSharedMemoryPerMultiprocessor: cudaDeviceAttr = 81;
#[doc = "< Maximum number of 32-bit registers available per multiprocessor"]
pub const cudaDeviceAttr_cudaDevAttrMaxRegistersPerMultiprocessor: cudaDeviceAttr = 82;
#[doc = "< Device can allocate managed memory on this system"]
pub const cudaDeviceAttr_cudaDevAttrManagedMemory: cudaDeviceAttr = 83;
#[doc = "< Device is on a multi-GPU board"]
pub const cudaDeviceAttr_cudaDevAttrIsMultiGpuBoard: cudaDeviceAttr = 84;
#[doc = "< Unique identifier for a group of devices on the same multi-GPU board"]
pub const cudaDeviceAttr_cudaDevAttrMultiGpuBoardGroupID: cudaDeviceAttr = 85;
#[doc = "< Link between the device and the host supports native atomic operations"]
pub const cudaDeviceAttr_cudaDevAttrHostNativeAtomicSupported: cudaDeviceAttr = 86;
#[doc = "< Ratio of single precision performance (in floating-point operations per second) to double precision performance"]
pub const cudaDeviceAttr_cudaDevAttrSingleToDoublePrecisionPerfRatio: cudaDeviceAttr = 87;
#[doc = "< Device supports coherently accessing pageable memory without calling cudaHostRegister on it"]
pub const cudaDeviceAttr_cudaDevAttrPageableMemoryAccess: cudaDeviceAttr = 88;
#[doc = "< Device can coherently access managed memory concurrently with the CPU"]
pub const cudaDeviceAttr_cudaDevAttrConcurrentManagedAccess: cudaDeviceAttr = 89;
#[doc = "< Device supports Compute Preemption"]
pub const cudaDeviceAttr_cudaDevAttrComputePreemptionSupported: cudaDeviceAttr = 90;
#[doc = "< Device can access host registered memory at the same virtual address as the CPU"]
pub const cudaDeviceAttr_cudaDevAttrCanUseHostPointerForRegisteredMem: cudaDeviceAttr = 91;
pub const cudaDeviceAttr_cudaDevAttrReserved92: cudaDeviceAttr = 92;
pub const cudaDeviceAttr_cudaDevAttrReserved93: cudaDeviceAttr = 93;
pub const cudaDeviceAttr_cudaDevAttrReserved94: cudaDeviceAttr = 94;
#[doc = "< Device supports launching cooperative kernels via ::cudaLaunchCooperativeKernel"]
pub const cudaDeviceAttr_cudaDevAttrCooperativeLaunch: cudaDeviceAttr = 95;
pub const cudaDeviceAttr_cudaDevAttrReserved96: cudaDeviceAttr = 96;
#[doc = "< The maximum optin shared memory per block. This value may vary by chip. See ::cudaFuncSetAttribute"]
pub const cudaDeviceAttr_cudaDevAttrMaxSharedMemoryPerBlockOptin: cudaDeviceAttr = 97;
#[doc = "< Device supports flushing of outstanding remote writes."]
pub const cudaDeviceAttr_cudaDevAttrCanFlushRemoteWrites: cudaDeviceAttr = 98;
#[doc = "< Device supports host memory registration via ::cudaHostRegister."]
pub const cudaDeviceAttr_cudaDevAttrHostRegisterSupported: cudaDeviceAttr = 99;
#[doc = "< Device accesses pageable memory via the host's page tables."]
pub const cudaDeviceAttr_cudaDevAttrPageableMemoryAccessUsesHostPageTables: cudaDeviceAttr = 100;
#[doc = "< Host can directly access managed memory on the device without migration."]
pub const cudaDeviceAttr_cudaDevAttrDirectManagedMemAccessFromHost: cudaDeviceAttr = 101;
#[doc = "< Maximum number of blocks per multiprocessor"]
pub const cudaDeviceAttr_cudaDevAttrMaxBlocksPerMultiprocessor: cudaDeviceAttr = 106;
#[doc = "< Maximum L2 persisting lines capacity setting in bytes."]
pub const cudaDeviceAttr_cudaDevAttrMaxPersistingL2CacheSize: cudaDeviceAttr = 108;
#[doc = "< Maximum value of cudaAccessPolicyWindow::num_bytes."]
pub const cudaDeviceAttr_cudaDevAttrMaxAccessPolicyWindowSize: cudaDeviceAttr = 109;
#[doc = "< Shared memory reserved by CUDA driver per block in bytes"]
pub const cudaDeviceAttr_cudaDevAttrReservedSharedMemoryPerBlock: cudaDeviceAttr = 111;
#[doc = "< Device supports sparse CUDA arrays and sparse CUDA mipmapped arrays"]
pub const cudaDeviceAttr_cudaDevAttrSparseCudaArraySupported: cudaDeviceAttr = 112;
#[doc = "< Device supports using the ::cudaHostRegister flag cudaHostRegisterReadOnly to register memory that must be mapped as read-only to the GPU"]
pub const cudaDeviceAttr_cudaDevAttrHostRegisterReadOnlySupported: cudaDeviceAttr = 113;
#[doc = "< External timeline semaphore interop is supported on the device"]
pub const cudaDeviceAttr_cudaDevAttrTimelineSemaphoreInteropSupported: cudaDeviceAttr = 114;
#[doc = "< Device supports using the ::cudaMallocAsync and ::cudaMemPool family of APIs"]
pub const cudaDeviceAttr_cudaDevAttrMemoryPoolsSupported: cudaDeviceAttr = 115;
#[doc = "< Device supports GPUDirect RDMA APIs, like nvidia_p2p_get_pages (see https://docs.nvidia.com/cuda/gpudirect-rdma for more information)"]
pub const cudaDeviceAttr_cudaDevAttrGPUDirectRDMASupported: cudaDeviceAttr = 116;
#[doc = "< The returned attribute shall be interpreted as a bitmask, where the individual bits are listed in the ::cudaFlushGPUDirectRDMAWritesOptions enum"]
pub const cudaDeviceAttr_cudaDevAttrGPUDirectRDMAFlushWritesOptions: cudaDeviceAttr = 117;
#[doc = "< GPUDirect RDMA writes to the device do not need to be flushed for consumers within the scope indicated by the returned attribute. See ::cudaGPUDirectRDMAWritesOrdering for the numerical values returned here."]
pub const cudaDeviceAttr_cudaDevAttrGPUDirectRDMAWritesOrdering: cudaDeviceAttr = 118;
#[doc = "< Handle types supported with mempool based IPC"]
pub const cudaDeviceAttr_cudaDevAttrMemoryPoolSupportedHandleTypes: cudaDeviceAttr = 119;
#[doc = "< Indicates device supports cluster launch"]
pub const cudaDeviceAttr_cudaDevAttrClusterLaunch: cudaDeviceAttr = 120;
#[doc = "< Device supports deferred mapping CUDA arrays and CUDA mipmapped arrays"]
pub const cudaDeviceAttr_cudaDevAttrDeferredMappingCudaArraySupported: cudaDeviceAttr = 121;
pub const cudaDeviceAttr_cudaDevAttrReserved122: cudaDeviceAttr = 122;
pub const cudaDeviceAttr_cudaDevAttrReserved123: cudaDeviceAttr = 123;
pub const cudaDeviceAttr_cudaDevAttrReserved124: cudaDeviceAttr = 124;
#[doc = "< Device supports IPC Events."]
pub const cudaDeviceAttr_cudaDevAttrIpcEventSupport: cudaDeviceAttr = 125;
#[doc = "< Number of memory synchronization domains the device supports."]
pub const cudaDeviceAttr_cudaDevAttrMemSyncDomainCount: cudaDeviceAttr = 126;
pub const cudaDeviceAttr_cudaDevAttrReserved127: cudaDeviceAttr = 127;
pub const cudaDeviceAttr_cudaDevAttrReserved128: cudaDeviceAttr = 128;
pub const cudaDeviceAttr_cudaDevAttrReserved129: cudaDeviceAttr = 129;
#[doc = "< NUMA configuration of a device: value is of type ::cudaDeviceNumaConfig enum"]
pub const cudaDeviceAttr_cudaDevAttrNumaConfig: cudaDeviceAttr = 130;
#[doc = "< NUMA node ID of the GPU memory"]
pub const cudaDeviceAttr_cudaDevAttrNumaId: cudaDeviceAttr = 131;
pub const cudaDeviceAttr_cudaDevAttrReserved132: cudaDeviceAttr = 132;
#[doc = "< Contexts created on this device will be shared via MPS"]
pub const cudaDeviceAttr_cudaDevAttrMpsEnabled: cudaDeviceAttr = 133;
#[doc = "< NUMA ID of the host node closest to the device or -1 when system does not support NUMA"]
pub const cudaDeviceAttr_cudaDevAttrHostNumaId: cudaDeviceAttr = 134;
#[doc = "< Device supports CIG with D3D12."]
pub const cudaDeviceAttr_cudaDevAttrD3D12CigSupported: cudaDeviceAttr = 135;
#[doc = "< Device supports CIG with Vulkan."]
pub const cudaDeviceAttr_cudaDevAttrVulkanCigSupported: cudaDeviceAttr = 138;
#[doc = "< The combined 16-bit PCI device ID and 16-bit PCI vendor ID."]
pub const cudaDeviceAttr_cudaDevAttrGpuPciDeviceId: cudaDeviceAttr = 139;
#[doc = "< The combined 16-bit PCI subsystem ID and 16-bit PCI subsystem vendor ID."]
pub const cudaDeviceAttr_cudaDevAttrGpuPciSubsystemId: cudaDeviceAttr = 140;
pub const cudaDeviceAttr_cudaDevAttrReserved141: cudaDeviceAttr = 141;
#[doc = "< Device supports HOST_NUMA location with the ::cudaMallocAsync and ::cudaMemPool family of APIs"]
pub const cudaDeviceAttr_cudaDevAttrHostNumaMemoryPoolsSupported: cudaDeviceAttr = 142;
#[doc = "< Device supports HostNuma location IPC between nodes in a multi-node system."]
pub const cudaDeviceAttr_cudaDevAttrHostNumaMultinodeIpcSupported: cudaDeviceAttr = 143;
#[doc = "< Device suports HOST location with the ::cuMemAllocAsync and ::cuMemPool family of APIs"]
pub const cudaDeviceAttr_cudaDevAttrHostMemoryPoolsSupported: cudaDeviceAttr = 144;
pub const cudaDeviceAttr_cudaDevAttrReserved145: cudaDeviceAttr = 145;
#[doc = "< Link between the device and the host supports only some native atomic operations"]
pub const cudaDeviceAttr_cudaDevAttrOnlyPartialHostNativeAtomicSupported: cudaDeviceAttr = 147;
pub const cudaDeviceAttr_cudaDevAttrMax: cudaDeviceAttr = 148;
#[doc = " CUDA device attributes"]
pub type cudaDeviceAttr = ::std::os::raw::c_uint;
#[doc = " (value type = int)\n Allow cuMemAllocAsync to use memory asynchronously freed\n in another streams as long as a stream ordering dependency\n of the allocating stream on the free action exists.\n Cuda events and null stream interactions can create the required\n stream ordered dependencies. (default enabled)"]
pub const cudaMemPoolAttr_cudaMemPoolReuseFollowEventDependencies: cudaMemPoolAttr = 1;
#[doc = " (value type = int)\n Allow reuse of already completed frees when there is no dependency\n between the free and allocation. (default enabled)"]
pub const cudaMemPoolAttr_cudaMemPoolReuseAllowOpportunistic: cudaMemPoolAttr = 2;
#[doc = " (value type = int)\n Allow cuMemAllocAsync to insert new stream dependencies\n in order to establish the stream ordering required to reuse\n a piece of memory released by cuFreeAsync (default enabled)."]
pub const cudaMemPoolAttr_cudaMemPoolReuseAllowInternalDependencies: cudaMemPoolAttr = 3;
#[doc = " (value type = cuuint64_t)\n Amount of reserved memory in bytes to hold onto before trying\n to release memory back to the OS. When more than the release\n threshold bytes of memory are held by the memory pool, the\n allocator will try to release memory back to the OS on the\n next call to stream, event or context synchronize. (default 0)"]
pub const cudaMemPoolAttr_cudaMemPoolAttrReleaseThreshold: cudaMemPoolAttr = 4;
#[doc = " (value type = cuuint64_t)\n Amount of backing memory currently allocated for the mempool."]
pub const cudaMemPoolAttr_cudaMemPoolAttrReservedMemCurrent: cudaMemPoolAttr = 5;
#[doc = " (value type = cuuint64_t)\n High watermark of backing memory allocated for the mempool since the\n last time it was reset. High watermark can only be reset to zero."]
pub const cudaMemPoolAttr_cudaMemPoolAttrReservedMemHigh: cudaMemPoolAttr = 6;
#[doc = " (value type = cuuint64_t)\n Amount of memory from the pool that is currently in use by the application."]
pub const cudaMemPoolAttr_cudaMemPoolAttrUsedMemCurrent: cudaMemPoolAttr = 7;
#[doc = " (value type = cuuint64_t)\n High watermark of the amount of memory from the pool that was in use by the application since\n the last time it was reset. High watermark can only be reset to zero."]
pub const cudaMemPoolAttr_cudaMemPoolAttrUsedMemHigh: cudaMemPoolAttr = 8;
#[doc = " CUDA memory pool attributes"]
pub type cudaMemPoolAttr = ::std::os::raw::c_uint;
pub const cudaMemLocationType_cudaMemLocationTypeInvalid: cudaMemLocationType = 0;
#[doc = "< Location is unspecified. This is used when creating a managed memory pool to indicate no preferred location for the pool"]
pub const cudaMemLocationType_cudaMemLocationTypeNone: cudaMemLocationType = 0;
#[doc = "< Location is a device location, thus id is a device ordinal"]
pub const cudaMemLocationType_cudaMemLocationTypeDevice: cudaMemLocationType = 1;
#[doc = "< Location is host, id is ignored"]
pub const cudaMemLocationType_cudaMemLocationTypeHost: cudaMemLocationType = 2;
#[doc = "< Location is a host NUMA node, thus id is a host NUMA node id"]
pub const cudaMemLocationType_cudaMemLocationTypeHostNuma: cudaMemLocationType = 3;
#[doc = "< Location is the host NUMA node closest to the current thread's CPU, id is ignored"]
pub const cudaMemLocationType_cudaMemLocationTypeHostNumaCurrent: cudaMemLocationType = 4;
#[doc = " Specifies the type of location"]
pub type cudaMemLocationType = ::std::os::raw::c_uint;
#[doc = " Specifies a memory location.\n\n To specify a gpu, set type = ::cudaMemLocationTypeDevice and set id = the gpu's device ordinal.\n To specify a cpu NUMA node, set type = ::cudaMemLocationTypeHostNuma and set id = host NUMA node id."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaMemLocation {
    #[doc = "< Specifies the location type, which modifies the meaning of id."]
    pub type_: cudaMemLocationType,
    #[doc = "< identifier for a given this location's ::CUmemLocationType."]
    pub id: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaMemLocation"][::std::mem::size_of::<cudaMemLocation>() - 8usize];
    ["Alignment of cudaMemLocation"][::std::mem::align_of::<cudaMemLocation>() - 4usize];
    ["Offset of field: cudaMemLocation::type_"]
        [::std::mem::offset_of!(cudaMemLocation, type_) - 0usize];
    ["Offset of field: cudaMemLocation::id"][::std::mem::offset_of!(cudaMemLocation, id) - 4usize];
};
#[doc = "< Default, make the address range not accessible"]
pub const cudaMemAccessFlags_cudaMemAccessFlagsProtNone: cudaMemAccessFlags = 0;
#[doc = "< Make the address range read accessible"]
pub const cudaMemAccessFlags_cudaMemAccessFlagsProtRead: cudaMemAccessFlags = 1;
#[doc = "< Make the address range read-write accessible"]
pub const cudaMemAccessFlags_cudaMemAccessFlagsProtReadWrite: cudaMemAccessFlags = 3;
#[doc = " Specifies the memory protection flags for mapping."]
pub type cudaMemAccessFlags = ::std::os::raw::c_uint;
#[doc = " Memory access descriptor"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaMemAccessDesc {
    #[doc = "< Location on which the request is to change it's accessibility"]
    pub location: cudaMemLocation,
    #[doc = "< ::CUmemProt accessibility flags to set on the request"]
    pub flags: cudaMemAccessFlags,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaMemAccessDesc"][::std::mem::size_of::<cudaMemAccessDesc>() - 12usize];
    ["Alignment of cudaMemAccessDesc"][::std::mem::align_of::<cudaMemAccessDesc>() - 4usize];
    ["Offset of field: cudaMemAccessDesc::location"]
        [::std::mem::offset_of!(cudaMemAccessDesc, location) - 0usize];
    ["Offset of field: cudaMemAccessDesc::flags"]
        [::std::mem::offset_of!(cudaMemAccessDesc, flags) - 8usize];
};
pub const cudaMemAllocationType_cudaMemAllocationTypeInvalid: cudaMemAllocationType = 0;
#[doc = " This allocation type is 'pinned', i.e. cannot migrate from its current\n location while the application is actively using it"]
pub const cudaMemAllocationType_cudaMemAllocationTypePinned: cudaMemAllocationType = 1;
#[doc = " This allocation type is managed memory"]
pub const cudaMemAllocationType_cudaMemAllocationTypeManaged: cudaMemAllocationType = 2;
#[doc = " This allocation type is managed memory"]
pub const cudaMemAllocationType_cudaMemAllocationTypeMax: cudaMemAllocationType = 2147483647;
#[doc = " Defines the allocation types available"]
pub type cudaMemAllocationType = ::std::os::raw::c_uint;
#[doc = "< Does not allow any export mechanism. >"]
pub const cudaMemAllocationHandleType_cudaMemHandleTypeNone: cudaMemAllocationHandleType = 0;
#[doc = "< Allows a file descriptor to be used for exporting. Permitted only on POSIX systems. (int)"]
pub const cudaMemAllocationHandleType_cudaMemHandleTypePosixFileDescriptor:
    cudaMemAllocationHandleType = 1;
#[doc = "< Allows a Win32 NT handle to be used for exporting. (HANDLE)"]
pub const cudaMemAllocationHandleType_cudaMemHandleTypeWin32: cudaMemAllocationHandleType = 2;
#[doc = "< Allows a Win32 KMT handle to be used for exporting. (D3DKMT_HANDLE)"]
pub const cudaMemAllocationHandleType_cudaMemHandleTypeWin32Kmt: cudaMemAllocationHandleType = 4;
#[doc = "< Allows a fabric handle to be used for exporting. (cudaMemFabricHandle_t)"]
pub const cudaMemAllocationHandleType_cudaMemHandleTypeFabric: cudaMemAllocationHandleType = 8;
#[doc = " Flags for specifying particular handle types"]
pub type cudaMemAllocationHandleType = ::std::os::raw::c_uint;
#[doc = " Specifies the properties of allocations made from the pool."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaMemPoolProps {
    #[doc = "< Allocation type. Currently must be specified as cudaMemAllocationTypePinned"]
    pub allocType: cudaMemAllocationType,
    #[doc = "< Handle types that will be supported by allocations from the pool."]
    pub handleTypes: cudaMemAllocationHandleType,
    #[doc = "< Location allocations should reside."]
    pub location: cudaMemLocation,
    #[doc = " Windows-specific LPSECURITYATTRIBUTES required when\n ::cudaMemHandleTypeWin32 is specified.  This security attribute defines\n the scope of which exported allocations may be tranferred to other\n processes.  In all other cases, this field is required to be zero."]
    pub win32SecurityAttributes: *mut ::std::os::raw::c_void,
    #[doc = "< Maximum pool size. When set to 0, defaults to a system dependent value."]
    pub maxSize: usize,
    #[doc = "< Bitmask indicating intended usage for the pool."]
    pub usage: ::std::os::raw::c_ushort,
    #[doc = "< reserved for future use, must be 0"]
    pub reserved: [::std::os::raw::c_uchar; 54usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaMemPoolProps"][::std::mem::size_of::<cudaMemPoolProps>() - 88usize];
    ["Alignment of cudaMemPoolProps"][::std::mem::align_of::<cudaMemPoolProps>() - 8usize];
    ["Offset of field: cudaMemPoolProps::allocType"]
        [::std::mem::offset_of!(cudaMemPoolProps, allocType) - 0usize];
    ["Offset of field: cudaMemPoolProps::handleTypes"]
        [::std::mem::offset_of!(cudaMemPoolProps, handleTypes) - 4usize];
    ["Offset of field: cudaMemPoolProps::location"]
        [::std::mem::offset_of!(cudaMemPoolProps, location) - 8usize];
    ["Offset of field: cudaMemPoolProps::win32SecurityAttributes"]
        [::std::mem::offset_of!(cudaMemPoolProps, win32SecurityAttributes) - 16usize];
    ["Offset of field: cudaMemPoolProps::maxSize"]
        [::std::mem::offset_of!(cudaMemPoolProps, maxSize) - 24usize];
    ["Offset of field: cudaMemPoolProps::usage"]
        [::std::mem::offset_of!(cudaMemPoolProps, usage) - 32usize];
    ["Offset of field: cudaMemPoolProps::reserved"]
        [::std::mem::offset_of!(cudaMemPoolProps, reserved) - 34usize];
};
#[doc = " Opaque data for exporting a pool allocation"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaMemPoolPtrExportData {
    pub reserved: [::std::os::raw::c_uchar; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaMemPoolPtrExportData"]
        [::std::mem::size_of::<cudaMemPoolPtrExportData>() - 64usize];
    ["Alignment of cudaMemPoolPtrExportData"]
        [::std::mem::align_of::<cudaMemPoolPtrExportData>() - 1usize];
    ["Offset of field: cudaMemPoolPtrExportData::reserved"]
        [::std::mem::offset_of!(cudaMemPoolPtrExportData, reserved) - 0usize];
};
#[doc = " Memory allocation node parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaMemAllocNodeParams {
    #[doc = "< in: array of memory access descriptors. Used to describe peer GPU access"]
    pub poolProps: cudaMemPoolProps,
    #[doc = "< in: number of memory access descriptors.  Must not exceed the number of GPUs."]
    pub accessDescs: *const cudaMemAccessDesc,
    #[doc = "< in: Number of `accessDescs`s"]
    pub accessDescCount: usize,
    #[doc = "< in: size in bytes of the requested allocation"]
    pub bytesize: usize,
    #[doc = "< out: address of the allocation returned by CUDA"]
    pub dptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaMemAllocNodeParams"][::std::mem::size_of::<cudaMemAllocNodeParams>() - 120usize];
    ["Alignment of cudaMemAllocNodeParams"]
        [::std::mem::align_of::<cudaMemAllocNodeParams>() - 8usize];
    ["Offset of field: cudaMemAllocNodeParams::poolProps"]
        [::std::mem::offset_of!(cudaMemAllocNodeParams, poolProps) - 0usize];
    ["Offset of field: cudaMemAllocNodeParams::accessDescs"]
        [::std::mem::offset_of!(cudaMemAllocNodeParams, accessDescs) - 88usize];
    ["Offset of field: cudaMemAllocNodeParams::accessDescCount"]
        [::std::mem::offset_of!(cudaMemAllocNodeParams, accessDescCount) - 96usize];
    ["Offset of field: cudaMemAllocNodeParams::bytesize"]
        [::std::mem::offset_of!(cudaMemAllocNodeParams, bytesize) - 104usize];
    ["Offset of field: cudaMemAllocNodeParams::dptr"]
        [::std::mem::offset_of!(cudaMemAllocNodeParams, dptr) - 112usize];
};
#[doc = " Memory allocation node parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaMemAllocNodeParamsV2 {
    #[doc = "< in: array of memory access descriptors. Used to describe peer GPU access"]
    pub poolProps: cudaMemPoolProps,
    #[doc = "< in: number of memory access descriptors.  Must not exceed the number of GPUs."]
    pub accessDescs: *const cudaMemAccessDesc,
    #[doc = "< in: Number of `accessDescs`s"]
    pub accessDescCount: usize,
    #[doc = "< in: size in bytes of the requested allocation"]
    pub bytesize: usize,
    #[doc = "< out: address of the allocation returned by CUDA"]
    pub dptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaMemAllocNodeParamsV2"]
        [::std::mem::size_of::<cudaMemAllocNodeParamsV2>() - 120usize];
    ["Alignment of cudaMemAllocNodeParamsV2"]
        [::std::mem::align_of::<cudaMemAllocNodeParamsV2>() - 8usize];
    ["Offset of field: cudaMemAllocNodeParamsV2::poolProps"]
        [::std::mem::offset_of!(cudaMemAllocNodeParamsV2, poolProps) - 0usize];
    ["Offset of field: cudaMemAllocNodeParamsV2::accessDescs"]
        [::std::mem::offset_of!(cudaMemAllocNodeParamsV2, accessDescs) - 88usize];
    ["Offset of field: cudaMemAllocNodeParamsV2::accessDescCount"]
        [::std::mem::offset_of!(cudaMemAllocNodeParamsV2, accessDescCount) - 96usize];
    ["Offset of field: cudaMemAllocNodeParamsV2::bytesize"]
        [::std::mem::offset_of!(cudaMemAllocNodeParamsV2, bytesize) - 104usize];
    ["Offset of field: cudaMemAllocNodeParamsV2::dptr"]
        [::std::mem::offset_of!(cudaMemAllocNodeParamsV2, dptr) - 112usize];
};
#[doc = " Memory free node parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaMemFreeNodeParams {
    #[doc = "< in: the pointer to free"]
    pub dptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaMemFreeNodeParams"][::std::mem::size_of::<cudaMemFreeNodeParams>() - 8usize];
    ["Alignment of cudaMemFreeNodeParams"]
        [::std::mem::align_of::<cudaMemFreeNodeParams>() - 8usize];
    ["Offset of field: cudaMemFreeNodeParams::dptr"]
        [::std::mem::offset_of!(cudaMemFreeNodeParams, dptr) - 0usize];
};
#[doc = " (value type = cuuint64_t)\n Amount of memory, in bytes, currently associated with graphs."]
pub const cudaGraphMemAttributeType_cudaGraphMemAttrUsedMemCurrent: cudaGraphMemAttributeType = 0;
#[doc = " (value type = cuuint64_t)\n High watermark of memory, in bytes, associated with graphs since the\n last time it was reset.  High watermark can only be reset to zero."]
pub const cudaGraphMemAttributeType_cudaGraphMemAttrUsedMemHigh: cudaGraphMemAttributeType = 1;
#[doc = " (value type = cuuint64_t)\n Amount of memory, in bytes, currently allocated for use by\n the CUDA graphs asynchronous allocator."]
pub const cudaGraphMemAttributeType_cudaGraphMemAttrReservedMemCurrent: cudaGraphMemAttributeType =
    2;
#[doc = " (value type = cuuint64_t)\n High watermark of memory, in bytes, currently allocated for use by\n the CUDA graphs asynchronous allocator."]
pub const cudaGraphMemAttributeType_cudaGraphMemAttrReservedMemHigh: cudaGraphMemAttributeType = 3;
#[doc = " Graph memory attributes"]
pub type cudaGraphMemAttributeType = ::std::os::raw::c_uint;
pub const cudaMemcpyFlags_cudaMemcpyFlagDefault: cudaMemcpyFlags = 0;
#[doc = " Hint to the driver to try and overlap the copy with compute work on the SMs."]
pub const cudaMemcpyFlags_cudaMemcpyFlagPreferOverlapWithCompute: cudaMemcpyFlags = 1;
#[doc = " Flags to specify for copies within a batch. For more details see ::cudaMemcpyBatchAsync."]
pub type cudaMemcpyFlags = ::std::os::raw::c_uint;
#[doc = " Default invalid."]
pub const cudaMemcpySrcAccessOrder_cudaMemcpySrcAccessOrderInvalid: cudaMemcpySrcAccessOrder = 0;
#[doc = " Indicates that access to the source pointer must be in stream order."]
pub const cudaMemcpySrcAccessOrder_cudaMemcpySrcAccessOrderStream: cudaMemcpySrcAccessOrder = 1;
#[doc = " Indicates that access to the source pointer can be out of stream order and all\n accesses must be complete before the API call returns. This flag is suited for\n ephemeral sources (ex., stack variables) when it's known that no prior operations\n in the stream can be accessing the memory and also that the lifetime of the memory\n is limited to the scope that the source variable was declared in. Specifying\n this flag allows the driver to optimize the copy and removes the need for the user\n to synchronize the stream after the API call."]
pub const cudaMemcpySrcAccessOrder_cudaMemcpySrcAccessOrderDuringApiCall: cudaMemcpySrcAccessOrder =
    2;
#[doc = " Indicates that access to the source pointer can be out of stream order and the accesses\n can happen even after the API call returns. This flag is suited for host pointers\n allocated outside CUDA (ex., via malloc) when it's known that no prior operations\n in the stream can be accessing the memory. Specifying this flag allows the driver\n to optimize the copy on certain platforms."]
pub const cudaMemcpySrcAccessOrder_cudaMemcpySrcAccessOrderAny: cudaMemcpySrcAccessOrder = 3;
#[doc = " Indicates that access to the source pointer can be out of stream order and the accesses\n can happen even after the API call returns. This flag is suited for host pointers\n allocated outside CUDA (ex., via malloc) when it's known that no prior operations\n in the stream can be accessing the memory. Specifying this flag allows the driver\n to optimize the copy on certain platforms."]
pub const cudaMemcpySrcAccessOrder_cudaMemcpySrcAccessOrderMax: cudaMemcpySrcAccessOrder =
    2147483647;
pub type cudaMemcpySrcAccessOrder = ::std::os::raw::c_uint;
#[doc = " Attributes specific to copies within a batch. For more details on usage see ::cudaMemcpyBatchAsync."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaMemcpyAttributes {
    #[doc = "< Source access ordering to be observed for copies with this attribute."]
    pub srcAccessOrder: cudaMemcpySrcAccessOrder,
    #[doc = "< Hint location for the source operand. Ignored when the pointers are not managed memory or memory allocated outside CUDA."]
    pub srcLocHint: cudaMemLocation,
    #[doc = "< Hint location for the destination operand. Ignored when the pointers are not managed memory or memory allocated outside CUDA."]
    pub dstLocHint: cudaMemLocation,
    #[doc = "< Additional flags for copies with this attribute. See ::cudaMemcpyFlags."]
    pub flags: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaMemcpyAttributes"][::std::mem::size_of::<cudaMemcpyAttributes>() - 24usize];
    ["Alignment of cudaMemcpyAttributes"][::std::mem::align_of::<cudaMemcpyAttributes>() - 4usize];
    ["Offset of field: cudaMemcpyAttributes::srcAccessOrder"]
        [::std::mem::offset_of!(cudaMemcpyAttributes, srcAccessOrder) - 0usize];
    ["Offset of field: cudaMemcpyAttributes::srcLocHint"]
        [::std::mem::offset_of!(cudaMemcpyAttributes, srcLocHint) - 4usize];
    ["Offset of field: cudaMemcpyAttributes::dstLocHint"]
        [::std::mem::offset_of!(cudaMemcpyAttributes, dstLocHint) - 12usize];
    ["Offset of field: cudaMemcpyAttributes::flags"]
        [::std::mem::offset_of!(cudaMemcpyAttributes, flags) - 20usize];
};
#[doc = "< Memcpy operand is a valid pointer."]
pub const cudaMemcpy3DOperandType_cudaMemcpyOperandTypePointer: cudaMemcpy3DOperandType = 1;
#[doc = "< Memcpy operand is a CUarray."]
pub const cudaMemcpy3DOperandType_cudaMemcpyOperandTypeArray: cudaMemcpy3DOperandType = 2;
pub const cudaMemcpy3DOperandType_cudaMemcpyOperandTypeMax: cudaMemcpy3DOperandType = 2147483647;
#[doc = " These flags allow applications to convey the operand type for individual copies specified in ::cudaMemcpy3DBatchAsync."]
pub type cudaMemcpy3DOperandType = ::std::os::raw::c_uint;
#[doc = " Struct representing offset into a ::cudaArray_t in elements"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaOffset3D {
    pub x: usize,
    pub y: usize,
    pub z: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaOffset3D"][::std::mem::size_of::<cudaOffset3D>() - 24usize];
    ["Alignment of cudaOffset3D"][::std::mem::align_of::<cudaOffset3D>() - 8usize];
    ["Offset of field: cudaOffset3D::x"][::std::mem::offset_of!(cudaOffset3D, x) - 0usize];
    ["Offset of field: cudaOffset3D::y"][::std::mem::offset_of!(cudaOffset3D, y) - 8usize];
    ["Offset of field: cudaOffset3D::z"][::std::mem::offset_of!(cudaOffset3D, z) - 16usize];
};
#[doc = " Struct representing an operand for copy with ::cudaMemcpy3DBatchAsync"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct cudaMemcpy3DOperand {
    pub type_: cudaMemcpy3DOperandType,
    pub op: cudaMemcpy3DOperand__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union cudaMemcpy3DOperand__bindgen_ty_1 {
    pub ptr: cudaMemcpy3DOperand__bindgen_ty_1__bindgen_ty_1,
    pub array: cudaMemcpy3DOperand__bindgen_ty_1__bindgen_ty_2,
}
#[doc = " Struct representing an operand when ::cudaMemcpy3DOperand::type is ::cudaMemcpyOperandTypePointer"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaMemcpy3DOperand__bindgen_ty_1__bindgen_ty_1 {
    pub ptr: *mut ::std::os::raw::c_void,
    #[doc = "< Length of each row in elements."]
    pub rowLength: usize,
    #[doc = "< Height of each layer in elements."]
    pub layerHeight: usize,
    #[doc = "< Hint location for the operand. Ignored when the pointers are not managed memory or memory allocated outside CUDA."]
    pub locHint: cudaMemLocation,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaMemcpy3DOperand__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<cudaMemcpy3DOperand__bindgen_ty_1__bindgen_ty_1>() - 32usize];
    ["Alignment of cudaMemcpy3DOperand__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<cudaMemcpy3DOperand__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: cudaMemcpy3DOperand__bindgen_ty_1__bindgen_ty_1::ptr"]
        [::std::mem::offset_of!(cudaMemcpy3DOperand__bindgen_ty_1__bindgen_ty_1, ptr) - 0usize];
    ["Offset of field: cudaMemcpy3DOperand__bindgen_ty_1__bindgen_ty_1::rowLength"][::std::mem::offset_of!(
        cudaMemcpy3DOperand__bindgen_ty_1__bindgen_ty_1,
        rowLength
    ) - 8usize];
    ["Offset of field: cudaMemcpy3DOperand__bindgen_ty_1__bindgen_ty_1::layerHeight"][::std::mem::offset_of!(
        cudaMemcpy3DOperand__bindgen_ty_1__bindgen_ty_1,
        layerHeight
    ) - 16usize];
    ["Offset of field: cudaMemcpy3DOperand__bindgen_ty_1__bindgen_ty_1::locHint"][::std::mem::offset_of!(
        cudaMemcpy3DOperand__bindgen_ty_1__bindgen_ty_1,
        locHint
    ) - 24usize];
};
#[doc = " Struct representing an operand when ::cudaMemcpy3DOperand::type is ::cudaMemcpyOperandTypeArray"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaMemcpy3DOperand__bindgen_ty_1__bindgen_ty_2 {
    pub array: cudaArray_t,
    pub offset: cudaOffset3D,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaMemcpy3DOperand__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<cudaMemcpy3DOperand__bindgen_ty_1__bindgen_ty_2>() - 32usize];
    ["Alignment of cudaMemcpy3DOperand__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<cudaMemcpy3DOperand__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Offset of field: cudaMemcpy3DOperand__bindgen_ty_1__bindgen_ty_2::array"]
        [::std::mem::offset_of!(cudaMemcpy3DOperand__bindgen_ty_1__bindgen_ty_2, array) - 0usize];
    ["Offset of field: cudaMemcpy3DOperand__bindgen_ty_1__bindgen_ty_2::offset"]
        [::std::mem::offset_of!(cudaMemcpy3DOperand__bindgen_ty_1__bindgen_ty_2, offset) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaMemcpy3DOperand__bindgen_ty_1"]
        [::std::mem::size_of::<cudaMemcpy3DOperand__bindgen_ty_1>() - 32usize];
    ["Alignment of cudaMemcpy3DOperand__bindgen_ty_1"]
        [::std::mem::align_of::<cudaMemcpy3DOperand__bindgen_ty_1>() - 8usize];
    ["Offset of field: cudaMemcpy3DOperand__bindgen_ty_1::ptr"]
        [::std::mem::offset_of!(cudaMemcpy3DOperand__bindgen_ty_1, ptr) - 0usize];
    ["Offset of field: cudaMemcpy3DOperand__bindgen_ty_1::array"]
        [::std::mem::offset_of!(cudaMemcpy3DOperand__bindgen_ty_1, array) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaMemcpy3DOperand"][::std::mem::size_of::<cudaMemcpy3DOperand>() - 40usize];
    ["Alignment of cudaMemcpy3DOperand"][::std::mem::align_of::<cudaMemcpy3DOperand>() - 8usize];
    ["Offset of field: cudaMemcpy3DOperand::type_"]
        [::std::mem::offset_of!(cudaMemcpy3DOperand, type_) - 0usize];
    ["Offset of field: cudaMemcpy3DOperand::op"]
        [::std::mem::offset_of!(cudaMemcpy3DOperand, op) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct cudaMemcpy3DBatchOp {
    #[doc = "< Source memcpy operand."]
    pub src: cudaMemcpy3DOperand,
    #[doc = "< Destination memcpy operand."]
    pub dst: cudaMemcpy3DOperand,
    #[doc = "< Extents of the memcpy between src and dst. The width, height and depth components must not be 0."]
    pub extent: cudaExtent,
    #[doc = "< Source access ordering to be observed for copy from src to dst."]
    pub srcAccessOrder: cudaMemcpySrcAccessOrder,
    #[doc = "< Additional flags for copy from src to dst. See ::cudaMemcpyFlags."]
    pub flags: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaMemcpy3DBatchOp"][::std::mem::size_of::<cudaMemcpy3DBatchOp>() - 112usize];
    ["Alignment of cudaMemcpy3DBatchOp"][::std::mem::align_of::<cudaMemcpy3DBatchOp>() - 8usize];
    ["Offset of field: cudaMemcpy3DBatchOp::src"]
        [::std::mem::offset_of!(cudaMemcpy3DBatchOp, src) - 0usize];
    ["Offset of field: cudaMemcpy3DBatchOp::dst"]
        [::std::mem::offset_of!(cudaMemcpy3DBatchOp, dst) - 40usize];
    ["Offset of field: cudaMemcpy3DBatchOp::extent"]
        [::std::mem::offset_of!(cudaMemcpy3DBatchOp, extent) - 80usize];
    ["Offset of field: cudaMemcpy3DBatchOp::srcAccessOrder"]
        [::std::mem::offset_of!(cudaMemcpy3DBatchOp, srcAccessOrder) - 104usize];
    ["Offset of field: cudaMemcpy3DBatchOp::flags"]
        [::std::mem::offset_of!(cudaMemcpy3DBatchOp, flags) - 108usize];
};
#[doc = "< A relative value indicating the performance of the link between two devices"]
pub const cudaDeviceP2PAttr_cudaDevP2PAttrPerformanceRank: cudaDeviceP2PAttr = 1;
#[doc = "< Peer access is enabled"]
pub const cudaDeviceP2PAttr_cudaDevP2PAttrAccessSupported: cudaDeviceP2PAttr = 2;
#[doc = "< Native atomic operation over the link supported"]
pub const cudaDeviceP2PAttr_cudaDevP2PAttrNativeAtomicSupported: cudaDeviceP2PAttr = 3;
#[doc = "< Accessing CUDA arrays over the link supported"]
pub const cudaDeviceP2PAttr_cudaDevP2PAttrCudaArrayAccessSupported: cudaDeviceP2PAttr = 4;
#[doc = "< Only some CUDA-valid atomic operations over the link are supported."]
pub const cudaDeviceP2PAttr_cudaDevP2PAttrOnlyPartialNativeAtomicSupported: cudaDeviceP2PAttr = 5;
#[doc = " CUDA device P2P attributes"]
pub type cudaDeviceP2PAttr = ::std::os::raw::c_uint;
pub const cudaAtomicOperation_cudaAtomicOperationIntegerAdd: cudaAtomicOperation = 0;
pub const cudaAtomicOperation_cudaAtomicOperationIntegerMin: cudaAtomicOperation = 1;
pub const cudaAtomicOperation_cudaAtomicOperationIntegerMax: cudaAtomicOperation = 2;
pub const cudaAtomicOperation_cudaAtomicOperationIntegerIncrement: cudaAtomicOperation = 3;
pub const cudaAtomicOperation_cudaAtomicOperationIntegerDecrement: cudaAtomicOperation = 4;
pub const cudaAtomicOperation_cudaAtomicOperationAnd: cudaAtomicOperation = 5;
pub const cudaAtomicOperation_cudaAtomicOperationOr: cudaAtomicOperation = 6;
pub const cudaAtomicOperation_cudaAtomicOperationXOR: cudaAtomicOperation = 7;
pub const cudaAtomicOperation_cudaAtomicOperationExchange: cudaAtomicOperation = 8;
pub const cudaAtomicOperation_cudaAtomicOperationCAS: cudaAtomicOperation = 9;
pub const cudaAtomicOperation_cudaAtomicOperationFloatAdd: cudaAtomicOperation = 10;
pub const cudaAtomicOperation_cudaAtomicOperationFloatMin: cudaAtomicOperation = 11;
pub const cudaAtomicOperation_cudaAtomicOperationFloatMax: cudaAtomicOperation = 12;
#[doc = " CUDA-valid Atomic Operations"]
pub type cudaAtomicOperation = ::std::os::raw::c_uint;
pub const cudaAtomicOperationCapability_cudaAtomicCapabilitySigned: cudaAtomicOperationCapability =
    1;
pub const cudaAtomicOperationCapability_cudaAtomicCapabilityUnsigned:
    cudaAtomicOperationCapability = 2;
pub const cudaAtomicOperationCapability_cudaAtomicCapabilityReduction:
    cudaAtomicOperationCapability = 4;
pub const cudaAtomicOperationCapability_cudaAtomicCapabilityScalar32:
    cudaAtomicOperationCapability = 8;
pub const cudaAtomicOperationCapability_cudaAtomicCapabilityScalar64:
    cudaAtomicOperationCapability = 16;
pub const cudaAtomicOperationCapability_cudaAtomicCapabilityScalar128:
    cudaAtomicOperationCapability = 32;
pub const cudaAtomicOperationCapability_cudaAtomicCapabilityVector32x4:
    cudaAtomicOperationCapability = 64;
#[doc = " CUDA-valid Atomic Operation capabilities"]
pub type cudaAtomicOperationCapability = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUuuid_st {
    pub bytes: [::std::os::raw::c_char; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUuuid_st"][::std::mem::size_of::<CUuuid_st>() - 16usize];
    ["Alignment of CUuuid_st"][::std::mem::align_of::<CUuuid_st>() - 1usize];
    ["Offset of field: CUuuid_st::bytes"][::std::mem::offset_of!(CUuuid_st, bytes) - 0usize];
};
pub type CUuuid = CUuuid_st;
pub type cudaUUID_t = CUuuid_st;
#[doc = " CUDA device properties"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaDeviceProp {
    #[doc = "< ASCII string identifying device"]
    pub name: [::std::os::raw::c_char; 256usize],
    #[doc = "< 16-byte unique identifier"]
    pub uuid: cudaUUID_t,
    #[doc = "< 8-byte locally unique identifier. Value is undefined on TCC and non-Windows platforms"]
    pub luid: [::std::os::raw::c_char; 8usize],
    #[doc = "< LUID device node mask. Value is undefined on TCC and non-Windows platforms"]
    pub luidDeviceNodeMask: ::std::os::raw::c_uint,
    #[doc = "< Global memory available on device in bytes"]
    pub totalGlobalMem: usize,
    #[doc = "< Shared memory available per block in bytes"]
    pub sharedMemPerBlock: usize,
    #[doc = "< 32-bit registers available per block"]
    pub regsPerBlock: ::std::os::raw::c_int,
    #[doc = "< Warp size in threads"]
    pub warpSize: ::std::os::raw::c_int,
    #[doc = "< Maximum pitch in bytes allowed by memory copies"]
    pub memPitch: usize,
    #[doc = "< Maximum number of threads per block"]
    pub maxThreadsPerBlock: ::std::os::raw::c_int,
    #[doc = "< Maximum size of each dimension of a block"]
    pub maxThreadsDim: [::std::os::raw::c_int; 3usize],
    #[doc = "< Maximum size of each dimension of a grid"]
    pub maxGridSize: [::std::os::raw::c_int; 3usize],
    #[doc = "< Constant memory available on device in bytes"]
    pub totalConstMem: usize,
    #[doc = "< Major compute capability"]
    pub major: ::std::os::raw::c_int,
    #[doc = "< Minor compute capability"]
    pub minor: ::std::os::raw::c_int,
    #[doc = "< Alignment requirement for textures"]
    pub textureAlignment: usize,
    #[doc = "< Pitch alignment requirement for texture references bound to pitched memory"]
    pub texturePitchAlignment: usize,
    #[doc = "< Number of multiprocessors on device"]
    pub multiProcessorCount: ::std::os::raw::c_int,
    #[doc = "< Device is integrated as opposed to discrete"]
    pub integrated: ::std::os::raw::c_int,
    #[doc = "< Device can map host memory with cudaHostAlloc/cudaHostGetDevicePointer"]
    pub canMapHostMemory: ::std::os::raw::c_int,
    #[doc = "< Maximum 1D texture size"]
    pub maxTexture1D: ::std::os::raw::c_int,
    #[doc = "< Maximum 1D mipmapped texture size"]
    pub maxTexture1DMipmap: ::std::os::raw::c_int,
    #[doc = "< Maximum 2D texture dimensions"]
    pub maxTexture2D: [::std::os::raw::c_int; 2usize],
    #[doc = "< Maximum 2D mipmapped texture dimensions"]
    pub maxTexture2DMipmap: [::std::os::raw::c_int; 2usize],
    #[doc = "< Maximum dimensions (width, height, pitch) for 2D textures bound to pitched memory"]
    pub maxTexture2DLinear: [::std::os::raw::c_int; 3usize],
    #[doc = "< Maximum 2D texture dimensions if texture gather operations have to be performed"]
    pub maxTexture2DGather: [::std::os::raw::c_int; 2usize],
    #[doc = "< Maximum 3D texture dimensions"]
    pub maxTexture3D: [::std::os::raw::c_int; 3usize],
    #[doc = "< Maximum alternate 3D texture dimensions"]
    pub maxTexture3DAlt: [::std::os::raw::c_int; 3usize],
    #[doc = "< Maximum Cubemap texture dimensions"]
    pub maxTextureCubemap: ::std::os::raw::c_int,
    #[doc = "< Maximum 1D layered texture dimensions"]
    pub maxTexture1DLayered: [::std::os::raw::c_int; 2usize],
    #[doc = "< Maximum 2D layered texture dimensions"]
    pub maxTexture2DLayered: [::std::os::raw::c_int; 3usize],
    #[doc = "< Maximum Cubemap layered texture dimensions"]
    pub maxTextureCubemapLayered: [::std::os::raw::c_int; 2usize],
    #[doc = "< Maximum 1D surface size"]
    pub maxSurface1D: ::std::os::raw::c_int,
    #[doc = "< Maximum 2D surface dimensions"]
    pub maxSurface2D: [::std::os::raw::c_int; 2usize],
    #[doc = "< Maximum 3D surface dimensions"]
    pub maxSurface3D: [::std::os::raw::c_int; 3usize],
    #[doc = "< Maximum 1D layered surface dimensions"]
    pub maxSurface1DLayered: [::std::os::raw::c_int; 2usize],
    #[doc = "< Maximum 2D layered surface dimensions"]
    pub maxSurface2DLayered: [::std::os::raw::c_int; 3usize],
    #[doc = "< Maximum Cubemap surface dimensions"]
    pub maxSurfaceCubemap: ::std::os::raw::c_int,
    #[doc = "< Maximum Cubemap layered surface dimensions"]
    pub maxSurfaceCubemapLayered: [::std::os::raw::c_int; 2usize],
    #[doc = "< Alignment requirements for surfaces"]
    pub surfaceAlignment: usize,
    #[doc = "< Device can possibly execute multiple kernels concurrently"]
    pub concurrentKernels: ::std::os::raw::c_int,
    #[doc = "< Device has ECC support enabled"]
    pub ECCEnabled: ::std::os::raw::c_int,
    #[doc = "< PCI bus ID of the device"]
    pub pciBusID: ::std::os::raw::c_int,
    #[doc = "< PCI device ID of the device"]
    pub pciDeviceID: ::std::os::raw::c_int,
    #[doc = "< PCI domain ID of the device"]
    pub pciDomainID: ::std::os::raw::c_int,
    #[doc = "< 1 if device is a Tesla device using TCC driver, 0 otherwise"]
    pub tccDriver: ::std::os::raw::c_int,
    #[doc = "< Number of asynchronous engines"]
    pub asyncEngineCount: ::std::os::raw::c_int,
    #[doc = "< Device shares a unified address space with the host"]
    pub unifiedAddressing: ::std::os::raw::c_int,
    #[doc = "< Global memory bus width in bits"]
    pub memoryBusWidth: ::std::os::raw::c_int,
    #[doc = "< Size of L2 cache in bytes"]
    pub l2CacheSize: ::std::os::raw::c_int,
    #[doc = "< Device's maximum l2 persisting lines capacity setting in bytes"]
    pub persistingL2CacheMaxSize: ::std::os::raw::c_int,
    #[doc = "< Maximum resident threads per multiprocessor"]
    pub maxThreadsPerMultiProcessor: ::std::os::raw::c_int,
    #[doc = "< Device supports stream priorities"]
    pub streamPrioritiesSupported: ::std::os::raw::c_int,
    #[doc = "< Device supports caching globals in L1"]
    pub globalL1CacheSupported: ::std::os::raw::c_int,
    #[doc = "< Device supports caching locals in L1"]
    pub localL1CacheSupported: ::std::os::raw::c_int,
    #[doc = "< Shared memory available per multiprocessor in bytes"]
    pub sharedMemPerMultiprocessor: usize,
    #[doc = "< 32-bit registers available per multiprocessor"]
    pub regsPerMultiprocessor: ::std::os::raw::c_int,
    #[doc = "< Device supports allocating managed memory on this system"]
    pub managedMemory: ::std::os::raw::c_int,
    #[doc = "< Device is on a multi-GPU board"]
    pub isMultiGpuBoard: ::std::os::raw::c_int,
    #[doc = "< Unique identifier for a group of devices on the same multi-GPU board"]
    pub multiGpuBoardGroupID: ::std::os::raw::c_int,
    #[doc = "< Link between the device and the host supports native atomic operations"]
    pub hostNativeAtomicSupported: ::std::os::raw::c_int,
    #[doc = "< Device supports coherently accessing pageable memory without calling cudaHostRegister on it"]
    pub pageableMemoryAccess: ::std::os::raw::c_int,
    #[doc = "< Device can coherently access managed memory concurrently with the CPU"]
    pub concurrentManagedAccess: ::std::os::raw::c_int,
    #[doc = "< Device supports Compute Preemption"]
    pub computePreemptionSupported: ::std::os::raw::c_int,
    #[doc = "< Device can access host registered memory at the same virtual address as the CPU"]
    pub canUseHostPointerForRegisteredMem: ::std::os::raw::c_int,
    #[doc = "< Device supports launching cooperative kernels via ::cudaLaunchCooperativeKernel"]
    pub cooperativeLaunch: ::std::os::raw::c_int,
    #[doc = "< Per device maximum shared memory per block usable by special opt in"]
    pub sharedMemPerBlockOptin: usize,
    #[doc = "< Device accesses pageable memory via the host's page tables"]
    pub pageableMemoryAccessUsesHostPageTables: ::std::os::raw::c_int,
    #[doc = "< Host can directly access managed memory on the device without migration."]
    pub directManagedMemAccessFromHost: ::std::os::raw::c_int,
    #[doc = "< Maximum number of resident blocks per multiprocessor"]
    pub maxBlocksPerMultiProcessor: ::std::os::raw::c_int,
    #[doc = "< The maximum value of ::cudaAccessPolicyWindow::num_bytes."]
    pub accessPolicyMaxWindowSize: ::std::os::raw::c_int,
    #[doc = "< Shared memory reserved by CUDA driver per block in bytes"]
    pub reservedSharedMemPerBlock: usize,
    #[doc = "< Device supports host memory registration via ::cudaHostRegister."]
    pub hostRegisterSupported: ::std::os::raw::c_int,
    #[doc = "< 1 if the device supports sparse CUDA arrays and sparse CUDA mipmapped arrays, 0 otherwise"]
    pub sparseCudaArraySupported: ::std::os::raw::c_int,
    #[doc = "< Device supports using the ::cudaHostRegister flag cudaHostRegisterReadOnly to register memory that must be mapped as read-only to the GPU"]
    pub hostRegisterReadOnlySupported: ::std::os::raw::c_int,
    #[doc = "< External timeline semaphore interop is supported on the device"]
    pub timelineSemaphoreInteropSupported: ::std::os::raw::c_int,
    #[doc = "< 1 if the device supports using the cudaMallocAsync and cudaMemPool family of APIs, 0 otherwise"]
    pub memoryPoolsSupported: ::std::os::raw::c_int,
    #[doc = "< 1 if the device supports GPUDirect RDMA APIs, 0 otherwise"]
    pub gpuDirectRDMASupported: ::std::os::raw::c_int,
    #[doc = "< Bitmask to be interpreted according to the ::cudaFlushGPUDirectRDMAWritesOptions enum"]
    pub gpuDirectRDMAFlushWritesOptions: ::std::os::raw::c_uint,
    #[doc = "< See the ::cudaGPUDirectRDMAWritesOrdering enum for numerical values"]
    pub gpuDirectRDMAWritesOrdering: ::std::os::raw::c_int,
    #[doc = "< Bitmask of handle types supported with mempool-based IPC"]
    pub memoryPoolSupportedHandleTypes: ::std::os::raw::c_uint,
    #[doc = "< 1 if the device supports deferred mapping CUDA arrays and CUDA mipmapped arrays"]
    pub deferredMappingCudaArraySupported: ::std::os::raw::c_int,
    #[doc = "< Device supports IPC Events."]
    pub ipcEventSupported: ::std::os::raw::c_int,
    #[doc = "< Indicates device supports cluster launch"]
    pub clusterLaunch: ::std::os::raw::c_int,
    #[doc = "< Indicates device supports unified pointers"]
    pub unifiedFunctionPointers: ::std::os::raw::c_int,
    #[doc = "< NUMA configuration of a device: value is of type ::cudaDeviceNumaConfig enum"]
    pub deviceNumaConfig: ::std::os::raw::c_int,
    #[doc = "< NUMA node ID of the GPU memory"]
    pub deviceNumaId: ::std::os::raw::c_int,
    #[doc = "< Indicates if contexts created on this device will be shared via MPS"]
    pub mpsEnabled: ::std::os::raw::c_int,
    #[doc = "< NUMA ID of the host node closest to the device or -1 when system does not support NUMA"]
    pub hostNumaId: ::std::os::raw::c_int,
    #[doc = "< The combined 16-bit PCI device ID and 16-bit PCI vendor ID"]
    pub gpuPciDeviceID: ::std::os::raw::c_uint,
    #[doc = "< The combined 16-bit PCI subsystem ID and 16-bit PCI subsystem vendor ID"]
    pub gpuPciSubsystemID: ::std::os::raw::c_uint,
    #[doc = "< 1 if the device supports HostNuma location IPC between nodes in a multi-node system."]
    pub hostNumaMultinodeIpcSupported: ::std::os::raw::c_int,
    #[doc = "< Reserved for future use"]
    pub reserved: [::std::os::raw::c_int; 56usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaDeviceProp"][::std::mem::size_of::<cudaDeviceProp>() - 1008usize];
    ["Alignment of cudaDeviceProp"][::std::mem::align_of::<cudaDeviceProp>() - 8usize];
    ["Offset of field: cudaDeviceProp::name"]
        [::std::mem::offset_of!(cudaDeviceProp, name) - 0usize];
    ["Offset of field: cudaDeviceProp::uuid"]
        [::std::mem::offset_of!(cudaDeviceProp, uuid) - 256usize];
    ["Offset of field: cudaDeviceProp::luid"]
        [::std::mem::offset_of!(cudaDeviceProp, luid) - 272usize];
    ["Offset of field: cudaDeviceProp::luidDeviceNodeMask"]
        [::std::mem::offset_of!(cudaDeviceProp, luidDeviceNodeMask) - 280usize];
    ["Offset of field: cudaDeviceProp::totalGlobalMem"]
        [::std::mem::offset_of!(cudaDeviceProp, totalGlobalMem) - 288usize];
    ["Offset of field: cudaDeviceProp::sharedMemPerBlock"]
        [::std::mem::offset_of!(cudaDeviceProp, sharedMemPerBlock) - 296usize];
    ["Offset of field: cudaDeviceProp::regsPerBlock"]
        [::std::mem::offset_of!(cudaDeviceProp, regsPerBlock) - 304usize];
    ["Offset of field: cudaDeviceProp::warpSize"]
        [::std::mem::offset_of!(cudaDeviceProp, warpSize) - 308usize];
    ["Offset of field: cudaDeviceProp::memPitch"]
        [::std::mem::offset_of!(cudaDeviceProp, memPitch) - 312usize];
    ["Offset of field: cudaDeviceProp::maxThreadsPerBlock"]
        [::std::mem::offset_of!(cudaDeviceProp, maxThreadsPerBlock) - 320usize];
    ["Offset of field: cudaDeviceProp::maxThreadsDim"]
        [::std::mem::offset_of!(cudaDeviceProp, maxThreadsDim) - 324usize];
    ["Offset of field: cudaDeviceProp::maxGridSize"]
        [::std::mem::offset_of!(cudaDeviceProp, maxGridSize) - 336usize];
    ["Offset of field: cudaDeviceProp::totalConstMem"]
        [::std::mem::offset_of!(cudaDeviceProp, totalConstMem) - 352usize];
    ["Offset of field: cudaDeviceProp::major"]
        [::std::mem::offset_of!(cudaDeviceProp, major) - 360usize];
    ["Offset of field: cudaDeviceProp::minor"]
        [::std::mem::offset_of!(cudaDeviceProp, minor) - 364usize];
    ["Offset of field: cudaDeviceProp::textureAlignment"]
        [::std::mem::offset_of!(cudaDeviceProp, textureAlignment) - 368usize];
    ["Offset of field: cudaDeviceProp::texturePitchAlignment"]
        [::std::mem::offset_of!(cudaDeviceProp, texturePitchAlignment) - 376usize];
    ["Offset of field: cudaDeviceProp::multiProcessorCount"]
        [::std::mem::offset_of!(cudaDeviceProp, multiProcessorCount) - 384usize];
    ["Offset of field: cudaDeviceProp::integrated"]
        [::std::mem::offset_of!(cudaDeviceProp, integrated) - 388usize];
    ["Offset of field: cudaDeviceProp::canMapHostMemory"]
        [::std::mem::offset_of!(cudaDeviceProp, canMapHostMemory) - 392usize];
    ["Offset of field: cudaDeviceProp::maxTexture1D"]
        [::std::mem::offset_of!(cudaDeviceProp, maxTexture1D) - 396usize];
    ["Offset of field: cudaDeviceProp::maxTexture1DMipmap"]
        [::std::mem::offset_of!(cudaDeviceProp, maxTexture1DMipmap) - 400usize];
    ["Offset of field: cudaDeviceProp::maxTexture2D"]
        [::std::mem::offset_of!(cudaDeviceProp, maxTexture2D) - 404usize];
    ["Offset of field: cudaDeviceProp::maxTexture2DMipmap"]
        [::std::mem::offset_of!(cudaDeviceProp, maxTexture2DMipmap) - 412usize];
    ["Offset of field: cudaDeviceProp::maxTexture2DLinear"]
        [::std::mem::offset_of!(cudaDeviceProp, maxTexture2DLinear) - 420usize];
    ["Offset of field: cudaDeviceProp::maxTexture2DGather"]
        [::std::mem::offset_of!(cudaDeviceProp, maxTexture2DGather) - 432usize];
    ["Offset of field: cudaDeviceProp::maxTexture3D"]
        [::std::mem::offset_of!(cudaDeviceProp, maxTexture3D) - 440usize];
    ["Offset of field: cudaDeviceProp::maxTexture3DAlt"]
        [::std::mem::offset_of!(cudaDeviceProp, maxTexture3DAlt) - 452usize];
    ["Offset of field: cudaDeviceProp::maxTextureCubemap"]
        [::std::mem::offset_of!(cudaDeviceProp, maxTextureCubemap) - 464usize];
    ["Offset of field: cudaDeviceProp::maxTexture1DLayered"]
        [::std::mem::offset_of!(cudaDeviceProp, maxTexture1DLayered) - 468usize];
    ["Offset of field: cudaDeviceProp::maxTexture2DLayered"]
        [::std::mem::offset_of!(cudaDeviceProp, maxTexture2DLayered) - 476usize];
    ["Offset of field: cudaDeviceProp::maxTextureCubemapLayered"]
        [::std::mem::offset_of!(cudaDeviceProp, maxTextureCubemapLayered) - 488usize];
    ["Offset of field: cudaDeviceProp::maxSurface1D"]
        [::std::mem::offset_of!(cudaDeviceProp, maxSurface1D) - 496usize];
    ["Offset of field: cudaDeviceProp::maxSurface2D"]
        [::std::mem::offset_of!(cudaDeviceProp, maxSurface2D) - 500usize];
    ["Offset of field: cudaDeviceProp::maxSurface3D"]
        [::std::mem::offset_of!(cudaDeviceProp, maxSurface3D) - 508usize];
    ["Offset of field: cudaDeviceProp::maxSurface1DLayered"]
        [::std::mem::offset_of!(cudaDeviceProp, maxSurface1DLayered) - 520usize];
    ["Offset of field: cudaDeviceProp::maxSurface2DLayered"]
        [::std::mem::offset_of!(cudaDeviceProp, maxSurface2DLayered) - 528usize];
    ["Offset of field: cudaDeviceProp::maxSurfaceCubemap"]
        [::std::mem::offset_of!(cudaDeviceProp, maxSurfaceCubemap) - 540usize];
    ["Offset of field: cudaDeviceProp::maxSurfaceCubemapLayered"]
        [::std::mem::offset_of!(cudaDeviceProp, maxSurfaceCubemapLayered) - 544usize];
    ["Offset of field: cudaDeviceProp::surfaceAlignment"]
        [::std::mem::offset_of!(cudaDeviceProp, surfaceAlignment) - 552usize];
    ["Offset of field: cudaDeviceProp::concurrentKernels"]
        [::std::mem::offset_of!(cudaDeviceProp, concurrentKernels) - 560usize];
    ["Offset of field: cudaDeviceProp::ECCEnabled"]
        [::std::mem::offset_of!(cudaDeviceProp, ECCEnabled) - 564usize];
    ["Offset of field: cudaDeviceProp::pciBusID"]
        [::std::mem::offset_of!(cudaDeviceProp, pciBusID) - 568usize];
    ["Offset of field: cudaDeviceProp::pciDeviceID"]
        [::std::mem::offset_of!(cudaDeviceProp, pciDeviceID) - 572usize];
    ["Offset of field: cudaDeviceProp::pciDomainID"]
        [::std::mem::offset_of!(cudaDeviceProp, pciDomainID) - 576usize];
    ["Offset of field: cudaDeviceProp::tccDriver"]
        [::std::mem::offset_of!(cudaDeviceProp, tccDriver) - 580usize];
    ["Offset of field: cudaDeviceProp::asyncEngineCount"]
        [::std::mem::offset_of!(cudaDeviceProp, asyncEngineCount) - 584usize];
    ["Offset of field: cudaDeviceProp::unifiedAddressing"]
        [::std::mem::offset_of!(cudaDeviceProp, unifiedAddressing) - 588usize];
    ["Offset of field: cudaDeviceProp::memoryBusWidth"]
        [::std::mem::offset_of!(cudaDeviceProp, memoryBusWidth) - 592usize];
    ["Offset of field: cudaDeviceProp::l2CacheSize"]
        [::std::mem::offset_of!(cudaDeviceProp, l2CacheSize) - 596usize];
    ["Offset of field: cudaDeviceProp::persistingL2CacheMaxSize"]
        [::std::mem::offset_of!(cudaDeviceProp, persistingL2CacheMaxSize) - 600usize];
    ["Offset of field: cudaDeviceProp::maxThreadsPerMultiProcessor"]
        [::std::mem::offset_of!(cudaDeviceProp, maxThreadsPerMultiProcessor) - 604usize];
    ["Offset of field: cudaDeviceProp::streamPrioritiesSupported"]
        [::std::mem::offset_of!(cudaDeviceProp, streamPrioritiesSupported) - 608usize];
    ["Offset of field: cudaDeviceProp::globalL1CacheSupported"]
        [::std::mem::offset_of!(cudaDeviceProp, globalL1CacheSupported) - 612usize];
    ["Offset of field: cudaDeviceProp::localL1CacheSupported"]
        [::std::mem::offset_of!(cudaDeviceProp, localL1CacheSupported) - 616usize];
    ["Offset of field: cudaDeviceProp::sharedMemPerMultiprocessor"]
        [::std::mem::offset_of!(cudaDeviceProp, sharedMemPerMultiprocessor) - 624usize];
    ["Offset of field: cudaDeviceProp::regsPerMultiprocessor"]
        [::std::mem::offset_of!(cudaDeviceProp, regsPerMultiprocessor) - 632usize];
    ["Offset of field: cudaDeviceProp::managedMemory"]
        [::std::mem::offset_of!(cudaDeviceProp, managedMemory) - 636usize];
    ["Offset of field: cudaDeviceProp::isMultiGpuBoard"]
        [::std::mem::offset_of!(cudaDeviceProp, isMultiGpuBoard) - 640usize];
    ["Offset of field: cudaDeviceProp::multiGpuBoardGroupID"]
        [::std::mem::offset_of!(cudaDeviceProp, multiGpuBoardGroupID) - 644usize];
    ["Offset of field: cudaDeviceProp::hostNativeAtomicSupported"]
        [::std::mem::offset_of!(cudaDeviceProp, hostNativeAtomicSupported) - 648usize];
    ["Offset of field: cudaDeviceProp::pageableMemoryAccess"]
        [::std::mem::offset_of!(cudaDeviceProp, pageableMemoryAccess) - 652usize];
    ["Offset of field: cudaDeviceProp::concurrentManagedAccess"]
        [::std::mem::offset_of!(cudaDeviceProp, concurrentManagedAccess) - 656usize];
    ["Offset of field: cudaDeviceProp::computePreemptionSupported"]
        [::std::mem::offset_of!(cudaDeviceProp, computePreemptionSupported) - 660usize];
    ["Offset of field: cudaDeviceProp::canUseHostPointerForRegisteredMem"]
        [::std::mem::offset_of!(cudaDeviceProp, canUseHostPointerForRegisteredMem) - 664usize];
    ["Offset of field: cudaDeviceProp::cooperativeLaunch"]
        [::std::mem::offset_of!(cudaDeviceProp, cooperativeLaunch) - 668usize];
    ["Offset of field: cudaDeviceProp::sharedMemPerBlockOptin"]
        [::std::mem::offset_of!(cudaDeviceProp, sharedMemPerBlockOptin) - 672usize];
    ["Offset of field: cudaDeviceProp::pageableMemoryAccessUsesHostPageTables"]
        [::std::mem::offset_of!(cudaDeviceProp, pageableMemoryAccessUsesHostPageTables) - 680usize];
    ["Offset of field: cudaDeviceProp::directManagedMemAccessFromHost"]
        [::std::mem::offset_of!(cudaDeviceProp, directManagedMemAccessFromHost) - 684usize];
    ["Offset of field: cudaDeviceProp::maxBlocksPerMultiProcessor"]
        [::std::mem::offset_of!(cudaDeviceProp, maxBlocksPerMultiProcessor) - 688usize];
    ["Offset of field: cudaDeviceProp::accessPolicyMaxWindowSize"]
        [::std::mem::offset_of!(cudaDeviceProp, accessPolicyMaxWindowSize) - 692usize];
    ["Offset of field: cudaDeviceProp::reservedSharedMemPerBlock"]
        [::std::mem::offset_of!(cudaDeviceProp, reservedSharedMemPerBlock) - 696usize];
    ["Offset of field: cudaDeviceProp::hostRegisterSupported"]
        [::std::mem::offset_of!(cudaDeviceProp, hostRegisterSupported) - 704usize];
    ["Offset of field: cudaDeviceProp::sparseCudaArraySupported"]
        [::std::mem::offset_of!(cudaDeviceProp, sparseCudaArraySupported) - 708usize];
    ["Offset of field: cudaDeviceProp::hostRegisterReadOnlySupported"]
        [::std::mem::offset_of!(cudaDeviceProp, hostRegisterReadOnlySupported) - 712usize];
    ["Offset of field: cudaDeviceProp::timelineSemaphoreInteropSupported"]
        [::std::mem::offset_of!(cudaDeviceProp, timelineSemaphoreInteropSupported) - 716usize];
    ["Offset of field: cudaDeviceProp::memoryPoolsSupported"]
        [::std::mem::offset_of!(cudaDeviceProp, memoryPoolsSupported) - 720usize];
    ["Offset of field: cudaDeviceProp::gpuDirectRDMASupported"]
        [::std::mem::offset_of!(cudaDeviceProp, gpuDirectRDMASupported) - 724usize];
    ["Offset of field: cudaDeviceProp::gpuDirectRDMAFlushWritesOptions"]
        [::std::mem::offset_of!(cudaDeviceProp, gpuDirectRDMAFlushWritesOptions) - 728usize];
    ["Offset of field: cudaDeviceProp::gpuDirectRDMAWritesOrdering"]
        [::std::mem::offset_of!(cudaDeviceProp, gpuDirectRDMAWritesOrdering) - 732usize];
    ["Offset of field: cudaDeviceProp::memoryPoolSupportedHandleTypes"]
        [::std::mem::offset_of!(cudaDeviceProp, memoryPoolSupportedHandleTypes) - 736usize];
    ["Offset of field: cudaDeviceProp::deferredMappingCudaArraySupported"]
        [::std::mem::offset_of!(cudaDeviceProp, deferredMappingCudaArraySupported) - 740usize];
    ["Offset of field: cudaDeviceProp::ipcEventSupported"]
        [::std::mem::offset_of!(cudaDeviceProp, ipcEventSupported) - 744usize];
    ["Offset of field: cudaDeviceProp::clusterLaunch"]
        [::std::mem::offset_of!(cudaDeviceProp, clusterLaunch) - 748usize];
    ["Offset of field: cudaDeviceProp::unifiedFunctionPointers"]
        [::std::mem::offset_of!(cudaDeviceProp, unifiedFunctionPointers) - 752usize];
    ["Offset of field: cudaDeviceProp::deviceNumaConfig"]
        [::std::mem::offset_of!(cudaDeviceProp, deviceNumaConfig) - 756usize];
    ["Offset of field: cudaDeviceProp::deviceNumaId"]
        [::std::mem::offset_of!(cudaDeviceProp, deviceNumaId) - 760usize];
    ["Offset of field: cudaDeviceProp::mpsEnabled"]
        [::std::mem::offset_of!(cudaDeviceProp, mpsEnabled) - 764usize];
    ["Offset of field: cudaDeviceProp::hostNumaId"]
        [::std::mem::offset_of!(cudaDeviceProp, hostNumaId) - 768usize];
    ["Offset of field: cudaDeviceProp::gpuPciDeviceID"]
        [::std::mem::offset_of!(cudaDeviceProp, gpuPciDeviceID) - 772usize];
    ["Offset of field: cudaDeviceProp::gpuPciSubsystemID"]
        [::std::mem::offset_of!(cudaDeviceProp, gpuPciSubsystemID) - 776usize];
    ["Offset of field: cudaDeviceProp::hostNumaMultinodeIpcSupported"]
        [::std::mem::offset_of!(cudaDeviceProp, hostNumaMultinodeIpcSupported) - 780usize];
    ["Offset of field: cudaDeviceProp::reserved"]
        [::std::mem::offset_of!(cudaDeviceProp, reserved) - 784usize];
};
#[doc = " CUDA IPC event handle"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaIpcEventHandle_st {
    pub reserved: [::std::os::raw::c_char; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaIpcEventHandle_st"][::std::mem::size_of::<cudaIpcEventHandle_st>() - 64usize];
    ["Alignment of cudaIpcEventHandle_st"]
        [::std::mem::align_of::<cudaIpcEventHandle_st>() - 1usize];
    ["Offset of field: cudaIpcEventHandle_st::reserved"]
        [::std::mem::offset_of!(cudaIpcEventHandle_st, reserved) - 0usize];
};
#[doc = " CUDA IPC event handle"]
pub type cudaIpcEventHandle_t = cudaIpcEventHandle_st;
#[doc = " CUDA IPC memory handle"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaIpcMemHandle_st {
    pub reserved: [::std::os::raw::c_char; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaIpcMemHandle_st"][::std::mem::size_of::<cudaIpcMemHandle_st>() - 64usize];
    ["Alignment of cudaIpcMemHandle_st"][::std::mem::align_of::<cudaIpcMemHandle_st>() - 1usize];
    ["Offset of field: cudaIpcMemHandle_st::reserved"]
        [::std::mem::offset_of!(cudaIpcMemHandle_st, reserved) - 0usize];
};
#[doc = " CUDA IPC memory handle"]
pub type cudaIpcMemHandle_t = cudaIpcMemHandle_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaMemFabricHandle_st {
    pub reserved: [::std::os::raw::c_char; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaMemFabricHandle_st"][::std::mem::size_of::<cudaMemFabricHandle_st>() - 64usize];
    ["Alignment of cudaMemFabricHandle_st"]
        [::std::mem::align_of::<cudaMemFabricHandle_st>() - 1usize];
    ["Offset of field: cudaMemFabricHandle_st::reserved"]
        [::std::mem::offset_of!(cudaMemFabricHandle_st, reserved) - 0usize];
};
pub type cudaMemFabricHandle_t = cudaMemFabricHandle_st;
#[doc = " Handle is an opaque file descriptor"]
pub const cudaExternalMemoryHandleType_cudaExternalMemoryHandleTypeOpaqueFd:
    cudaExternalMemoryHandleType = 1;
#[doc = " Handle is an opaque shared NT handle"]
pub const cudaExternalMemoryHandleType_cudaExternalMemoryHandleTypeOpaqueWin32:
    cudaExternalMemoryHandleType = 2;
#[doc = " Handle is an opaque, globally shared handle"]
pub const cudaExternalMemoryHandleType_cudaExternalMemoryHandleTypeOpaqueWin32Kmt:
    cudaExternalMemoryHandleType = 3;
#[doc = " Handle is a D3D12 heap object"]
pub const cudaExternalMemoryHandleType_cudaExternalMemoryHandleTypeD3D12Heap:
    cudaExternalMemoryHandleType = 4;
#[doc = " Handle is a D3D12 committed resource"]
pub const cudaExternalMemoryHandleType_cudaExternalMemoryHandleTypeD3D12Resource:
    cudaExternalMemoryHandleType = 5;
#[doc = "  Handle is a shared NT handle to a D3D11 resource"]
pub const cudaExternalMemoryHandleType_cudaExternalMemoryHandleTypeD3D11Resource:
    cudaExternalMemoryHandleType = 6;
#[doc = "  Handle is a globally shared handle to a D3D11 resource"]
pub const cudaExternalMemoryHandleType_cudaExternalMemoryHandleTypeD3D11ResourceKmt:
    cudaExternalMemoryHandleType = 7;
#[doc = "  Handle is an NvSciBuf object"]
pub const cudaExternalMemoryHandleType_cudaExternalMemoryHandleTypeNvSciBuf:
    cudaExternalMemoryHandleType = 8;
#[doc = " External memory handle types"]
pub type cudaExternalMemoryHandleType = ::std::os::raw::c_uint;
#[doc = " External memory handle descriptor"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct cudaExternalMemoryHandleDesc {
    #[doc = " Type of the handle"]
    pub type_: cudaExternalMemoryHandleType,
    pub handle: cudaExternalMemoryHandleDesc__bindgen_ty_1,
    #[doc = " Size of the memory allocation"]
    pub size: ::std::os::raw::c_ulonglong,
    #[doc = " Flags must either be zero or ::cudaExternalMemoryDedicated"]
    pub flags: ::std::os::raw::c_uint,
    #[doc = " Must be zero"]
    pub reserved: [::std::os::raw::c_uint; 16usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union cudaExternalMemoryHandleDesc__bindgen_ty_1 {
    #[doc = " File descriptor referencing the memory object. Valid\n when type is\n ::cudaExternalMemoryHandleTypeOpaqueFd"]
    pub fd: ::std::os::raw::c_int,
    pub win32: cudaExternalMemoryHandleDesc__bindgen_ty_1__bindgen_ty_1,
    #[doc = " A handle representing NvSciBuf Object. Valid when type\n is ::cudaExternalMemoryHandleTypeNvSciBuf"]
    pub nvSciBufObject: *const ::std::os::raw::c_void,
}
#[doc = " Win32 handle referencing the semaphore object. Valid when\n type is one of the following:\n - ::cudaExternalMemoryHandleTypeOpaqueWin32\n - ::cudaExternalMemoryHandleTypeOpaqueWin32Kmt\n - ::cudaExternalMemoryHandleTypeD3D12Heap\n - ::cudaExternalMemoryHandleTypeD3D12Resource\n - ::cudaExternalMemoryHandleTypeD3D11Resource\n - ::cudaExternalMemoryHandleTypeD3D11ResourceKmt\n Exactly one of 'handle' and 'name' must be non-NULL. If\n type is one of the following:\n ::cudaExternalMemoryHandleTypeOpaqueWin32Kmt\n ::cudaExternalMemoryHandleTypeD3D11ResourceKmt\n then 'name' must be NULL."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaExternalMemoryHandleDesc__bindgen_ty_1__bindgen_ty_1 {
    #[doc = " Valid NT handle. Must be NULL if 'name' is non-NULL"]
    pub handle: *mut ::std::os::raw::c_void,
    #[doc = " Name of a valid memory object.\n Must be NULL if 'handle' is non-NULL."]
    pub name: *const ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaExternalMemoryHandleDesc__bindgen_ty_1__bindgen_ty_1"][::std::mem::size_of::<
        cudaExternalMemoryHandleDesc__bindgen_ty_1__bindgen_ty_1,
    >() - 16usize];
    ["Alignment of cudaExternalMemoryHandleDesc__bindgen_ty_1__bindgen_ty_1"][::std::mem::align_of::<
        cudaExternalMemoryHandleDesc__bindgen_ty_1__bindgen_ty_1,
    >() - 8usize];
    ["Offset of field: cudaExternalMemoryHandleDesc__bindgen_ty_1__bindgen_ty_1::handle"][::std::mem::offset_of!(
        cudaExternalMemoryHandleDesc__bindgen_ty_1__bindgen_ty_1,
        handle
    )
        - 0usize];
    ["Offset of field: cudaExternalMemoryHandleDesc__bindgen_ty_1__bindgen_ty_1::name"][::std::mem::offset_of!(
        cudaExternalMemoryHandleDesc__bindgen_ty_1__bindgen_ty_1,
        name
    ) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaExternalMemoryHandleDesc__bindgen_ty_1"]
        [::std::mem::size_of::<cudaExternalMemoryHandleDesc__bindgen_ty_1>() - 16usize];
    ["Alignment of cudaExternalMemoryHandleDesc__bindgen_ty_1"]
        [::std::mem::align_of::<cudaExternalMemoryHandleDesc__bindgen_ty_1>() - 8usize];
    ["Offset of field: cudaExternalMemoryHandleDesc__bindgen_ty_1::fd"]
        [::std::mem::offset_of!(cudaExternalMemoryHandleDesc__bindgen_ty_1, fd) - 0usize];
    ["Offset of field: cudaExternalMemoryHandleDesc__bindgen_ty_1::win32"]
        [::std::mem::offset_of!(cudaExternalMemoryHandleDesc__bindgen_ty_1, win32) - 0usize];
    ["Offset of field: cudaExternalMemoryHandleDesc__bindgen_ty_1::nvSciBufObject"][::std::mem::offset_of!(
        cudaExternalMemoryHandleDesc__bindgen_ty_1,
        nvSciBufObject
    ) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaExternalMemoryHandleDesc"]
        [::std::mem::size_of::<cudaExternalMemoryHandleDesc>() - 104usize];
    ["Alignment of cudaExternalMemoryHandleDesc"]
        [::std::mem::align_of::<cudaExternalMemoryHandleDesc>() - 8usize];
    ["Offset of field: cudaExternalMemoryHandleDesc::type_"]
        [::std::mem::offset_of!(cudaExternalMemoryHandleDesc, type_) - 0usize];
    ["Offset of field: cudaExternalMemoryHandleDesc::handle"]
        [::std::mem::offset_of!(cudaExternalMemoryHandleDesc, handle) - 8usize];
    ["Offset of field: cudaExternalMemoryHandleDesc::size"]
        [::std::mem::offset_of!(cudaExternalMemoryHandleDesc, size) - 24usize];
    ["Offset of field: cudaExternalMemoryHandleDesc::flags"]
        [::std::mem::offset_of!(cudaExternalMemoryHandleDesc, flags) - 32usize];
    ["Offset of field: cudaExternalMemoryHandleDesc::reserved"]
        [::std::mem::offset_of!(cudaExternalMemoryHandleDesc, reserved) - 36usize];
};
#[doc = " External memory buffer descriptor"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaExternalMemoryBufferDesc {
    #[doc = " Offset into the memory object where the buffer's base is"]
    pub offset: ::std::os::raw::c_ulonglong,
    #[doc = " Size of the buffer"]
    pub size: ::std::os::raw::c_ulonglong,
    #[doc = " Flags reserved for future use. Must be zero."]
    pub flags: ::std::os::raw::c_uint,
    #[doc = " Must be zero"]
    pub reserved: [::std::os::raw::c_uint; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaExternalMemoryBufferDesc"]
        [::std::mem::size_of::<cudaExternalMemoryBufferDesc>() - 88usize];
    ["Alignment of cudaExternalMemoryBufferDesc"]
        [::std::mem::align_of::<cudaExternalMemoryBufferDesc>() - 8usize];
    ["Offset of field: cudaExternalMemoryBufferDesc::offset"]
        [::std::mem::offset_of!(cudaExternalMemoryBufferDesc, offset) - 0usize];
    ["Offset of field: cudaExternalMemoryBufferDesc::size"]
        [::std::mem::offset_of!(cudaExternalMemoryBufferDesc, size) - 8usize];
    ["Offset of field: cudaExternalMemoryBufferDesc::flags"]
        [::std::mem::offset_of!(cudaExternalMemoryBufferDesc, flags) - 16usize];
    ["Offset of field: cudaExternalMemoryBufferDesc::reserved"]
        [::std::mem::offset_of!(cudaExternalMemoryBufferDesc, reserved) - 20usize];
};
#[doc = " External memory mipmap descriptor"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaExternalMemoryMipmappedArrayDesc {
    #[doc = " Offset into the memory object where the base level of the\n mipmap chain is."]
    pub offset: ::std::os::raw::c_ulonglong,
    #[doc = " Format of base level of the mipmap chain"]
    pub formatDesc: cudaChannelFormatDesc,
    #[doc = " Dimensions of base level of the mipmap chain"]
    pub extent: cudaExtent,
    #[doc = " Flags associated with CUDA mipmapped arrays.\n See ::cudaMallocMipmappedArray"]
    pub flags: ::std::os::raw::c_uint,
    #[doc = " Total number of levels in the mipmap chain"]
    pub numLevels: ::std::os::raw::c_uint,
    #[doc = " Must be zero"]
    pub reserved: [::std::os::raw::c_uint; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaExternalMemoryMipmappedArrayDesc"]
        [::std::mem::size_of::<cudaExternalMemoryMipmappedArrayDesc>() - 128usize];
    ["Alignment of cudaExternalMemoryMipmappedArrayDesc"]
        [::std::mem::align_of::<cudaExternalMemoryMipmappedArrayDesc>() - 8usize];
    ["Offset of field: cudaExternalMemoryMipmappedArrayDesc::offset"]
        [::std::mem::offset_of!(cudaExternalMemoryMipmappedArrayDesc, offset) - 0usize];
    ["Offset of field: cudaExternalMemoryMipmappedArrayDesc::formatDesc"]
        [::std::mem::offset_of!(cudaExternalMemoryMipmappedArrayDesc, formatDesc) - 8usize];
    ["Offset of field: cudaExternalMemoryMipmappedArrayDesc::extent"]
        [::std::mem::offset_of!(cudaExternalMemoryMipmappedArrayDesc, extent) - 32usize];
    ["Offset of field: cudaExternalMemoryMipmappedArrayDesc::flags"]
        [::std::mem::offset_of!(cudaExternalMemoryMipmappedArrayDesc, flags) - 56usize];
    ["Offset of field: cudaExternalMemoryMipmappedArrayDesc::numLevels"]
        [::std::mem::offset_of!(cudaExternalMemoryMipmappedArrayDesc, numLevels) - 60usize];
    ["Offset of field: cudaExternalMemoryMipmappedArrayDesc::reserved"]
        [::std::mem::offset_of!(cudaExternalMemoryMipmappedArrayDesc, reserved) - 64usize];
};
#[doc = " Handle is an opaque file descriptor"]
pub const cudaExternalSemaphoreHandleType_cudaExternalSemaphoreHandleTypeOpaqueFd:
    cudaExternalSemaphoreHandleType = 1;
#[doc = " Handle is an opaque shared NT handle"]
pub const cudaExternalSemaphoreHandleType_cudaExternalSemaphoreHandleTypeOpaqueWin32:
    cudaExternalSemaphoreHandleType = 2;
#[doc = " Handle is an opaque, globally shared handle"]
pub const cudaExternalSemaphoreHandleType_cudaExternalSemaphoreHandleTypeOpaqueWin32Kmt:
    cudaExternalSemaphoreHandleType = 3;
#[doc = " Handle is a shared NT handle referencing a D3D12 fence object"]
pub const cudaExternalSemaphoreHandleType_cudaExternalSemaphoreHandleTypeD3D12Fence:
    cudaExternalSemaphoreHandleType = 4;
#[doc = " Handle is a shared NT handle referencing a D3D11 fence object"]
pub const cudaExternalSemaphoreHandleType_cudaExternalSemaphoreHandleTypeD3D11Fence:
    cudaExternalSemaphoreHandleType = 5;
#[doc = " Opaque handle to NvSciSync Object"]
pub const cudaExternalSemaphoreHandleType_cudaExternalSemaphoreHandleTypeNvSciSync:
    cudaExternalSemaphoreHandleType = 6;
#[doc = " Handle is a shared NT handle referencing a D3D11 keyed mutex object"]
pub const cudaExternalSemaphoreHandleType_cudaExternalSemaphoreHandleTypeKeyedMutex:
    cudaExternalSemaphoreHandleType = 7;
#[doc = " Handle is a shared KMT handle referencing a D3D11 keyed mutex object"]
pub const cudaExternalSemaphoreHandleType_cudaExternalSemaphoreHandleTypeKeyedMutexKmt:
    cudaExternalSemaphoreHandleType = 8;
#[doc = " Handle is an opaque handle file descriptor referencing a timeline semaphore"]
pub const cudaExternalSemaphoreHandleType_cudaExternalSemaphoreHandleTypeTimelineSemaphoreFd:
    cudaExternalSemaphoreHandleType = 9;
#[doc = " Handle is an opaque handle file descriptor referencing a timeline semaphore"]
pub const cudaExternalSemaphoreHandleType_cudaExternalSemaphoreHandleTypeTimelineSemaphoreWin32:
    cudaExternalSemaphoreHandleType = 10;
#[doc = " External semaphore handle types"]
pub type cudaExternalSemaphoreHandleType = ::std::os::raw::c_uint;
#[doc = " External semaphore handle descriptor"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct cudaExternalSemaphoreHandleDesc {
    #[doc = " Type of the handle"]
    pub type_: cudaExternalSemaphoreHandleType,
    pub handle: cudaExternalSemaphoreHandleDesc__bindgen_ty_1,
    #[doc = " Flags reserved for the future. Must be zero."]
    pub flags: ::std::os::raw::c_uint,
    #[doc = " Must be zero"]
    pub reserved: [::std::os::raw::c_uint; 16usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union cudaExternalSemaphoreHandleDesc__bindgen_ty_1 {
    #[doc = " File descriptor referencing the semaphore object. Valid when\n type is one of the following:\n - ::cudaExternalSemaphoreHandleTypeOpaqueFd\n - ::cudaExternalSemaphoreHandleTypeTimelineSemaphoreFd"]
    pub fd: ::std::os::raw::c_int,
    pub win32: cudaExternalSemaphoreHandleDesc__bindgen_ty_1__bindgen_ty_1,
    #[doc = " Valid NvSciSyncObj. Must be non NULL"]
    pub nvSciSyncObj: *const ::std::os::raw::c_void,
}
#[doc = " Win32 handle referencing the semaphore object. Valid when\n type is one of the following:\n - ::cudaExternalSemaphoreHandleTypeOpaqueWin32\n - ::cudaExternalSemaphoreHandleTypeOpaqueWin32Kmt\n - ::cudaExternalSemaphoreHandleTypeD3D12Fence\n - ::cudaExternalSemaphoreHandleTypeD3D11Fence\n - ::cudaExternalSemaphoreHandleTypeKeyedMutex\n - ::cudaExternalSemaphoreHandleTypeTimelineSemaphoreWin32\n Exactly one of 'handle' and 'name' must be non-NULL. If\n type is one of the following:\n ::cudaExternalSemaphoreHandleTypeOpaqueWin32Kmt\n ::cudaExternalSemaphoreHandleTypeKeyedMutexKmt\n then 'name' must be NULL."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaExternalSemaphoreHandleDesc__bindgen_ty_1__bindgen_ty_1 {
    #[doc = " Valid NT handle. Must be NULL if 'name' is non-NULL"]
    pub handle: *mut ::std::os::raw::c_void,
    #[doc = " Name of a valid synchronization primitive.\n Must be NULL if 'handle' is non-NULL."]
    pub name: *const ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaExternalSemaphoreHandleDesc__bindgen_ty_1__bindgen_ty_1"][::std::mem::size_of::<
        cudaExternalSemaphoreHandleDesc__bindgen_ty_1__bindgen_ty_1,
    >() - 16usize];
    ["Alignment of cudaExternalSemaphoreHandleDesc__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<cudaExternalSemaphoreHandleDesc__bindgen_ty_1__bindgen_ty_1>()
            - 8usize];
    ["Offset of field: cudaExternalSemaphoreHandleDesc__bindgen_ty_1__bindgen_ty_1::handle"][::std::mem::offset_of!(
        cudaExternalSemaphoreHandleDesc__bindgen_ty_1__bindgen_ty_1,
        handle
    )
        - 0usize];
    ["Offset of field: cudaExternalSemaphoreHandleDesc__bindgen_ty_1__bindgen_ty_1::name"][::std::mem::offset_of!(
        cudaExternalSemaphoreHandleDesc__bindgen_ty_1__bindgen_ty_1,
        name
    )
        - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaExternalSemaphoreHandleDesc__bindgen_ty_1"]
        [::std::mem::size_of::<cudaExternalSemaphoreHandleDesc__bindgen_ty_1>() - 16usize];
    ["Alignment of cudaExternalSemaphoreHandleDesc__bindgen_ty_1"]
        [::std::mem::align_of::<cudaExternalSemaphoreHandleDesc__bindgen_ty_1>() - 8usize];
    ["Offset of field: cudaExternalSemaphoreHandleDesc__bindgen_ty_1::fd"]
        [::std::mem::offset_of!(cudaExternalSemaphoreHandleDesc__bindgen_ty_1, fd) - 0usize];
    ["Offset of field: cudaExternalSemaphoreHandleDesc__bindgen_ty_1::win32"]
        [::std::mem::offset_of!(cudaExternalSemaphoreHandleDesc__bindgen_ty_1, win32) - 0usize];
    ["Offset of field: cudaExternalSemaphoreHandleDesc__bindgen_ty_1::nvSciSyncObj"][::std::mem::offset_of!(
        cudaExternalSemaphoreHandleDesc__bindgen_ty_1,
        nvSciSyncObj
    ) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaExternalSemaphoreHandleDesc"]
        [::std::mem::size_of::<cudaExternalSemaphoreHandleDesc>() - 96usize];
    ["Alignment of cudaExternalSemaphoreHandleDesc"]
        [::std::mem::align_of::<cudaExternalSemaphoreHandleDesc>() - 8usize];
    ["Offset of field: cudaExternalSemaphoreHandleDesc::type_"]
        [::std::mem::offset_of!(cudaExternalSemaphoreHandleDesc, type_) - 0usize];
    ["Offset of field: cudaExternalSemaphoreHandleDesc::handle"]
        [::std::mem::offset_of!(cudaExternalSemaphoreHandleDesc, handle) - 8usize];
    ["Offset of field: cudaExternalSemaphoreHandleDesc::flags"]
        [::std::mem::offset_of!(cudaExternalSemaphoreHandleDesc, flags) - 24usize];
    ["Offset of field: cudaExternalSemaphoreHandleDesc::reserved"]
        [::std::mem::offset_of!(cudaExternalSemaphoreHandleDesc, reserved) - 28usize];
};
#[doc = " External semaphore signal parameters, compatible with driver type"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct cudaExternalSemaphoreSignalParams {
    pub params: cudaExternalSemaphoreSignalParams__bindgen_ty_1,
    #[doc = " Only when ::cudaExternalSemaphoreSignalParams is used to\n signal a ::cudaExternalSemaphore_t of type\n ::cudaExternalSemaphoreHandleTypeNvSciSync, the valid flag is\n ::cudaExternalSemaphoreSignalSkipNvSciBufMemSync: which indicates\n that while signaling the ::cudaExternalSemaphore_t, no memory\n synchronization operations should be performed for any external memory\n object imported as ::cudaExternalMemoryHandleTypeNvSciBuf.\n For all other types of ::cudaExternalSemaphore_t, flags must be zero."]
    pub flags: ::std::os::raw::c_uint,
    pub reserved: [::std::os::raw::c_uint; 16usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct cudaExternalSemaphoreSignalParams__bindgen_ty_1 {
    pub fence: cudaExternalSemaphoreSignalParams__bindgen_ty_1__bindgen_ty_1,
    pub nvSciSync: cudaExternalSemaphoreSignalParams__bindgen_ty_1__bindgen_ty_2,
    pub keyedMutex: cudaExternalSemaphoreSignalParams__bindgen_ty_1__bindgen_ty_3,
    pub reserved: [::std::os::raw::c_uint; 12usize],
}
#[doc = " Parameters for fence objects"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaExternalSemaphoreSignalParams__bindgen_ty_1__bindgen_ty_1 {
    #[doc = " Value of fence to be signaled"]
    pub value: ::std::os::raw::c_ulonglong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaExternalSemaphoreSignalParams__bindgen_ty_1__bindgen_ty_1"][::std::mem::size_of::<
        cudaExternalSemaphoreSignalParams__bindgen_ty_1__bindgen_ty_1,
    >() - 8usize];
    ["Alignment of cudaExternalSemaphoreSignalParams__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<cudaExternalSemaphoreSignalParams__bindgen_ty_1__bindgen_ty_1>()
            - 8usize];
    ["Offset of field: cudaExternalSemaphoreSignalParams__bindgen_ty_1__bindgen_ty_1::value"][::std::mem::offset_of!(
        cudaExternalSemaphoreSignalParams__bindgen_ty_1__bindgen_ty_1,
        value
    )
        - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union cudaExternalSemaphoreSignalParams__bindgen_ty_1__bindgen_ty_2 {
    #[doc = " Pointer to NvSciSyncFence. Valid if ::cudaExternalSemaphoreHandleType\n is of type ::cudaExternalSemaphoreHandleTypeNvSciSync."]
    pub fence: *mut ::std::os::raw::c_void,
    pub reserved: ::std::os::raw::c_ulonglong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaExternalSemaphoreSignalParams__bindgen_ty_1__bindgen_ty_2"][::std::mem::size_of::<
        cudaExternalSemaphoreSignalParams__bindgen_ty_1__bindgen_ty_2,
    >() - 8usize];
    ["Alignment of cudaExternalSemaphoreSignalParams__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<cudaExternalSemaphoreSignalParams__bindgen_ty_1__bindgen_ty_2>()
            - 8usize];
    ["Offset of field: cudaExternalSemaphoreSignalParams__bindgen_ty_1__bindgen_ty_2::fence"][::std::mem::offset_of!(
        cudaExternalSemaphoreSignalParams__bindgen_ty_1__bindgen_ty_2,
        fence
    )
        - 0usize];
    ["Offset of field: cudaExternalSemaphoreSignalParams__bindgen_ty_1__bindgen_ty_2::reserved"][::std::mem::offset_of!(
        cudaExternalSemaphoreSignalParams__bindgen_ty_1__bindgen_ty_2,
        reserved
    )
        - 0usize];
};
#[doc = " Parameters for keyed mutex objects"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaExternalSemaphoreSignalParams__bindgen_ty_1__bindgen_ty_3 {
    pub key: ::std::os::raw::c_ulonglong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaExternalSemaphoreSignalParams__bindgen_ty_1__bindgen_ty_3"][::std::mem::size_of::<
        cudaExternalSemaphoreSignalParams__bindgen_ty_1__bindgen_ty_3,
    >() - 8usize];
    ["Alignment of cudaExternalSemaphoreSignalParams__bindgen_ty_1__bindgen_ty_3"]
        [::std::mem::align_of::<cudaExternalSemaphoreSignalParams__bindgen_ty_1__bindgen_ty_3>()
            - 8usize];
    ["Offset of field: cudaExternalSemaphoreSignalParams__bindgen_ty_1__bindgen_ty_3::key"][::std::mem::offset_of!(
        cudaExternalSemaphoreSignalParams__bindgen_ty_1__bindgen_ty_3,
        key
    )
        - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaExternalSemaphoreSignalParams__bindgen_ty_1"]
        [::std::mem::size_of::<cudaExternalSemaphoreSignalParams__bindgen_ty_1>() - 72usize];
    ["Alignment of cudaExternalSemaphoreSignalParams__bindgen_ty_1"]
        [::std::mem::align_of::<cudaExternalSemaphoreSignalParams__bindgen_ty_1>() - 8usize];
    ["Offset of field: cudaExternalSemaphoreSignalParams__bindgen_ty_1::fence"]
        [::std::mem::offset_of!(cudaExternalSemaphoreSignalParams__bindgen_ty_1, fence) - 0usize];
    ["Offset of field: cudaExternalSemaphoreSignalParams__bindgen_ty_1::nvSciSync"][::std::mem::offset_of!(
        cudaExternalSemaphoreSignalParams__bindgen_ty_1,
        nvSciSync
    ) - 8usize];
    ["Offset of field: cudaExternalSemaphoreSignalParams__bindgen_ty_1::keyedMutex"][::std::mem::offset_of!(
        cudaExternalSemaphoreSignalParams__bindgen_ty_1,
        keyedMutex
    ) - 16usize];
    ["Offset of field: cudaExternalSemaphoreSignalParams__bindgen_ty_1::reserved"][::std::mem::offset_of!(
        cudaExternalSemaphoreSignalParams__bindgen_ty_1,
        reserved
    ) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaExternalSemaphoreSignalParams"]
        [::std::mem::size_of::<cudaExternalSemaphoreSignalParams>() - 144usize];
    ["Alignment of cudaExternalSemaphoreSignalParams"]
        [::std::mem::align_of::<cudaExternalSemaphoreSignalParams>() - 8usize];
    ["Offset of field: cudaExternalSemaphoreSignalParams::params"]
        [::std::mem::offset_of!(cudaExternalSemaphoreSignalParams, params) - 0usize];
    ["Offset of field: cudaExternalSemaphoreSignalParams::flags"]
        [::std::mem::offset_of!(cudaExternalSemaphoreSignalParams, flags) - 72usize];
    ["Offset of field: cudaExternalSemaphoreSignalParams::reserved"]
        [::std::mem::offset_of!(cudaExternalSemaphoreSignalParams, reserved) - 76usize];
};
#[doc = " External semaphore wait parameters, compatible with driver type"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct cudaExternalSemaphoreWaitParams {
    pub params: cudaExternalSemaphoreWaitParams__bindgen_ty_1,
    #[doc = " Only when ::cudaExternalSemaphoreSignalParams is used to\n signal a ::cudaExternalSemaphore_t of type\n ::cudaExternalSemaphoreHandleTypeNvSciSync, the valid flag is\n ::cudaExternalSemaphoreSignalSkipNvSciBufMemSync: which indicates\n that while waiting for the ::cudaExternalSemaphore_t, no memory\n synchronization operations should be performed for any external memory\n object imported as ::cudaExternalMemoryHandleTypeNvSciBuf.\n For all other types of ::cudaExternalSemaphore_t, flags must be zero."]
    pub flags: ::std::os::raw::c_uint,
    pub reserved: [::std::os::raw::c_uint; 16usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct cudaExternalSemaphoreWaitParams__bindgen_ty_1 {
    pub fence: cudaExternalSemaphoreWaitParams__bindgen_ty_1__bindgen_ty_1,
    pub nvSciSync: cudaExternalSemaphoreWaitParams__bindgen_ty_1__bindgen_ty_2,
    pub keyedMutex: cudaExternalSemaphoreWaitParams__bindgen_ty_1__bindgen_ty_3,
    pub reserved: [::std::os::raw::c_uint; 10usize],
}
#[doc = " Parameters for fence objects"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaExternalSemaphoreWaitParams__bindgen_ty_1__bindgen_ty_1 {
    #[doc = " Value of fence to be waited on"]
    pub value: ::std::os::raw::c_ulonglong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaExternalSemaphoreWaitParams__bindgen_ty_1__bindgen_ty_1"][::std::mem::size_of::<
        cudaExternalSemaphoreWaitParams__bindgen_ty_1__bindgen_ty_1,
    >() - 8usize];
    ["Alignment of cudaExternalSemaphoreWaitParams__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<cudaExternalSemaphoreWaitParams__bindgen_ty_1__bindgen_ty_1>()
            - 8usize];
    ["Offset of field: cudaExternalSemaphoreWaitParams__bindgen_ty_1__bindgen_ty_1::value"][::std::mem::offset_of!(
        cudaExternalSemaphoreWaitParams__bindgen_ty_1__bindgen_ty_1,
        value
    )
        - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union cudaExternalSemaphoreWaitParams__bindgen_ty_1__bindgen_ty_2 {
    #[doc = " Pointer to NvSciSyncFence. Valid if ::cudaExternalSemaphoreHandleType\n is of type ::cudaExternalSemaphoreHandleTypeNvSciSync."]
    pub fence: *mut ::std::os::raw::c_void,
    pub reserved: ::std::os::raw::c_ulonglong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaExternalSemaphoreWaitParams__bindgen_ty_1__bindgen_ty_2"][::std::mem::size_of::<
        cudaExternalSemaphoreWaitParams__bindgen_ty_1__bindgen_ty_2,
    >() - 8usize];
    ["Alignment of cudaExternalSemaphoreWaitParams__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<cudaExternalSemaphoreWaitParams__bindgen_ty_1__bindgen_ty_2>()
            - 8usize];
    ["Offset of field: cudaExternalSemaphoreWaitParams__bindgen_ty_1__bindgen_ty_2::fence"][::std::mem::offset_of!(
        cudaExternalSemaphoreWaitParams__bindgen_ty_1__bindgen_ty_2,
        fence
    )
        - 0usize];
    ["Offset of field: cudaExternalSemaphoreWaitParams__bindgen_ty_1__bindgen_ty_2::reserved"][::std::mem::offset_of!(
        cudaExternalSemaphoreWaitParams__bindgen_ty_1__bindgen_ty_2,
        reserved
    )
        - 0usize];
};
#[doc = " Parameters for keyed mutex objects"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaExternalSemaphoreWaitParams__bindgen_ty_1__bindgen_ty_3 {
    #[doc = " Value of key to acquire the mutex with"]
    pub key: ::std::os::raw::c_ulonglong,
    #[doc = " Timeout in milliseconds to wait to acquire the mutex"]
    pub timeoutMs: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaExternalSemaphoreWaitParams__bindgen_ty_1__bindgen_ty_3"][::std::mem::size_of::<
        cudaExternalSemaphoreWaitParams__bindgen_ty_1__bindgen_ty_3,
    >() - 16usize];
    ["Alignment of cudaExternalSemaphoreWaitParams__bindgen_ty_1__bindgen_ty_3"]
        [::std::mem::align_of::<cudaExternalSemaphoreWaitParams__bindgen_ty_1__bindgen_ty_3>()
            - 8usize];
    ["Offset of field: cudaExternalSemaphoreWaitParams__bindgen_ty_1__bindgen_ty_3::key"][::std::mem::offset_of!(
        cudaExternalSemaphoreWaitParams__bindgen_ty_1__bindgen_ty_3,
        key
    )
        - 0usize];
    ["Offset of field: cudaExternalSemaphoreWaitParams__bindgen_ty_1__bindgen_ty_3::timeoutMs"][::std::mem::offset_of!(
        cudaExternalSemaphoreWaitParams__bindgen_ty_1__bindgen_ty_3,
        timeoutMs
    )
        - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaExternalSemaphoreWaitParams__bindgen_ty_1"]
        [::std::mem::size_of::<cudaExternalSemaphoreWaitParams__bindgen_ty_1>() - 72usize];
    ["Alignment of cudaExternalSemaphoreWaitParams__bindgen_ty_1"]
        [::std::mem::align_of::<cudaExternalSemaphoreWaitParams__bindgen_ty_1>() - 8usize];
    ["Offset of field: cudaExternalSemaphoreWaitParams__bindgen_ty_1::fence"]
        [::std::mem::offset_of!(cudaExternalSemaphoreWaitParams__bindgen_ty_1, fence) - 0usize];
    ["Offset of field: cudaExternalSemaphoreWaitParams__bindgen_ty_1::nvSciSync"]
        [::std::mem::offset_of!(cudaExternalSemaphoreWaitParams__bindgen_ty_1, nvSciSync) - 8usize];
    ["Offset of field: cudaExternalSemaphoreWaitParams__bindgen_ty_1::keyedMutex"][::std::mem::offset_of!(
        cudaExternalSemaphoreWaitParams__bindgen_ty_1,
        keyedMutex
    ) - 16usize];
    ["Offset of field: cudaExternalSemaphoreWaitParams__bindgen_ty_1::reserved"]
        [::std::mem::offset_of!(cudaExternalSemaphoreWaitParams__bindgen_ty_1, reserved) - 32usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaExternalSemaphoreWaitParams"]
        [::std::mem::size_of::<cudaExternalSemaphoreWaitParams>() - 144usize];
    ["Alignment of cudaExternalSemaphoreWaitParams"]
        [::std::mem::align_of::<cudaExternalSemaphoreWaitParams>() - 8usize];
    ["Offset of field: cudaExternalSemaphoreWaitParams::params"]
        [::std::mem::offset_of!(cudaExternalSemaphoreWaitParams, params) - 0usize];
    ["Offset of field: cudaExternalSemaphoreWaitParams::flags"]
        [::std::mem::offset_of!(cudaExternalSemaphoreWaitParams, flags) - 72usize];
    ["Offset of field: cudaExternalSemaphoreWaitParams::reserved"]
        [::std::mem::offset_of!(cudaExternalSemaphoreWaitParams, reserved) - 76usize];
};
#[doc = " CUDA Error types"]
pub use self::cudaError as cudaError_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUstream_st {
    _unused: [u8; 0],
}
#[doc = " CUDA stream"]
pub type cudaStream_t = *mut CUstream_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUevent_st {
    _unused: [u8; 0],
}
#[doc = " CUDA event types"]
pub type cudaEvent_t = *mut CUevent_st;
#[doc = " CUDA graphics resource types"]
pub type cudaGraphicsResource_t = *mut cudaGraphicsResource;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUexternalMemory_st {
    _unused: [u8; 0],
}
#[doc = " CUDA external memory"]
pub type cudaExternalMemory_t = *mut CUexternalMemory_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUexternalSemaphore_st {
    _unused: [u8; 0],
}
#[doc = " CUDA external semaphore"]
pub type cudaExternalSemaphore_t = *mut CUexternalSemaphore_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUgraph_st {
    _unused: [u8; 0],
}
#[doc = " CUDA graph"]
pub type cudaGraph_t = *mut CUgraph_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUgraphNode_st {
    _unused: [u8; 0],
}
#[doc = " CUDA graph node."]
pub type cudaGraphNode_t = *mut CUgraphNode_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUuserObject_st {
    _unused: [u8; 0],
}
#[doc = " CUDA user object for graphs"]
pub type cudaUserObject_t = *mut CUuserObject_st;
#[doc = " CUDA handle for conditional graph nodes"]
pub type cudaGraphConditionalHandle = ::std::os::raw::c_ulonglong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUfunc_st {
    _unused: [u8; 0],
}
#[doc = " CUDA function"]
pub type cudaFunction_t = *mut CUfunc_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUkern_st {
    _unused: [u8; 0],
}
#[doc = " CUDA kernel"]
pub type cudaKernel_t = *mut CUkern_st;
#[doc = " Max number of registers that a thread may use.\\n\n Option type: unsigned int\\n\n Applies to: compiler only"]
pub const cudaJitOption_cudaJitMaxRegisters: cudaJitOption = 0;
#[doc = " IN: Specifies minimum number of threads per block to target compilation\n for\\n\n OUT: Returns the number of threads the compiler actually targeted.\n This restricts the resource utilization of the compiler (e.g. max\n registers) such that a block with the given number of threads should be\n able to launch based on register limitations. Note, this option does not\n currently take into account any other resource limitations, such as\n shared memory utilization.\\n\n Option type: unsigned int\\n\n Applies to: compiler only"]
pub const cudaJitOption_cudaJitThreadsPerBlock: cudaJitOption = 1;
#[doc = " Overwrites the option value with the total wall clock time, in\n milliseconds, spent in the compiler and linker\\n\n Option type: float\\n\n Applies to: compiler and linker"]
pub const cudaJitOption_cudaJitWallTime: cudaJitOption = 2;
#[doc = " Pointer to a buffer in which to print any log messages\n that are informational in nature (the buffer size is specified via\n option ::cudaJitInfoLogBufferSizeBytes)\\n\n Option type: char *\\n\n Applies to: compiler and linker"]
pub const cudaJitOption_cudaJitInfoLogBuffer: cudaJitOption = 3;
#[doc = " IN: Log buffer size in bytes.  Log messages will be capped at this size\n (including null terminator)\\n\n OUT: Amount of log buffer filled with messages\\n\n Option type: unsigned int\\n\n Applies to: compiler and linker"]
pub const cudaJitOption_cudaJitInfoLogBufferSizeBytes: cudaJitOption = 4;
#[doc = " Pointer to a buffer in which to print any log messages that\n reflect errors (the buffer size is specified via option\n ::cudaJitErrorLogBufferSizeBytes)\\n\n Option type: char *\\n\n Applies to: compiler and linker"]
pub const cudaJitOption_cudaJitErrorLogBuffer: cudaJitOption = 5;
#[doc = " IN: Log buffer size in bytes.  Log messages will be capped at this size\n (including null terminator)\\n\n OUT: Amount of log buffer filled with messages\\n\n Option type: unsigned int\\n\n Applies to: compiler and linker"]
pub const cudaJitOption_cudaJitErrorLogBufferSizeBytes: cudaJitOption = 6;
#[doc = " Level of optimizations to apply to generated code (0 - 4), with 4\n being the default and highest level of optimizations.\\n\n Option type: unsigned int\\n\n Applies to: compiler only"]
pub const cudaJitOption_cudaJitOptimizationLevel: cudaJitOption = 7;
#[doc = " Specifies choice of fallback strategy if matching cubin is not found.\n Choice is based on supplied ::cudaJit_Fallback.\n Option type: unsigned int for enumerated type ::cudaJit_Fallback\\n\n Applies to: compiler only"]
pub const cudaJitOption_cudaJitFallbackStrategy: cudaJitOption = 10;
#[doc = " Specifies whether to create debug information in output (-g)\n (0: false, default)\\n\n Option type: int\\n\n Applies to: compiler and linker"]
pub const cudaJitOption_cudaJitGenerateDebugInfo: cudaJitOption = 11;
#[doc = " Generate verbose log messages (0: false, default)\\n\n Option type: int\\n\n Applies to: compiler and linker"]
pub const cudaJitOption_cudaJitLogVerbose: cudaJitOption = 12;
#[doc = " Generate line number information (-lineinfo) (0: false, default)\\n\n Option type: int\\n\n Applies to: compiler only"]
pub const cudaJitOption_cudaJitGenerateLineInfo: cudaJitOption = 13;
#[doc = " Specifies whether to enable caching explicitly (-dlcm) \\n\n Choice is based on supplied ::cudaJit_CacheMode.\\n\n Option type: unsigned int for enumerated type ::cudaJit_CacheMode\\n\n Applies to: compiler only"]
pub const cudaJitOption_cudaJitCacheMode: cudaJitOption = 14;
#[doc = " Generate position independent code (0: false)\\n\n Option type: int\\n\n Applies to: compiler only"]
pub const cudaJitOption_cudaJitPositionIndependentCode: cudaJitOption = 30;
#[doc = " This option hints to the JIT compiler the minimum number of CTAs from the\n kernels grid to be mapped to a SM. This option is ignored when used together\n with ::cudaJitMaxRegisters or ::cudaJitThreadsPerBlock.\n Optimizations based on this option need ::cudaJitMaxThreadsPerBlock to\n be specified as well. For kernels already using PTX directive .minnctapersm,\n this option will be ignored by default. Use ::cudaJitOverrideDirectiveValues\n to let this option take precedence over the PTX directive.\n Option type: unsigned int\\n\n Applies to: compiler only"]
pub const cudaJitOption_cudaJitMinCtaPerSm: cudaJitOption = 31;
#[doc = " Maximum number threads in a thread block, computed as the product of\n the maximum extent specifed for each dimension of the block. This limit\n is guaranteed not to be exeeded in any invocation of the kernel. Exceeding\n the the maximum number of threads results in runtime error or kernel launch\n failure. For kernels already using PTX directive .maxntid, this option will\n be ignored by default. Use ::cudaJitOverrideDirectiveValues to let this\n option take precedence over the PTX directive.\n Option type: int\\n\n Applies to: compiler only"]
pub const cudaJitOption_cudaJitMaxThreadsPerBlock: cudaJitOption = 32;
#[doc = " This option lets the values specified using ::cudaJitMaxRegisters,\n ::cudaJitThreadsPerBlock, ::cudaJitMaxThreadsPerBlock and\n ::cudaJitMinCtaPerSm take precedence over any PTX directives.\n (0: Disable, default; 1: Enable)\n Option type: int\\n\n Applies to: compiler only"]
pub const cudaJitOption_cudaJitOverrideDirectiveValues: cudaJitOption = 33;
#[doc = " Online compiler and linker options"]
pub type cudaJitOption = ::std::os::raw::c_uint;
pub const cudaLibraryOption_cudaLibraryHostUniversalFunctionAndDataTable: cudaLibraryOption = 0;
#[doc = " Specifes that the argument \\p code passed to ::cudaLibraryLoadData() will be preserved.\n Specifying this option will let the driver know that \\p code can be accessed at any point\n until ::cudaLibraryUnload(). The default behavior is for the driver to allocate and\n maintain its own copy of \\p code. Note that this is only a memory usage optimization\n hint and the driver can choose to ignore it if required.\n Specifying this option with ::cudaLibraryLoadFromFile() is invalid and\n will return ::cudaErrorInvalidValue."]
pub const cudaLibraryOption_cudaLibraryBinaryIsPreserved: cudaLibraryOption = 1;
#[doc = " Library options to be specified with ::cudaLibraryLoadData() or ::cudaLibraryLoadFromFile()"]
pub type cudaLibraryOption = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudalibraryHostUniversalFunctionAndDataTable {
    pub functionTable: *mut ::std::os::raw::c_void,
    pub functionWindowSize: usize,
    pub dataTable: *mut ::std::os::raw::c_void,
    pub dataWindowSize: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudalibraryHostUniversalFunctionAndDataTable"]
        [::std::mem::size_of::<cudalibraryHostUniversalFunctionAndDataTable>() - 32usize];
    ["Alignment of cudalibraryHostUniversalFunctionAndDataTable"]
        [::std::mem::align_of::<cudalibraryHostUniversalFunctionAndDataTable>() - 8usize];
    ["Offset of field: cudalibraryHostUniversalFunctionAndDataTable::functionTable"][::std::mem::offset_of!(
        cudalibraryHostUniversalFunctionAndDataTable,
        functionTable
    ) - 0usize];
    ["Offset of field: cudalibraryHostUniversalFunctionAndDataTable::functionWindowSize"][::std::mem::offset_of!(
        cudalibraryHostUniversalFunctionAndDataTable,
        functionWindowSize
    )
        - 8usize];
    ["Offset of field: cudalibraryHostUniversalFunctionAndDataTable::dataTable"]
        [::std::mem::offset_of!(cudalibraryHostUniversalFunctionAndDataTable, dataTable) - 16usize];
    ["Offset of field: cudalibraryHostUniversalFunctionAndDataTable::dataWindowSize"][::std::mem::offset_of!(
        cudalibraryHostUniversalFunctionAndDataTable,
        dataWindowSize
    ) - 24usize];
};
#[doc = "< Compile with no -dlcm flag specified"]
pub const cudaJit_CacheMode_cudaJitCacheOptionNone: cudaJit_CacheMode = 0;
#[doc = "< Compile with L1 cache disabled"]
pub const cudaJit_CacheMode_cudaJitCacheOptionCG: cudaJit_CacheMode = 1;
#[doc = "< Compile with L1 cache enabled"]
pub const cudaJit_CacheMode_cudaJitCacheOptionCA: cudaJit_CacheMode = 2;
#[doc = " Caching modes for dlcm"]
pub type cudaJit_CacheMode = ::std::os::raw::c_uint;
#[doc = "< Prefer to compile ptx if exact binary match not found"]
pub const cudaJit_Fallback_cudaPreferPtx: cudaJit_Fallback = 0;
#[doc = "< Prefer to fall back to compatible binary code if exact match not found"]
pub const cudaJit_Fallback_cudaPreferBinary: cudaJit_Fallback = 1;
#[doc = " Cubin matching fallback strategies"]
pub type cudaJit_Fallback = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUlib_st {
    _unused: [u8; 0],
}
#[doc = " CUDA library"]
pub type cudaLibrary_t = *mut CUlib_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUmemPoolHandle_st {
    _unused: [u8; 0],
}
#[doc = " CUDA memory pool"]
pub type cudaMemPool_t = *mut CUmemPoolHandle_st;
#[doc = "< Invalid cooperative group scope"]
pub const cudaCGScope_cudaCGScopeInvalid: cudaCGScope = 0;
#[doc = "< Scope represented by a grid_group"]
pub const cudaCGScope_cudaCGScopeGrid: cudaCGScope = 1;
#[doc = "< Reserved"]
pub const cudaCGScope_cudaCGScopeReserved: cudaCGScope = 2;
#[doc = " CUDA cooperative group scope"]
pub type cudaCGScope = ::std::os::raw::c_uint;
#[doc = " CUDA GPU kernel node parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaKernelNodeParams {
    #[doc = "< Kernel to launch"]
    pub func: *mut ::std::os::raw::c_void,
    #[doc = "< Grid dimensions"]
    pub gridDim: dim3,
    #[doc = "< Block dimensions"]
    pub blockDim: dim3,
    #[doc = "< Dynamic shared-memory size per thread block in bytes"]
    pub sharedMemBytes: ::std::os::raw::c_uint,
    #[doc = "< Array of pointers to individual kernel arguments"]
    pub kernelParams: *mut *mut ::std::os::raw::c_void,
    #[doc = "< Pointer to kernel arguments in the \"extra\" format"]
    pub extra: *mut *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaKernelNodeParams"][::std::mem::size_of::<cudaKernelNodeParams>() - 56usize];
    ["Alignment of cudaKernelNodeParams"][::std::mem::align_of::<cudaKernelNodeParams>() - 8usize];
    ["Offset of field: cudaKernelNodeParams::func"]
        [::std::mem::offset_of!(cudaKernelNodeParams, func) - 0usize];
    ["Offset of field: cudaKernelNodeParams::gridDim"]
        [::std::mem::offset_of!(cudaKernelNodeParams, gridDim) - 8usize];
    ["Offset of field: cudaKernelNodeParams::blockDim"]
        [::std::mem::offset_of!(cudaKernelNodeParams, blockDim) - 20usize];
    ["Offset of field: cudaKernelNodeParams::sharedMemBytes"]
        [::std::mem::offset_of!(cudaKernelNodeParams, sharedMemBytes) - 32usize];
    ["Offset of field: cudaKernelNodeParams::kernelParams"]
        [::std::mem::offset_of!(cudaKernelNodeParams, kernelParams) - 40usize];
    ["Offset of field: cudaKernelNodeParams::extra"]
        [::std::mem::offset_of!(cudaKernelNodeParams, extra) - 48usize];
};
#[doc = " CUDA GPU kernel node parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaKernelNodeParamsV2 {
    #[doc = "< Kernel to launch"]
    pub func: *mut ::std::os::raw::c_void,
    #[doc = "< Grid dimensions"]
    pub gridDim: dim3,
    #[doc = "< Block dimensions"]
    pub blockDim: dim3,
    #[doc = "< Dynamic shared-memory size per thread block in bytes"]
    pub sharedMemBytes: ::std::os::raw::c_uint,
    #[doc = "< Array of pointers to individual kernel arguments"]
    pub kernelParams: *mut *mut ::std::os::raw::c_void,
    #[doc = "< Pointer to kernel arguments in the \"extra\" format"]
    pub extra: *mut *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaKernelNodeParamsV2"][::std::mem::size_of::<cudaKernelNodeParamsV2>() - 56usize];
    ["Alignment of cudaKernelNodeParamsV2"]
        [::std::mem::align_of::<cudaKernelNodeParamsV2>() - 8usize];
    ["Offset of field: cudaKernelNodeParamsV2::func"]
        [::std::mem::offset_of!(cudaKernelNodeParamsV2, func) - 0usize];
    ["Offset of field: cudaKernelNodeParamsV2::gridDim"]
        [::std::mem::offset_of!(cudaKernelNodeParamsV2, gridDim) - 8usize];
    ["Offset of field: cudaKernelNodeParamsV2::blockDim"]
        [::std::mem::offset_of!(cudaKernelNodeParamsV2, blockDim) - 20usize];
    ["Offset of field: cudaKernelNodeParamsV2::sharedMemBytes"]
        [::std::mem::offset_of!(cudaKernelNodeParamsV2, sharedMemBytes) - 32usize];
    ["Offset of field: cudaKernelNodeParamsV2::kernelParams"]
        [::std::mem::offset_of!(cudaKernelNodeParamsV2, kernelParams) - 40usize];
    ["Offset of field: cudaKernelNodeParamsV2::extra"]
        [::std::mem::offset_of!(cudaKernelNodeParamsV2, extra) - 48usize];
};
#[doc = " External semaphore signal node parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaExternalSemaphoreSignalNodeParams {
    #[doc = "< Array of external semaphore handles."]
    pub extSemArray: *mut cudaExternalSemaphore_t,
    #[doc = "< Array of external semaphore signal parameters."]
    pub paramsArray: *const cudaExternalSemaphoreSignalParams,
    #[doc = "< Number of handles and parameters supplied in extSemArray and paramsArray."]
    pub numExtSems: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaExternalSemaphoreSignalNodeParams"]
        [::std::mem::size_of::<cudaExternalSemaphoreSignalNodeParams>() - 24usize];
    ["Alignment of cudaExternalSemaphoreSignalNodeParams"]
        [::std::mem::align_of::<cudaExternalSemaphoreSignalNodeParams>() - 8usize];
    ["Offset of field: cudaExternalSemaphoreSignalNodeParams::extSemArray"]
        [::std::mem::offset_of!(cudaExternalSemaphoreSignalNodeParams, extSemArray) - 0usize];
    ["Offset of field: cudaExternalSemaphoreSignalNodeParams::paramsArray"]
        [::std::mem::offset_of!(cudaExternalSemaphoreSignalNodeParams, paramsArray) - 8usize];
    ["Offset of field: cudaExternalSemaphoreSignalNodeParams::numExtSems"]
        [::std::mem::offset_of!(cudaExternalSemaphoreSignalNodeParams, numExtSems) - 16usize];
};
#[doc = " External semaphore signal node parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaExternalSemaphoreSignalNodeParamsV2 {
    #[doc = "< Array of external semaphore handles."]
    pub extSemArray: *mut cudaExternalSemaphore_t,
    #[doc = "< Array of external semaphore signal parameters."]
    pub paramsArray: *const cudaExternalSemaphoreSignalParams,
    #[doc = "< Number of handles and parameters supplied in extSemArray and paramsArray."]
    pub numExtSems: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaExternalSemaphoreSignalNodeParamsV2"]
        [::std::mem::size_of::<cudaExternalSemaphoreSignalNodeParamsV2>() - 24usize];
    ["Alignment of cudaExternalSemaphoreSignalNodeParamsV2"]
        [::std::mem::align_of::<cudaExternalSemaphoreSignalNodeParamsV2>() - 8usize];
    ["Offset of field: cudaExternalSemaphoreSignalNodeParamsV2::extSemArray"]
        [::std::mem::offset_of!(cudaExternalSemaphoreSignalNodeParamsV2, extSemArray) - 0usize];
    ["Offset of field: cudaExternalSemaphoreSignalNodeParamsV2::paramsArray"]
        [::std::mem::offset_of!(cudaExternalSemaphoreSignalNodeParamsV2, paramsArray) - 8usize];
    ["Offset of field: cudaExternalSemaphoreSignalNodeParamsV2::numExtSems"]
        [::std::mem::offset_of!(cudaExternalSemaphoreSignalNodeParamsV2, numExtSems) - 16usize];
};
#[doc = " External semaphore wait node parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaExternalSemaphoreWaitNodeParams {
    #[doc = "< Array of external semaphore handles."]
    pub extSemArray: *mut cudaExternalSemaphore_t,
    #[doc = "< Array of external semaphore wait parameters."]
    pub paramsArray: *const cudaExternalSemaphoreWaitParams,
    #[doc = "< Number of handles and parameters supplied in extSemArray and paramsArray."]
    pub numExtSems: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaExternalSemaphoreWaitNodeParams"]
        [::std::mem::size_of::<cudaExternalSemaphoreWaitNodeParams>() - 24usize];
    ["Alignment of cudaExternalSemaphoreWaitNodeParams"]
        [::std::mem::align_of::<cudaExternalSemaphoreWaitNodeParams>() - 8usize];
    ["Offset of field: cudaExternalSemaphoreWaitNodeParams::extSemArray"]
        [::std::mem::offset_of!(cudaExternalSemaphoreWaitNodeParams, extSemArray) - 0usize];
    ["Offset of field: cudaExternalSemaphoreWaitNodeParams::paramsArray"]
        [::std::mem::offset_of!(cudaExternalSemaphoreWaitNodeParams, paramsArray) - 8usize];
    ["Offset of field: cudaExternalSemaphoreWaitNodeParams::numExtSems"]
        [::std::mem::offset_of!(cudaExternalSemaphoreWaitNodeParams, numExtSems) - 16usize];
};
#[doc = " External semaphore wait node parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cudaExternalSemaphoreWaitNodeParamsV2 {
    #[doc = "< Array of external semaphore handles."]
    pub extSemArray: *mut cudaExternalSemaphore_t,
    #[doc = "< Array of external semaphore wait parameters."]
    pub paramsArray: *const cudaExternalSemaphoreWaitParams,
    #[doc = "< Number of handles and parameters supplied in extSemArray and paramsArray."]
    pub numExtSems: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cudaExternalSemaphoreWaitNodeParamsV2"]
        [::std::mem::size_of::<cudaExternalSemaphoreWaitNodeParamsV2>() - 24usize];
    ["Alignment of cudaExternalSemaphoreWaitNodeParamsV2"]
        [::std::mem::align_of::<cudaExternalSemaphoreWaitNodeParamsV2>() - 8usize];
    ["Offset of field: cudaExternalSemaphoreWaitNodeParamsV2::extSemArray"]
        [::std::mem::offset_of!(cudaExternalSemaphoreWaitNodeParamsV2, extSemArray) - 0usize];
    ["Offset of field: cudaExternalSemaphoreWaitNodeParamsV2::paramsArray"]
        [::std::mem::offset_of!(cudaExternalSemaphoreWaitNodeParamsV2, paramsArray) - 8usize];
    ["Offset of field: cudaExternalSemaphoreWaitNodeParamsV2::numExtSems"]
        [::std::mem::offset_of!(cudaExternalSemaphoreWaitNodeParamsV2, numExtSems) - 16usize];
};
#[doc = "< Apply default handle value when graph is launched."]
pub const cudaGraphConditionalHandleFlags_cudaGraphCondAssignDefault:
    cudaGraphConditionalHandleFlags = 1;
pub type cudaGraphConditionalHandleFlags = ::std::os::raw::c_uint;
#[doc = "< Conditional 'if/else' Node. Body[0] executed if condition is non-zero.  If \\p size == 2, an optional ELSE graph is created and this is executed if the condition is zero."]
pub const cudaGraphConditionalNodeType_cudaGraphCondTypeIf: cudaGraphConditionalNodeType = 0;
#[doc = "< Conditional 'while' Node. Body executed repeatedly while condition value is non-zero."]
pub const cudaGraphConditionalNodeType_cudaGraphCondTypeWhile: cudaGraphConditionalNodeType = 1;
#[doc = "< Conditional 'switch' Node. Body[n] is executed once, where 'n' is the value of the condition. If the condition does not match a body index, no body is launched."]
pub const cudaGraphConditionalNodeType_cudaGraphCondTypeSwitch: cudaGraphConditionalNodeType = 2;
#[doc = " CUDA conditional node types"]
pub type cudaGraphConditionalNodeType = ::std::os::raw::c_uint;
#[doc = " CUDA conditional node parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
